export const data = [
  {
    id: 1,
    title: "سنن السفر",
    sunan: [
      {
        id: 1,
        title: "إختيار أمير في السفر",
        desc: "من السنة إختيار أمير في السفر.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا كانَ ثلاثةٌ في سفَرٍ فليؤمِّروا أحدَهُم"',
            source: "صحيح أبي داود 2609",
          },
        ],
      },
      {
        id: 2,
        title: "التكبير عند الصعود والتسبيح عند النزول",
        desc: "من السنة التكبير عند الصعود والتسبيح عند النزول",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "كُنَّا إذَا صَعِدْنَا كَبَّرْنَا، وإذَا نَزَلْنَا سَبَّحْنَا"',
            source: "صحيح البخاري 2993",
            expl: "المُسلِمُ الحَقُّ ذَاكرٌ للهِ تعالَى، مُستَشعِرٌ لِعَظَمَتِه في كُلِّ أحوالِه، وهكذا كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ وأصحابُه، كما يُبَيَّنُ هذا الحَديثُ، فيَروي جابِرُ بنُ عَبدِ اللهِ رَضيَ اللهُ عنهما أنَّهم كانوا كُلَّما صَعِدوا مُرتَفَعًا في طَريقِهم كَبَّروا، فقالوا: اللهُ أكبَرُ، وكُلَّما نَزَلوا مُنزَلًا وهَبَطوا منه سَبَّحوا، فقالوا: سُبحانَ اللهِ؛ لِأنَّه لَمَّا كان الصُّعودُ ارتِفاعًا، ناسَبَه التَّكبيرُ، أي: أنَّ اللهَ سُبحانَه أكبَرُ مِن كُلِّ كَبيرٍ، وأعْلَى مِن كُلِّ رَفيعٍ، كما أنَّ في التَّكبيرِ عِندَ إشرافِه على الجِبالِ وكُلِّ مُرتَفَعٍ استِشعارًا لِكِبرياءِ اللهِ عَزَّ وجَلَّ، ولَمَّا كان النُّزولُ هُبوطًا، ناسَبَه التَّنزيهُ؛ لِأنَّه سُبحانَه هو العَليُّ الكَبيرُ، ولِأنَّ التَّسبيحَ تَنزيهُ اللهِ عن صِفاتِ الانخِفاضِ والضِّعةِ، وقيلَ: التَّسبيحُ في بُطونِ الأوديةِ، وفي المُنخَفَضاتِ، مُستَنبَطٌ مِن قِصَّةِ نَبيِّ اللهِ يُونُسَ عليه الصَّلاةُ والسَّلامُ؛ قال اللهُ تعالَى: {فَلَوْلَا أَنَّهُ كَانَ مِنَ الْمُسَبِّحِينَ * لَلَبِثَ فِي بَطْنِهِ إِلَى يَوْمِ يُبْعَثُونَ} [الصافات: 143، 144]، فنَجَّاه اللهُ تعالَى بتَسبيحِه في بَطْنِ الحُوتِ مِنَ الظُّلُماتِ، فامتَثَلَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ هذا التَّسبيحَ في بُطونِ الأوديةِ؛ لِيُنَجِّيَه اللهُ منها.",
          },
        ],
      },
      {
        id: 3,
        title: "الدعاء حين نزول منزل",
        desc: "من السنة الدعاء حين نزول منزل",
        ahadith: [
          {
            id: 1,
            title: 'عن خولة بنت حكيم رضي الله عنها قالت: سمعت رسول الله صلى الله عليه وسلم يقول: "مَن نَزَلَ مَنْزِلًا، ثُمَّ قالَ: أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ؛ لَمْ يَضُرَّهُ شَيءٌ حتَّى يَرْتَحِلَ مِن مَنْزِلِهِ ذلكَ"',
            source: "صحيح مسلم 2708",
          },
        ],
      },
      {
        id: 4,
        title: "البدأ بالمسجد إذا قدم من السفر",
        desc: "من السنة البدأ بالمسجد عند القدوم من سفر",
        ahadith: [
          {
            id: 1,
            title: 'عن كعب بن مالك رضي الله عنه قال: "...وكانَ إذَا قَدِمَ مِن سَفَرٍ، بَدَأَ بالمَسْجِدِ، فَيَرْكَعُ فيه رَكْعَتَيْنِ، ثُمَّ جَلَسَ لِلنَّاسِ..."',
            source: "صحيح البخاري 4418",
          },
        ],
      },
      {
        id: 5,
        title: "عدم سفر المرأة وحدها",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بالله واليَومِ الآخِرِ أنْ تُسافِرَ مَسِيرَةَ يَومٍ ولَيْلَةٍ ليسَ معها حُرْمَةٌ"',
            source: "صحيح البخاري 1088",
          },
        ],
      },
    ],
  },
  {
    id: 2,
    title: "سنن اللباس",
    sunan: [
      {
        id: 1,
        title: "التَّيامُنُ عند لُبسِ الثِّيابِ",
        isFavorite: false,
        desc: "من السنة إذا أراد المسلم أن يلبس نعليه أن يبدأ باليمنى ، ومن السنة إذا أراد أن ينزع نعليه أن يبدأ باليسرى.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه أن الرسول صلى الله عليه وسلم قال: "إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ باليَمِينِ، وإذَا نَزَعَ فَلْيَبْدَأْ بالشِّمَالِ، لِيَكُنِ اليُمْنَى أَوَّلَهُما تُنْعَلُ، وَآخِرَهُما تُنْزَعُ".',
            source: "صحيح البخاري 5855",
          },
          {
            id: 2,
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"', 
            source: "صحيح بخاري 168",
          },
          {
            id: 3,
            title: 'عن أبي هُريرةَ رضي الله عنه، قال: قال رَسولُ الله صلَّى اللهُ عليه وسلَّم: "إذا لَبِستُم وإذا توضَّأتُم، فابدَؤوا بأيامِنِكم"',
            source: "صحيح أبي داود 4141",
          },
          {
            id: 4,
            title: 'عن حارثةَ بنِ وَهبٍ الخُزاعيِّ، قال: "حَدَّثَتْني حَفصةُ زَوجُ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يَجعَلُ يَمينَه لطعامِه وشَرابِه وثِيابِه، ويجعَلُ شِمالَه لِما سِوى ذلك"',
            source: "صحيح أبي داود 32",
          },
        ],
      },
      {
        id: 2,
        title: "ما يدعو به من لَبِسَ ثوبًا جديدًا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخُدريِّ رضي الله عنه، قال: "كان رسولُ الله صلَّى اللهُ عليه وسلَّم: إذا استجَدَّ ثَوبًا سَمَّاه باسْمِه؛ إمَّا قميصًا أو عِمامةً، ثمَّ يقولُ: اللَّهُمَّ لك الحَمدُ أنت كسَوتَنِيه، أسألُك مِن خَيرِه وخَيرِ ما صُنِعَ له، وأعوذُ بك مِن شَرِّه وشَرِّ ما صُنِعَ له"',
            source: "الجامع الصغير 6544",
          },
          {
            id: 2,
            title: 'عن مُعاذِ بنِ أنَسٍ رضي الله عنه، أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "مَن لَبِسَ ثَوبًا فقال: الحَمدُ لله الذي كَساني هذا الثَّوبَ ورَزَقَنيه مِن غَيرِ حَولٍ مِنِّي ولا قُوَّةٍ، غُفِرَ له ما تقَدَّمَ مِن ذَنبِه"',
            source: "صحيح أبي داود 4023",
          },
        ],
      },
      {
        id: 3,
        title: "ما يقولُ مَن رأَى على أخيه ثوبًا جديدًا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أمِّ خالدٍ بنتِ خالدٍ رضي الله عنها، قالت: "أُتِيَ النَّبيُّ صلَّى اللهُ عليه وسلَّم بثيابٍ فيها خَميصةٌ سَوداءُ صَغيرةٌ، فقال: مَن تَرَونَ نكسو هذه؟ فسكَتَ القَومُ، قال: ائتُوني بأمِّ خالدٍ، فأُتِيَ بها تُحمَلُ، فأخَذَ الخميصةَ بِيَدِه فألبَسَها وقال: أبلِي وأخْلِقي. وكان فيها علَمٌ أخضَرُ أو أصفَرُ، فقال: يا أمَّ خالدٍ، هذا سَنَاهْ"',
            source: "صحيح البخاري 5823",
          },
        ],
      },
      {
        id: 4,
        title: "لُبسُ الأبيضِ مِن الثِّيابِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "البِسوا من ثيابِكُمُ البياضَ فإنَّها مِن خيرِ ثيابِكُم، وَكَفِّنوا فيها موتاكم"',
            source: "صحيح أبي داود 3878",
          },
        ],
      },
      {
        id: 5,
        title: "لُبسُ الثِّيابِ الجَميلةِ والحَسَنةِ بدونِ إسرافٍ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ مَسعودٍ رضي الله عنه، عن النبيِّ صلَّى اللهُ عليه وسلَّم قال: "لا يَدخُلُ الجَنَّةَ مَن كان في قَلبِه مِثقالُ ذَرَّةٍ مِن كِبرٍ، قال رجلٌ: إنَّ الرَّجُلَ يحِبُّ أن يكونَ ثَوبُه حسَنًا ونَعلُه حَسَنةً، قال: إنَّ اللهَ جَميلٌ يُحِبُّ الجَمالَ، الكِبرُ بطَرُ الحَقِّ، وغَمطُ النَّاسِ"',
            source: "صحيح مسلم 91",
          },
          {
            id: 2,
            title: 'عن عَمرِو بنِ شُعَيبٍ، عن أبيه، عن جَدِّه رضي الله عنه: أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "كُلُوا واشْرَبوا، وتصَدَّقوا والبَسُوا، في غَيرِ مَخِيلةٍ ولا سَرَفٍ؛ إنَّ اللهَ يُحِبُّ أن تُرى نِعمَتُه على عَبدِه"',
            source: "صحيح ابن ماجه 2920",
          },
        ],
      },
      {
        id: 6,
        title: "التجَمُّلُ للوُفودِ وللجمعةِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ مولى أسماءَ، قال: "أخرَجَت إليَّ أسماءُ جُبَّةً مِن طيالسةٍ عليها لِبْنةٌ شِبرٌ مِن دِيباجٍ، وإنَّ فَرْجَيها مكفوفانِ به، فقالت: هذه جُبَّةُ رَسولِ الله صلَّى اللهُ عليه وسلَّم، كان يَلبَسُها للوفودِ، ويومَ الجُمُعةِ"',
          },
        ],
      },
      {
        id: 7,
        title: "التواضُعُ في الثِّيابِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أُمامةَ رضي الله عنه، قال: "ذكَرَ أصحابُ رَسولِ الله صلَّى اللهُ عليه وسلَّم يومًا عِندَه الدُّنيا، فقال رسولُ الله صلَّى اللهُ عليه وسلَّم: ألا تَسْمَعونَ، ألا تَسْمَعونَ، إنَّ البَذاذةَ مِن الإيمانِ، إنَّ البَذاذةَ مِن الإيمانِ"',
            source: "صحيح أبي داود 4161",
          },
        ],
      },
      {
        id: 8,
        title: "نظافةُ المَلبَسِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابرِ بنِ عبدِ اللهِ، قال: "أتانا رسولُ الله صلَّى اللهُ عليه وسلَّم، فرأى رجُلًا شَعِثًا قد تفَرَّقَ شَعرُه، فقال: أمَا كان يجِدُ هذا ما يُسَكِّنُ به شَعْرَه، ورأى رجلًا آخَرَ وعليه ثيابٌ وَسِخةٌ، فقال: أما كان هذا يجِدُ ماءً يَغسِلُ به ثَوبَه"',
          },
        ],
      },
      {
        id: 9,
        title: "ألَّا يمشيَ في نَعلٍ واحدةٍ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُريرةَ رَضِيَ اللهُ عنه، أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "لا يَمشي أحَدُكم في نَعلٍ واحدةٍ، لِيُحْفِهما جميعًا، أو لِيُنعِلْهما جميعًا"',
          },
        ],
      },
      {
        id: 10,
        title: "ألَّا يشتملَ الصماءَ",
        isFavorite: false,
        ahadith: [
          {
            id:1,
            title: 'عن أبي الزُّبَيرِ، أنَّه سَمِعَ جابِرَ بنَ عبدِ اللهِ رضي الله عنهما يحَدِّثُ أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "لا تشتَمِلِ الصَّمَّاءَ"',
            source: "",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ نَهَى عن بَيْعَتَيْنِ، وعَنْ لِبْسَتَيْنِ وعَنْ صَلَاتَيْنِ: نَهَى عَنِ الصَّلَاةِ بَعْدَ الفَجْرِ حتَّى تَطْلُعَ الشَّمْسُ، وبَعْدَ العَصْرِ حتَّى تَغْرُبَ الشَّمْسُ، وعَنِ اشْتِمَالِ الصَّمَّاءِ، وعَنِ الِاحْتِبَاءِ في ثَوْبٍ واحِدٍ، يُفْضِي بفَرْجِهِ إلى السَّمَاءِ، وعَنِ المُنَابَذَةِ، والمُلَامَسَةِ"',
            source: "صحيح البخاري 584",
          },
          {
            id: 3,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ نَهَى أَنْ يَأْكُلَ الرَّجُلُ بشِمَالِهِ، أَوْ يَمْشِيَ في نَعْلٍ وَاحِدَةٍ، وَأَنْ يَشْتَمِلَ الصَّمَّاءَ، وَأَنْ يَحْتَبِيَ في ثَوْبٍ وَاحِدٍ كَاشِفًا عن فَرْجِهِ"',
            source: "صحيح مسلم 2099",
          },
          {
            id: 4,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَمْشِ في نعْلٍ واحدٍ ، ولَا تَحْتَبِ في ثَوْبٍ واحِدٍ ، ولَا تَأْكُلْ بِشِمالِكَ ، ولَا تَشْتَمِلْ الصمَّاءَ ، ولَا تَضَعْ إحدَى رِجلَيكَ علَى الأخرَى إذا استَلْقَيْتَ"',
            source: "صحيح الجامع 7453",
          },
        ],
      },
      {
        id: 11,
        title: "إستعمال الطيب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "حُبِّبَ إلي منَ الدُّنيا ، النساءُ ، والطِّيبُ ، وجُعِلَ قرةُ عيني في الصلاةِ"',
            source: "صحيح النسائي 3949",
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها قالت: "... وكانَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ يَشْتَدُّ عليه أنْ يُوجَدَ منه الرِّيحُ..."',
          },
          {
            id: 3,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَرُدُّ الطِّيبَ"',
          },
        ],
      },
      {
        id: 12,
        title: "عدم لبس الرجال للذهب والحرير",
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
          {
            id: 2,
            title: 'عن عليِّ بنِ أبي طالبٍ رضيَ اللهُ عنهُ قال : "إنَّ نبيَّ اللهِ صلَّى اللهُ عليْهِ وسلَّمَ أخذ حريرًا فجعلَه في يمينِه ، وأخذ ذهبًا فجعلَه في شمالِه ، ثم قال: إنَّ هذيْنِ حرامٌ على ذكورِ أمتي"',
            source: "صحيح أبي داود 4057",
          },
          {
            id: 3,
            title: 'عن علي بن أبي طالب رضي الله عنه قال: "نَهَانِي رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ عَنِ التَّخَتُّمِ بالذَّهَبِ، وَعَنْ لِبَاسِ القَسِّيِّ، وَعَنِ القِرَاءَةِ في الرُّكُوعِ وَالسُّجُودِ، وَعَنْ لِبَاسِ المُعَصْفَرِ"',
            source: "صحيح مسلم 2078",
          },
        ],
      },
      {
        id: 13,
        title: "ما يجِبُ على الرجُلِ سَترُه أمام الرِّجالِ",
        ahadith: [
          {
            id: 1,
            title: "",
          },
        ],
      },
      // {
      //   id: 12,
      //   title: "",
      //   ahadith: [
      //     {
      //       id: 1,
      //       title: "",
      //     },
      //   ],
      // },
    ],
  },
  {
    id: 3,
    title: "سنن الوضوء",
    sunan: [
      {
        id: 1,
        title: "السواك",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أن رسول الله صلى الله عليه وسلم قال: "لَوْلَا أنْ أشُقَّ علَى أُمَّتي أوْ علَى النَّاسِ لَأَمَرْتُهُمْ بالسِّوَاكِ مع كُلِّ صَلَاةٍ"',
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها قالت: "...كنَّا نعدُّ لَهُ سواكَهُ وطَهورَهُ فَيبعثُهُ اللَّهُ عزَّ وجلَّ لما شاءَ أن يبعثَهُ منَ اللَّيلِ فيتسوَّكُ ويتوضَّأُ ويصلِّي..."',
          },
        ],
      },
      {
        id: 2,
        title: "التسمية",
        isFavorite: false,
        ahadith: [
          
        ],
      },
      {
        id: 3,
        title: "غسل الكفين ثلاثا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عثمانَ بنِ عفَّان رضي الله عنه: أنَّه "دعا بوَضوءٍ فتَوضَّأ، فغَسَل كفَّيه ثلاثَ مرَّات، ثم مضمَضَ واستنثَرَ...، ثمَّ قال: رأيتُ رسولَ الله صلَّى اللهُ عليه وسلَّم توضَّأَ نحو وُضوئي هذا"',
          },
        ],
      },
      {
        id: 4,
        title: "التيامن في غسل اليدين والقدمين",
        isFavorite: false,
        desc: "من السنة التيامن في غسل اليدين والقدمين في الوضوء.",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"',
          },
          {
            id: 2,
            title: 'عن أبي هُريرةَ رضي الله عنه، قال: قال رَسولُ الله صلَّى اللهُ عليه وسلَّم: "إذا لَبِستُم وإذا توضَّأتُم، فابدَؤوا بأيامِنِكم"',
          },
        ],
      },
      // {
      //   id: 5,
      //   title: "البدء بالمضمضة والاستنشاق",
      //   isFavorite: false,
      //   ahadith: [
      //     {
      //       title: "",
      //     },
      //   ],
      // },
      {
        id: 6,
        title: "المبالغة في المضمضة والاستنشاق لغير الصائم",
        desc: "من السنة المبالغة في المضمضة والاستنشاق لغير الصائم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن لقيط بن صبرة رضي الله عنه ، أن النبي صلى الله عليه وسلم قال له: "...أسبغِ الوضوءَ وخلِّل بينَ الأصابعِ وبالِغْ فى الاستنشاقِ إلَّا أن تَكونَ صائمًا"',
          },
        ],
      },
      {
        id: 7,
        title: "المضمضة والاستنشاق من كف واحدة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن زيد رضي الله عنه في صفة وضوء النبي صلى الله عليه وسلم قال: "...أدْخَلَ يَدَهُ فاسْتَخْرَجَها فَمَضْمَضَ، واسْتَنْشَقَ مِن كَفٍّ واحِدَةٍ فَفَعَلَ ذلكَ ثَلاثًا..."',
          },
        ],
      },
      {
        id: 8,
        title: "الإستنثار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عَمرو بن أبي حسَن: أنَّه "سأل عبدَ الله بنَ زيد عن وضوءِ النبيِّ صلَّى اللهُ عليه وسلَّم، فدعَا بتَورٍ من ماءٍ، فتوضَّأ لهم، فكفأَ على يديه فغسَلَهما ثلاثًا، ثم أدخَلَ يدَه في الإناءِ، فمضمَضَ واستنشَقَ، واستنثَرَ ثلاثًا بثلاثِ غرَفاتٍ من ماءٍ"',
          },
          {
            id: 2,
            title: 'عن أبي هُرَيرةَ رَضِيَ اللهُ عنه: أنَّ رسولَ الله صلَّى اللهُ عليه وسلَّم قال: "إذا توضَّأ أحدُكم، فليجعلْ في أنفِه ثمَّ لينثِرْ"',
          },
          {
            id: 3,
            title: 'عن عليٍّ رَضِيَ اللهُ عنه: "دعا بوَضوءٍ، فتمَضمَضَ واستنشَقَ، ونثَرَ بِيَدِه اليُسرى، ففعلَ هذا ثلاثًا، ثم قال: هذا طُهورُ نبيِّ اللهِ صلَّى الله عليه وسلَّم"',
          },
        ],
      },
      {
        id: 9,
        title: "في مسح الرأس تسن الصفة المسنونة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن زيد رضي الله عنه - في صفة وضوء النبي صلى الله عليه وسلم - قال: "...ثُمَّ مَسَحَ رَأْسَهُ بيَدَيْهِ، فأقْبَلَ بهِما وأَدْبَرَ، بَدَأَ بمُقَدَّمِ رَأْسِهِ حتَّى ذَهَبَ بهِما إلى قَفَاهُ، ثُمَّ رَدَّهُما إلى المَكَانِ الذي بَدَأَ منه..."',
          },
        ],
      },
      {
        id: 10,
        title: "التثليث في غسل الأعضاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حُمرانَ مولى عثمان بن عفان أنَّهُ، "رَأَى عُثْمَانَ بنَ عَفَّانَ دَعَا بإنَاءٍ، فأفْرَغَ علَى كَفَّيْهِ ثَلَاثَ مِرَارٍ، فَغَسَلَهُمَا، ثُمَّ أدْخَلَ يَمِينَهُ في الإنَاءِ، فَمَضْمَضَ، واسْتَنْشَقَ، ثُمَّ غَسَلَ وجْهَهُ ثَلَاثًا، ويَدَيْهِ إلى المِرْفَقَيْنِ ثَلَاثَ مِرَارٍ، ثُمَّ مَسَحَ برَأْسِهِ، ثُمَّ غَسَلَ رِجْلَيْهِ ثَلَاثَ مِرَارٍ إلى الكَعْبَيْنِ، ثُمَّ قالَ: قالَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ مَن تَوَضَّأَ نَحْوَ وُضُوئِي هذا، ثُمَّ صَلَّى رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِما نَفْسَهُ، غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ"',
            source: "صحيح البخاري 159",
          },
        ],
      },
      {
        id: 11,
        title: "الدعاء الوارد بعد الوضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عقبة بن عامر رضي الله عنه قال: كانَتْ عليْنا رِعايَةُ الإبِلِ فَجاءَتْ نَوْبَتي فَرَوَّحْتُها بعَشِيٍّ فأدْرَكْتُ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ قائِمًا يُحَدِّثُ النَّاسَ فأدْرَكْتُ مِن قَوْلِهِ: "ما مِن مُسْلِمٍ يَتَوَضَّأُ فيُحْسِنُ وُضُوءَهُ، ثُمَّ يَقُومُ فيُصَلِّي رَكْعَتَيْنِ، مُقْبِلٌ عليهما بقَلْبِهِ ووَجْهِهِ، إلَّا وجَبَتْ له الجَنَّةُ" قالَ: فَقُلتُ: ما أجْوَدَ هذِه! فإذا قائِلٌ بيْنَ يَدَيَّ يقولُ: الَّتي قَبْلَها أجْوَدُ، فَنَظَرْتُ فإذا عُمَرُ، قالَ: إنِّي قدْ رَأَيْتُكَ جِئْتَ آنِفًا، قالَ: "ما مِنكُم مِن أحَدٍ يَتَوَضَّأُ فيُبْلِغُ، أوْ فيُسْبِغُ، الوَضُوءَ ثُمَّ يقولُ: أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وأنَّ مُحَمَّدًا عبدُ اللهِ ورَسولُهُ؛ إلَّا فُتِحَتْ له أبْوابُ الجَنَّةِ الثَّمانِيَةُ يَدْخُلُ مِن أيِّها شاءَ." وفي رواية: فَذَكَرَ مِثْلَهُ غيرَ أنَّه قالَ: "مَن تَوَضَّأَ فقالَ أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ."',
            source: "صحيح مسلم 234",
          },
        ],
      },
      {
        id: 12,
        title: "تجديد الوضوء لكل صلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَتَوَضَّأُ عِنْدَ كُلِّ صَلَاةٍ قُلتُ: كيفَ كُنْتُمْ تَصْنَعُونَ؟ قالَ: يُجْزِئُ أحَدَنَا الوُضُوءُ ما لَمْ يُحْدِثْ"',
          },
        ],
      },    
      {
        id: 13,
        title: "التشهد بعد الوضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما مِن مُسلمٍ يتَوضَّأُ فيُحسِنُ الوضوءَ ثمَّ يقولُ أشهدُ أن لا إلهَ إلَّا اللهُ وأشهدُ أنَّ محمَّدًا عبدُه ورَسولُه إلَّا فُتِحتْ لهُ ثمانيةُ أبوابِ الجنَّةِ يدخُلُ مِن أيِّها شاءَ"',
          },
        ],
      },
      {
        id: 14,
        title: "الاقتصاد في الماء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَغْسِلُ، أوْ كانَ يَغْتَسِلُ، بالصَّاعِ إلى خَمْسَةِ أمْدَادٍ، ويَتَوَضَّأُ بالمُدِّ"',
          },
        ],
      },
      {
        id: 15,
        title: "صلاة ركعتين بعد الوضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه أنه دَعا بوَضُوءٍ فَتَوَضَّأَ فَغَسَلَ كَفَّيْهِ ثَلاثَ مَرَّاتٍ، ثُمَّ مَضْمَضَ واسْتَنْثَرَ، ثُمَّ غَسَلَ وجْهَهُ ثَلاثَ مَرَّاتٍ، ثُمَّ غَسَلَ يَدَهُ اليُمْنَى إلى المِرْفقِ ثَلاثَ مَرَّاتٍ، ثُمَّ غَسَلَ يَدَهُ اليُسْرَى مِثْلَ ذلكَ، ثُمَّ مَسَحَ رَأْسَهُ، ثُمَّ غَسَلَ رِجْلَهُ اليُمْنَى إلى الكَعْبَيْنِ ثَلاثَ مَرَّاتٍ، ثُمَّ غَسَلَ اليُسْرَى مِثْلَ ذلكَ. ثُمَّ قالَ: رَأَيْتُ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ تَوَضَّأَ نَحْوَ وُضُوئِي هذا، ثُمَّ قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: "مَن تَوَضَّأَ نَحْوَ وُضُوئِي هذا ثُمَّ قامَ فَرَكَعَ رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِما نَفْسَهُ غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ". قالَ ابنُ شِهابٍ: وكانَ عُلَماؤُنا يقولونَ: هذا الوُضُوءُ أسْبَغُ ما يَتَوَضَّأُ به أحَدٌ لِلصَّلاةِ',
          },
        ],
      },
      {
        id: 16,
        title: "غسل الرجلين إلى الكوعين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: تَخَلَّفَ عَنَّا النبيُّ صَلَّى اللهُ عليه وسلَّمَ في سَفْرَةٍ سَافَرْنَاهَا فأدْرَكَنَا - وقدْ أرْهَقَتْنَا الصَّلَاةُ - ونَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ علَى أرْجُلِنَا، فَنَادَى بأَعْلَى صَوْتِهِ: "ويْلٌ لِلْأَعْقَابِ مِنَ النَّارِ مَرَّتَيْنِ أوْ ثَلَاثًا"',
          },
        ],
      },
    ],
  },
  {
    id: 4,
    title: "سنن الأذان",
    sunan: [
      {
        id: 1,
        title: "متابعة المؤذن",
        isFavorite: false,
        desc: 'من السنة لمن سمع الأذان أن يقول مثل ما يقول المؤذن ، إلا في الحيعلتين ، فيقول "لا حول ولا قوة إلا بالله"',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
          {
            id: 2,
            title: 'عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا قالَ المُؤَذِّنُ: الله أكْبَرُ الله أكْبَرُ، فقالَ أحَدُكُمْ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، ثُمَّ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ، ثُمَّ قالَ: حَيَّ علَى الصَّلاةِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: حَيَّ علَى الفَلاحِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: الله أكْبَرُ الله أكْبَرُ، قالَ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: لا إلَهَ إلَّا الله، قالَ: لا إلَهَ إلَّا الله ، مِن قَلْبِهِ دَخَلَ الجَنَّةَ"',
            source: "صحيح مسلم 385",
          },
        ]
      },
      {
        id: 2,
        title: "الصلاة على النبي ﷺ بعد الأذان",
        desc: "من السنة الصلاة على النبي صلى الله عليه وسلم بعد الأذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
        ],
      },
      {
        id: 3,
        title: "سؤالُ الوسيلةِ والفَضيلةِ والمقامِ المحمودِ للنبيِّ صلَّى اللهُ عليه وسلَّم",
        desc: "من السنة سؤالُ الوسيلةِ والفَضيلةِ والمقامِ المحمودِ للنبيِّ صلَّى اللهُ عليه وسلَّم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قالَ حِينَ يَسْمَعُ النِّدَاءَ: "اللَّهُمَّ رَبَّ هذِه الدَّعْوَةِ التَّامَّةِ، والصَّلَاةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ والفَضِيلَةَ، وابْعَثْهُ مَقَامًا مَحْمُودًا الذي وعَدْتَهُ"، حَلَّتْ له شَفَاعَتي يَومَ القِيَامَةِ',
            source: "صحيح البخاري 614",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
        ],
      },
      {
        id: 4,
        title: "قول الذكر المخصوص بعد الشهادتين",
        desc: "من السنة قول الذكر المخصوص بعد الشهادتين.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قالَ حِينَ يَسْمَعُ المُؤَذِّنَ أشْهَدُ أنْ لا إلَهَ إلَّا الله وحْدَهُ لا شَرِيكَ له، وأنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ، رَضِيتُ بالله رَبًّا وبِمُحَمَّدٍ رَسولًا، وبالإسْلَامِ دِينًا، غُفِرَ له ذَنْبُهُ"',
            source: "صحيح مسلم 386"
          },
        ],
      },
      {
        id: 5,
        title: "الدعاء بين الأذان والإقامة",
        desc: "من السنة الدعاء بين الأذان والإقامة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: أن رجلًا قال: يا رسولَ اللهِ، إن المؤذنين يَفْضِلوننا ؟ فقال رسولُ اللهِ صلى الله عليه وسلم: "قلْ كما يقولون، فإذا انتهيتَ فسلْ تُعْطَه"',
            source: "صحيح أبي داود 524",
          },
          {
            id: 2,
            title: 'عن أنسِ بنِ مالكٍ رَضِيَ اللهُ عَنْه قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "الدُّعاءُ لا يُرَدُّ بين الأذانِ والإقامةِ؛ فادْعوا"',
            source: "",
          },
          {
            id: 3,
            title: 'عن سهلِ بنِ سعدٍ رَضِيَ اللهُ عَنْه أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "ثِنتانِ لا تُردَّانِ، أو قلَّما تُردَّانِ: الدُّعاءُ عند النِّداءِ، وعندَ البأسِ حين يُلحِمُ بعضُهم بعضًا"',
            source: "صحيح أبي داود 2540",
          },
        ],
      },
      {
        id: 6,
        title: "عدم الخروج من المسجد بعد الأذان",
        desc: "من السنة عدم الخروج من المسجد بعد الأذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُرَيرَة رَضِيَ اللهُ عَنْه قال: "أمَرَنا رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: إذا كنتُم في المسجدِ فنُودِيَ بالصَّلاةِ، فلا يَخرُجْ أحدُكم حتى يُصلِّيَ"',
            source: "",
          },
          {
            id: 2,
            title: 'عن أبي هُرَيرَةَ رَضِيَ اللهُ عَنْه قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "لا يَسمعُ النِّداءَ في مَسجِدي هذا، ثمَّ يخرجُ منهُ إلَّا لحاجةٍ، ثمَّ لا يرجِعُ إليه إلَّا منافقٌ"',
            source: "",
          },
          {
            id: 3,
            title: 'عنِ أبي الشَّعثاءِ، قال: كنَّا قعودًا في المسجدِ مع أبي هُرَيرةَ، فأذَّنَ المُؤذِّنُ، فقام رجلٌ من المسجد يَمشي، فأتْبعَه أبو هريرةَ بصرَه حتى خرَجَ من المسجدِ، فقال أبو هريرةَ: "أمَّا هذا فقد عصَى أبا القاسمِ صلَّى اللهُ عليه وسلَّم"',
            source: "",
          },
        ],
      },
    ],
  },
  {
    id: 5,
    title: "سنن النوم",
    sunan: [
      {
        id: 1,
        title: "النوم على وضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن جبل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما من مسلمٍ يَبِيتُ على ذِكْرٍ طاهرًا فيَتعارَّ من الليلِ فيسألُ اللهَ خيرًا من الدنيا والآخرةِ إلا أعطاه إياه"',
          },
          {
            id: 2,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا أتَيْتَ مَضْجَعَكَ، فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ علَى شِقِّكَ الأيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أسْلَمْتُ وجْهِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَأَ ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ، فإنْ مُتَّ مِن لَيْلَتِكَ، فأنْتَ علَى الفِطْرَةِ، واجْعَلْهُنَّ آخِرَ ما تَتَكَلَّمُ بهِ." قالَ: فَرَدَّدْتُهَا علَى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، قُلتُ: ورَسولِكَ، قالَ: "لَا، ونَبِيِّكَ الذي أرْسَلْتَ"',
          },
        ],
      },
      {
        id: 2,
        title: "قراءة سورة الإخلاص والمعوذتين قبل النوم مع النفث في الكفين ومسح ما تقدم من جسده ثلاثا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم كانَ إذا أوَى إلى فِراشِهِ كُلَّ لَيْلَةٍ جَمَع كَفَّيْهِ، ثُمَّ نَفَثَ فِيهِما، فَقَرَأَ فِيهِما: {قُلْ هُوَ اللَّهُ أَحَدٌ}، و{قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ}، و{قُلْ أَعُوذُ بِرَبِّ النَّاسِ}، ثُمَّ يَمْسَحُ بهِما ما اسْتَطاعَ مِن جَسَدِهِ، يَبْدَأُ بهِما علَى رَأْسِهِ ووَجْهِهِ وما أقْبَلَ مِن جَسَدِهِ، يَفْعَلُ ذلكَ ثَلاثَ مَرَّاتٍ"',
          },
        ],
      },
      {
        id: 3,
        title: "قراءة الآيتين الأخيرتين من سورة البقرة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مسعود عقبة بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الآيَتانِ مِن آخِرِ سُورَةِ البَقَرَةِ، مَن قَرَأَهُما في لَيْلَةٍ كَفَتاهُ"',
          },
        ],
      },
      {
        id: 4,
        title: "قراءة سورة الكافرون",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن فروة بن نوفل رضي الله عنه أنَّهُ أتَى النَّبيَّ صلَّى الله علَيهِ وسلَّمَ فقالَ : يا رسولَ الله علِّمني شيئًا أقولُهُ إذا أوَيتُ إلى فِراشي ، فقالَ: "اقرأ: قُلْ يَا أَيُّهَا الْكَافِرُونَ فإنَّها براءةٌ منَ الشِّركِ"',
          },
        ],
      },
      {
        id: 5,
        title: "وضع اليد اليمنى تحت الخد الأيمن مع الدعاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حفصة أم المؤمنين رضي الله عنها قالت: "أن رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، كان إذا أراد أن يَرْقُدَ وضع يدَه اليمنى تحتَ خَدِّهِ ثم يقول : اللهم قِنِي عذابَك يوم تبعثُ عبادَك - ثلاثَ مِرارٍ"',
          },
        ],
      },
      {
        id: 6,
        title: "دعاء قبل النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: كانَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أرَادَ أنْ يَنَامَ قالَ: "باسْمِكَ اللَّهُمَّ أمُوتُ وأَحْيَا"، وإذَا اسْتَيْقَظَ مِن مَنَامِهِ قالَ: "الحَمْدُ لله الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ"',
          },
        ],
      },
      {
        id: 7,
        title: "السواك عند الإستيقاظ في الليل",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا قَامَ مِنَ اللَّيْلِ، يَشُوصُ فَاهُ بالسِّوَاكِ"',
          },
        ],
      },
      {
        id: 8,
        title: "مسح أثر النوم من العينين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن العباس رضي الله عنه قال: "أنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ وهي خَالَتُهُ فَاضْطَجَعْتُ في عَرْضِ الوِسَادَةِ واضْطَجَعَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ وأَهْلُهُ في طُولِهَا، فَنَامَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، حتَّى إذَا انْتَصَفَ اللَّيْلُ، أوْ قَبْلَهُ بقَلِيلٍ أوْ بَعْدَهُ بقَلِيلٍ، اسْتَيْقَظَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، فَجَلَسَ يَمْسَحُ النَّوْمَ عن وجْهِهِ بيَدِهِ، ثُمَّ قَرَأَ العَشْرَ الآيَاتِ الخَوَاتِمَ مِن سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إلى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ منها فأحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي. قَالَ ابنُ عَبَّاسٍ: فَقُمْتُ فَصَنَعْتُ مِثْلَ ما صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إلى جَنْبِهِ، فَوَضَعَ يَدَهُ اليُمْنَى علَى رَأْسِي، وأَخَذَ بأُذُنِي اليُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أوْتَرَ، ثُمَّ اضْطَجَعَ حتَّى أتَاهُ المُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ"',
          },
        ],
      },
      {
        id: 9,
        title: "دعاء الإستيقاظ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: كانَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أرَادَ أنْ يَنَامَ قالَ: "باسْمِكَ اللَّهُمَّ أمُوتُ وأَحْيَا"، وإذَا اسْتَيْقَظَ مِن مَنَامِهِ قالَ: "الحَمْدُ لله الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ"',
          },
        ],
      },
      {
        id: 10,
        title: "الدعاء حين الإستيقاظ أثناء النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبادة بن الصامت رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من تعارَّ مِنَ اللَّيلِ فقال حينَ يَستيقِظُ: لا إلهَ إلَّا اللهُ وَحْدَه لا شريكَ له، له المُلْكُ وله الحمدُ وهو على كلِّ شَيءٍ قديرٌ، سبحان الله، والحمدُ لله، ولا إلهَ إلَّا اللهُ، والله أكبَرُ، ولا حولَ ولا قوَّةَ إلا بالله، ثمَّ دعا: ربِّ اغفِرْ لي؛ استُجيبَ له، فإن قام فتوضأ ثمَّ صلَّى قُبِلَت صلاتُه"',
          },
        ],
      },
      {
        id: 11,
        title: "التكبير 34 والتسبيح 33 والتحميد 33 عند المنام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن علي بن أبي طالب رضي الله عنه قال: "أنَّ فَاطِمَةَ عَلَيْهَا السَّلَامُ شَكَتْ ما تَلْقَى مِن أثَرِ الرَّحَا، فأتَى النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ سَبْيٌ، فَانْطَلَقَتْ فَلَمْ تَجِدْهُ، فَوَجَدَتْ عَائِشَةَ فأخْبَرَتْهَا، فَلَمَّا جَاءَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ أخْبَرَتْهُ عَائِشَةُ بمَجِيءِ فَاطِمَةَ، فَجَاءَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إلَيْنَا وقدْ أخَذْنَا مَضَاجِعَنَا، فَذَهَبْتُ لِأقُومَ، فَقَالَ: علَى مَكَانِكُمَا. فَقَعَدَ بيْنَنَا حتَّى وجَدْتُ بَرْدَ قَدَمَيْهِ علَى صَدْرِي، وقَالَ: ألَا أُعَلِّمُكُما خَيْرًا ممَّا سَأَلْتُمَانِي؟ إذَا أخَذْتُما مَضَاجِعَكُما تُكَبِّرَا أرْبَعًا وثَلَاثِينَ، وتُسَبِّحَا ثَلَاثًا وثَلَاثِينَ، وتَحْمَدَا ثَلَاثًا وثَلَاثِينَ؛ فَهو خَيْرٌ لَكُما مِن خَادِمٍ"',
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمرو رضي الله عنهما  قال: قال رسول الله صلى الله عليه وسلم: "خصلتان، أو خلتان لا يحافظُ عليهما عبدٌ مسلمٌ إلا دخل الجنةَ، هما يسيرٌ، ومن يعملُ بهما قليلٌ، يسبِّحً في دُبُرِ كلِّ صلاةٍ عشْرًا، ويحمَدَ عشْرًا ، ويكبِّرُ عشْرًا، فذلك خمسون ومائةٌ باللسانِ، وألفٌ وخمسمائةٍ في الميزانِ، ويكبِّرُ أربعًا وثلاثين إذا أخذ مضجعَه ، ويحمَدُ ثلاثًا وثلاثين ، ويسبِّحُ ثلاثًا وثلاثين ، فذلك مائةٌ باللسانِ ، وألفٌ في الميزانِ." فلقد رأيتُ رسولُ اللهِ صلى الله عليه وسلم يعقِدُها بيدِه ، قالوا: يا رسولَ اللهِ ، كيف هما يسيرٌ ومن يعملُ بهما قليلٌ؟ قال: "يأتي أحدَكم – يعني الشيطانَ – في منامِه فيُنَوِّمُه قبل أن يقولَه ، ويأتيه في صلاتِه فيُذَكِّرَه حاجةً قبلَ أن يقولَها"',
          },
        ],
      },
      {
        id: 12,
        title: "النوم على الشق الأيمن",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا أتَيْتَ مَضْجَعَكَ، فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ علَى شِقِّكَ الأيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أسْلَمْتُ وجْهِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَأَ ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ، فإنْ مُتَّ مِن لَيْلَتِكَ، فأنْتَ علَى الفِطْرَةِ، واجْعَلْهُنَّ آخِرَ ما تَتَكَلَّمُ بهِ." قالَ: فَرَدَّدْتُهَا علَى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، قُلتُ: ورَسولِكَ، قالَ: "لَا، ونَبِيِّكَ الذي أرْسَلْتَ"',
          },
        ],
      },
      {
        id: 13,
        title: "نفض الفراش",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أوَى أحَدُكُمْ إلى فِراشِهِ، فَلْيَنْفُضْ فِراشَهُ بداخِلَةِ إزارِهِ؛ فإنَّه لا يَدْرِي ما خَلَفَهُ عليه، ثُمَّ يقولُ: باسْمِكَ رَبِّ، وضَعْتُ جَنْبِي، وبِكَ أرْفَعُهُ، إنْ أمْسَكْتَ نَفْسِي فارْحَمْها، وإنْ أرْسَلْتَها فاحْفَظْها بما تَحْفَظُ به عِبادَكَ الصَّالِحِينَ"',
          },
        ],
      },
      {
        id: 14,
        title: "قراءة سورة السجدة وسورة الملك قبل النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "كَانَ لا يَنامُ حتى يقرأَ {الم تَنْزِيلُ} السَّجْدَةُ ، و {تَبارَكَ الذي بيدِهِ الملكُ}"',
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: "سورةُ تبارك هي المانعةُ من عذابِ القبرِ"',
          },
        ],
      },
      {
        id: 15,
        title: "السواك عند القيام من النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا قَامَ مِنَ اللَّيْلِ، يَشُوصُ فَاهُ بالسِّوَاكِ"',
          },
        ],
      },
      {
        id: 16,
        title: "عدم النوم على البطن",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "رأى رسولُ الله صلَّى اللههُ عليهِ وسلَّمَ رجلًا مُضطجِعًا علَى بطنِهِ فقالَ إنَّ هذهِ ضِجعةٌ لا يحبُّها الله"',
          },
        ],
      },
    ],
  },
  {
    id: 6,
    title: "سنن الطعام",
    sunan: [
      {
        id: 1,
        title: "التسمية قبل الأكل",
        isFavorite: false,
        desc: "من السنة تسمية الله قبل الأكل",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها ، أن رسول الله صلى الله عليه وسلم قال: "إذا أكَل أحَدُكم فَلْيذكُرِ اسمَ اللهِ تعالى، فإن نسِي أن يذكُرَ اسمَ اللهِ تعالى في أوَّلِهِ، فليقُلْ: بسمِ اللهِ أوَّلَهُ وآخِرَهُ"',
          },
        ]
      },
      {
        id: 2,
        title: "الأكل باليمين",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
          },
        ],
      },
      {
        id: 3,
        title: "الأكل مما يلي",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
          },
        ],
      },
      {
        id: 4,
        title: "أخذ اللقمة الساقطة، وإماطة ما بها من أذى، وأكلها",
        isFavorite: false,
        desc: "من السنة أخذ اللقمة الساقطة وإماطة ما بها من أذى وأكلها",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
          },
        ]
      },
      {
        id: 5,
        title: "لعق الأصابع",
        isFavorite: false,
        desc: "من السنة لعق الأصابع أو إلعاقها",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال: "إذا أكَلَ أحَدُكُمْ فلا يَمْسَحْ يَدَهُ حتَّى يَلْعَقَها أوْ يُلْعِقَها"',
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
          },
          {
            id: 3,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',         
          },
        ]
      },
      {
        id: 6,
        title: "سلت القصعة",
        isFavorite: false,
      },
      {
        id: 7,
        title: "الأكل بثلاث أصابع",
        isFavorite: false,
        desc: "من السنة الأكل بثلاث أصابع",
        ahadith: [
          {
            id: 1,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',         
          },
        ]
      },
      {
        id: 8,
        title: "حمد الله تعالى بعد الطعام",
        isFavorite: false,
        desc: "من السنة حمد الله تعالى بعد الطعام",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ لَيَرْضَى عَنِ العَبْدِ أَنْ يَأْكُلَ الأكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا"',
          },
        ],
      },
      {
        id: 9,
        title: "الإجتماع على الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: "طَعامُ الرَّجُلِ يَكْفِي رَجُلَيْنِ، وطَعامُ رَجُلَيْنِ يَكْفِي أرْبَعَةً، وطَعامُ أرْبَعَةٍ يَكْفِي ثَمانِيَةً"',
          },
        ]
      },
      {
        id: 10,
        title: "مدح الطعام إذا أعجبه",
        isFavorite: false,
        ahadith: [
        
        ],
      },
      {
        id: 11,
        title: "الدعاء لصاحب الطعام",
        isFavorite: false,
         ahadith: [

        ],
      },
      {
        id: 12,
        title: "تغطية الإناء وذكر اسم الله تعالى عند قدوم الليل",
        isFavorite: false,
         ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
      {
        id: 13,
        title: "عدم عيب الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "ما عَابَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ طَعَامًا قَطُّ؛ إنِ اشْتَهَاهُ أكَلَهُ، وإلَّا تَرَكَهُ"',
          },
        ],
      },
      {
        id: 14,
        title: "تبادل الطعام بين الجيران",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يا أبا ذَرٍّ إذا طَبَخْتَ مَرَقَةً، فأكْثِرْ ماءَها، وتَعاهَدْ جِيرانَكَ"',
          },
        ],
      },
    ],
  },
  {
    id: 7,
    title: "سنن الشراب والشرب",
    sunan: [
      {
        id: 1,
        title: "التسمية قبل الأكل والشرب",
        isFavorite: false,
        desc: "من السنة تسمية الله قبل الأكل والشرب",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها ، أن رسول الله صلى الله عليه وسلم قال: "إذا أكَل أحَدُكم فَلْيذكُرِ اسمَ اللهِ تعالى، فإن نسِي أن يذكُرَ اسمَ اللهِ تعالى في أوَّلِهِ، فليقُلْ: بسمِ اللهِ أوَّلَهُ وآخِرَهُ"',
            source: "",
          },
        ]
      },
      {
        id: 2,
        title: "الشرب جالسا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَشْرَبَنَّ أحَدٌ مِنكُم قائِمًا، فمَن نَسِيَ فَلْيَسْتَقِئْ"',
            source: "صحيح مسلم 2026",
          },
        ],
      },
      {
        id: 3,
        title: "الشرب باليمين",
        isFavorite: false,
        desc: "من السنة الشرب باليمين",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
        ],
      },
      {
        id: 4,
        title: "شرب الماء في ثلاثة أنفاس",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: كان النبي صلى الله عليه وسلم يتنفسُ في الشرابِ ثلاثا ويقول : "هو أَهنَأ ، وأبرَأ ، وأشفَى" . قال أنس : وأنا أتنفسُ في الشرابِ ثلاثا',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: "أن رسول الله صلى الله عليه وسلم كان يشربُ في ثلاثةِ أنفاسٍ ، إذا أدْنى الإناءَ إلى فيهِ سمّى اللهَ تعالى ، وإذا أخرّهُ حمدَ الله تعالى ، يفعلُ ذلكَ ثلاثَ مراتٍ"',
          },
        ],
      },
      {
        id: 5,
        title: "حمد الله تعالى بعد الأكل والشرب",
        isFavorite: false,
        desc: "من السنة حمد الله تعالى بعد الأكل والشرب",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ لَيَرْضَى عَنِ العَبْدِ أَنْ يَأْكُلَ الأكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا"',
          },
        ],
      },
      {
        id: 6,
        title: "إستحباب أن يسقي الشارب من على يمينه قبل يساره",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أَتَانَا رَسولُ الله صلَّى اللهُ عليه وسلَّمَ في دَارِنَا هذِه فَاسْتَسْقَى، فَحَلَبْنَا له شَاةً لَنَا، ثُمَّ شُبْتُهُ مِن مَاءِ بئْرِنَا هذِه، فأعْطَيْتُهُ، وأَبُو بَكْرٍ عن يَسَارِهِ، وعُمَرُ تُجَاهَهُ، وأَعْرَابِيٌّ عن يَمِينِهِ، فَلَمَّا فَرَغَ قَالَ عُمَرُ: هذا أبو بَكْرٍ، فأعْطَى الأعْرَابِيَّ فَضْلَهُ، ثُمَّ قَالَ: الأيْمَنُونَ الأيْمَنُونَ، ألَا فَيَمِّنُوا. قَالَ أنَسٌ: فَهي سُنَّةٌ، فَهي سُنَّةٌ. ثَلَاثَ مَرَّاتٍ"',
            source: "صحيح البخاري 2571",
          },
        ],
      },
      {
        id: 7,
        title: "ساقي القوم آخرهم شربا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة رضي الله عنه قال: قال رسول االه صلى الله عليه وسلم: "ساقي القومِ آخرُهم شربًا"',
            source: "صحيح الترمذي 1894",
          },
        ],
      },
      {
        id: 8,
        title: "عدم الشرب من مكان الكسر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نهى رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّمَ ، عَنِ الشُّرْبِ من ثُلْمَةِ القَدَحِ ، وأنْ يُنْفَخَ في الشَّرَابِ"',
          },
        ],
      },
      {
        id: 9,
        title: "عدم النفخ في الشراب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نهى رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّمَ ، عَنِ الشُّرْبِ من ثُلْمَةِ القَدَحِ ، وأنْ يُنْفَخَ في الشَّرَابِ"',
          },
        ],
      },
      {
        id: 10,
        title: "الشرب والاستشفاء من ماء زمزم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال رسول الله صلى الله عليه وسلم: "خَيرُ ماءٍ على وجْهِ الأرضِ ماءُ زَمْزَمَ ، فِيه طعامٌ من الطُّعْمِ ، و شِفاءٌ من السُّقْمِ ، و شَرُّ ماءٍ على وجهِ الأرضِ ماءُ بِوَادِي بَرَهُوتَ بِقُبَّةٍ بِحَضْرَمَوْتَ كَرِجْلِ الجَرادِ من الهَوامِّ ، تُصبِحُ تَتَدَفَّقُ و تُمسِي لا بِلالَ لَهَا"',
          },
        ],
      },
      {
        id: 11,
        title: "المضمضة بعد شرب اللبن",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: "أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم شَرِبَ لَبَنًا فَمَضْمَضَ، وقالَ: إنَّ له دَسَمًا."',
          },
        ],
      },
    ],
  },
  {
    id: 8,
    title: "سنن التثاؤب",
    sunan: [
      {
        id: 1,
        title: "كظم الفم عند التثاؤب أو رده باليد",
        desc: "من السنة كظم الفم عند التثاؤب أو رده باليد.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
            source: "صحيح البخاري 6223",
          },
          {
            id: 2,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا تَثاءَبَ أحَدُكُمْ، فَلْيُمْسِكْ بيَدِهِ علَى فِيهِ، فإنَّ الشَّيْطانَ يَدْخُلُ"',
            source: "صحيح مسلم 2995",
          },
        ]
      },
      {
        id: 2,
        title: "عدم رفع الصوت في التثائب",
        desc: "من السنة عدم رفع الصوت في التثاؤب.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
            source: "صحيح البخاري 6223",
          },
        ],
      },
    ],
  },
  {
    id: 9,
    title: "سنن العطاس",
    sunan: [
      {
        id: 1,
        title: 'يسن للعاطس أن يقول: "الحمد لله"',
        isFavorite: false,
        desc: "من السنة أن يقول العاطس الحمد لله.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا عَطَسَ أحَدُكُمْ فَلْيَقُلِ: الحَمْدُ لِلَّهِ، ولْيَقُلْ له أخُوهُ -أوْ صاحِبُهُ-: يَرْحَمُكَ اللَّهُ، فإذا قالَ له: يَرْحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ ويُصْلِحُ بالَكُمْ"',
            source: "صحيح البخاري 6224",
          },
        ]
      },
      {
        id: 2,
        title: "لا يشمت العاطس إذا لم يحمد الله تعالى",
        isFavorite: false,
        desc: "من السنة عدم تشميت العاطس إذا لم يقل الحمد لله",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "عطَس رجلانِ عند النَّبيِّ صلَّى اللهُ عليه وسلَّم، فشَمَّت أحدَهما وتَرك الآخَرَ، قال: فقيل: يا رسولَ اللهِ، رجلان عَطَسا فشَمَّتَّ أحدَهما وتركتَ الآخَرَ؟ فقال: إنَّ هذا حَمِدَ الله، وإنَّ هذا لم يحمَدِ اللهَ"',
            source: "صحيح البخاري 6221",
          },
          {
            id: 2,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "إذا عطَسَ أحدُكُم فحمِدَ اللهَ فشمِّتُوهُ ، وإذا لَم يحمَدِ اللهَ فلا تُشمِّتُوهُ"',
            source: "صحيح الجامع 683",
          },
        ]
      },
      {
        id: 3,
        title: "لا يشمت العاطس إذا زاد على ثلاث مرات لأنه مزكوم",
        isFavorite: false,
        desc: "من السنة عدم تشميت العاطس إذا زاد على ثلاث مرات لأنه مزكوم  ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "شَمِّتْ أخاك ثلاثًا ، فما زاد فهو زُكامٌ"',
            source: "صحيح أبي داود 5034",
          },
          {
            id: 2,
            title: 'عن سلمة بن الأكوع رضي الله عنه أنَّهُ سَمِعَ النَّبيَّ صَلَّى الله عليه وسلَّمَ وَعَطَسَ رَجُلٌ عِنْدَهُ، فَقالَ له: "يَرْحَمُكَ الله"، ثُمَّ عَطَسَ أُخْرَى، فَقالَ له رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "الرَّجُلُ مَزْكُومٌ"',
            source: "صحيح مسلم 2993",
          },
        ]
      },
    ],
  },
  {
    id: 10,
    title: "سنن السلام واللقاء والمجالسة",
    sunan: [
      {
        id: 1,
        title: "إلقاء السلام",
        isFavorite: false,
      },
      {
        id: 2,
        title: "تكرار السلام ثلاثا، إن دعت الحاجة لذلك",
        isFavorite: false,
      },
      {
        id: 3,
        title: "تعميم السلام على من تعرف وعلى من لا تعرف",
        isFavorite: false,
      },
      {
        id: 4,
        title: "إبتداء السلام ممن جاءت السنة بابتدائه",
        isFavorite: false,
      },
      {
        id: 5,
        title: "السلام على الصبيان",
        isFavorite: false,
      },
      {
        id: 6,
        title: "السلام عند دخول البيت",
        isFavorite: false,
      },
      {
        id: 7,
        title: "خفض الصوت بالسلام عند الدخول إلى قوم وفيهم نائمون",
        isFavorite: false,
      },
      {
        id: 8,
        title: "تبليغ السلام",
        isFavorite: false,
      },
      {
        id: 9,
        title: "السلام عند دخول المجلس وعند مفارقته",
        isFavorite: false,
      },
      {
        id: 10,
        title: "المصافحة مع السلام عند اللقيا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما من مسلمين يلتقيان فيتصافحان إلا غُفِرَ لهما قبلَ أن يفترقا"',
          },
        ],
      },
      {
        id: 11,
        title: "التبسم وطلاقة الوجه عند اللقاء",
        isFavorite: false,
      },
      {
        id: 12,
        title: "الكلمة الطيبة فهي صدقة",
        isFavorite: false,
      },
      {
        id: 13,
        title: "ذكر الله تعالى في المجلس",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما جَلَس قومٌ مجلسًا لم يذكروا اللهَ فيه ولم يُصلُّوا على نبيِّهم إلَّا كان عليهم تِرةٌ فإن شاءَ عذَّبَهم وإن شاءَ غفَر لهم"',
          },
        ],
      },
      {
        id: 14,
        title: "ختم المجلس بكفارة المجلس",
        isFavorite: false,
      },
      {
        id: 15,
        title: "عدم نزع اليد عند المصافحة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "ما رأيتُ رجلًا التَقَمَ أُذُنَ رسولِ اللهِ صلى الله عليه وسلم ، فيُنَحِّي رأسَه ، حتى يكونَ الرجلُ هو الذي يُنَحِّي رأسَه ، وما رأيتُ رجلًا أخَذَ بيدِه فتَرَكَ يدَه ، حتى يكونَ الرجلُ هو الذي يَدَعُ يدَه"',
          },
        ],
      },
      {
        id: 16,
        title: "رد السلام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
          },
        ],
      },
      {
        id: 17,
        title: "عدم مصافحة الرجال للنساء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أميمة بنت رقيقة رضي الله عنها قالت: أتيتُ النبيَّ صلى الله عليه وسلم في نسوةٍ مِن الأنصارِ نبايعُه ، فقلنا : يا رسولَ اللهِ ، نبايعُك على أن لا نشركَ باللهِ شيئًا ، ولا نسرقَ ، ولا نزنيَ ، ولا نأتيَ ببهتانٍ نفتريه بين أيدينا ، وأرجلِنا ، ولا نعصيَك في معروفٍ . قال : "فيما استطعتُنَّ وأطقْتُنَّ." قالت : قلنا : اللهُ ورسولُه أرحمُ بنا . هلمَّ نبايعْك يا رسولَ اللهِ ، فقال رسولُ اللهِ -صلى الله عليه وسلم- : "إني لا أصافحُ النساءَ! إنما قولي لمائةِ امرأةٍ ، كقولي لامرأةٍ واحدةٍ _ أو مثل قولي _ لامرأةٍ واحدةٍ."',
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كَانَتِ المُؤْمِنَاتُ إذَا هَاجَرْنَ إلى رَسولِ اللهِ صَلَّى الله عليه وَسَلَّمَ يُمْتَحَنَّ بقَوْلِ اللهِ عَزَّ وَجَلَّ: {يَا أَيُّهَا النبيُّ إذَا جَاءَكَ المُؤْمِنَاتُ يُبَايِعْنَكَ علَى أَنْ لا يُشْرِكْنَ باللَّهِ شيئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ} [الممتحنة: 12] إلى آخِرِ الآيَةِ. قالَتْ عَائِشَةُ: فمَن أَقَرَّ بهذا مِنَ المُؤْمِنَاتِ، فقَدْ أَقَرَّ بالمِحْنَةِ. وَكانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ إذَا أَقْرَرْنَ بذلكَ مِن قَوْلِهِنَّ، قالَ لهنَّ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ: انْطَلِقْنَ، فقَدْ بَايَعْتُكُنَّ وَلَا والله ما مَسَّتْ يَدُ رَسولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ يَدَ امْرَأَةٍ قَطُّ، غيرَ أنَّهُ يُبَايِعُهُنَّ بالكَلَامِ. قالَتْ عَائِشَةُ: وَاللَّهِ، ما أَخَذَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ علَى النِّسَاءِ قَطُّ إلَّا بما أَمَرَهُ اللَّهُ تَعَالَى، وَما مَسَّتْ كَفُّ رَسولِ اللهِ صَلَّى الله عليه وَسَلَّمَ كَفَّ امْرَأَةٍ قَطُّ، وَكانَ يقولُ لهنَّ إذَا أَخَذَ عليهنَّ: قدْ بَايَعْتُكُنَّ كَلَامًا"',
          },
        ],
      },
    ],
  },
  {
    id: 11,
    title: "سنن الذهاب إلى المسجد",
    sunan: [
      {
        id: 1,
        title: "التبكير بالذهاب إلى المسجد",
        desc: "من السنة التبكير إلى المسجد.",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
          },
        ]
      },
      {
        id: 2,
        title: "أن يخرج من بيته متطهرا لتكتب خطاه",
        desc: "من السنة أن يخرج من بيته متطهرا لتكتب خطاه.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صَلَاةُ الرَّجُلِ في جَمَاعَةٍ تَزِيدُ علَى صَلَاتِهِ في بَيْتِهِ، وَصَلَاتِهِ في سُوقِهِ، بضْعًا وَعِشْرِينَ دَرَجَةً، وَذلكَ أنَّ أَحَدَهُمْ إذَا تَوَضَّأَ فأحْسَنَ الوُضُوءَ، ثُمَّ أَتَى المَسْجِدَ لا يَنْهَزُهُ إلَّا الصَّلَاةُ، لا يُرِيدُ إلَّا الصَّلَاةَ، فَلَمْ يَخْطُ خَطْوَةً إلَّا رُفِعَ له بهَا دَرَجَةٌ، وَحُطَّ عنْه بهَا خَطِيئَةٌ، حتَّى يَدْخُلَ المَسْجِدَ، فَإِذَا دَخَلَ المَسْجِدَ كانَ في الصَّلَاةِ ما كَانَتِ الصَّلَاةُ هي تَحْبِسُهُ، وَالْمَلَائِكَةُ يُصَلُّونَ علَى أَحَدِكُمْ ما دَامَ في مَجْلِسِهِ الذي صَلَّى فيه يقولونَ: اللَّهُمَّ ارْحَمْهُ، اللَّهُمَّ اغْفِرْ له، اللَّهُمَّ تُبْ عليه، ما لَمْ يُؤْذِ فِيهِ، ما لَمْ يُحْدِثْ فِيهِ"',
          },
        ]
      },
      {
        id: 3,
        title: "أن يخرج للصلاة بسكينة ووقار",
        desc: "من السنة أن يخرج للصلاة بسكينة ووقار.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه: عن النبي صلى الله عليه وسلم قال: "إذا سمعتُم الإقامةَ فامشُوا إلى الصلاةِ وعليكم السَّكينةَ والوقارَ ولا تُسرِعوا ، فما أدركتُم فصلُّوا ، وما فاتَكم فأتِمُّوا"',
          },
        ],
      },
      {
        id: 4,
        title: "تقديم الرجل اليمنى عند الدخول إلى المسجد وتقديم اليسرى عند الخروج منه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: "",
          },
        ],
      },
      {
        id: 5,
        title: "قول الذكر عند دخول المسجد وعند الخروج منه",
        desc: "من السنة قول الذكر الوارد عند دخول المسجد وعند الخروج منه.",
        isFavorite: false,
        ahadith: [
          { 
            id: 1,
            title: 'عن أبي حميد أو أبي أسيد الساعدي رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا دَخَلَ أحَدُكُمُ المَسْجِدَ، فَلْيَقُلِ: اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِكَ، وإذا خَرَجَ، فَلْيَقُلِ: اللَّهُمَّ إنِّي أسْأَلُكَ مِن فَضْلِكَ"',
          },
        ],
      },
      {
        id: 6,
        title: "صلاة ركعتين تحية للمسجد",
        desc: "من السنة صلاة ركعتين تحية للمسجد.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال النبي صلى الله عليه وسلم: "إذا دخَل أحدُكم المسجدَ فلا يَجلِسْ حتى يصلِّيَ ركعتَين"',
          },
        ],
      },
      {
        id: 7,
        title: "مبادرة الرجال إلى الصف الأول",
        desc: "من السنة مبادرة الرجال إلى الصف الأول.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خَيْرُ صُفُوفِ الرِّجالِ أوَّلُها، وشَرُّها آخِرُها، وخَيْرُ صُفُوفِ النِّساءِ آخِرُها، وشَرُّها أوَّلُها"',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
          },
        ],
      },
      {
        id: 8,
        title: "أن يكون المأموم قريبا من إمامه",
        isFavorite: false,
        desc: "من السنة أن يكون المأموم قريبا من إمامه.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليلينِّي منكم أولو الأحلامِ والنُّهى ثمَّ الَّذينَ يلونَهُم ثمَّ الَّذينَ يلونَهُم ولا تختلِفوا فتختلفَ قلوبُكُم وإيَّاكم وَهَيشاتِ الأسواقِ"',
          },
        ],
      },
      {
        id: 9,
        title: "الذهاب إلى المسجد ماشيا",
        desc: "من السنة الذهاب إلى المسجد ماشيا.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَلا أدُلُّكُمْ علَى ما يَمْحُو الله به الخَطايا، ويَرْفَعُ به الدَّرَجاتِ؟" قالُوا بَلَى يا رَسولَ اللهِ، قالَ: "إسْباغُ الوُضُوءِ علَى المَكارِهِ، وكَثْرَةُ الخُطا إلى المَساجِدِ، وانْتِظارُ الصَّلاةِ بَعْدَ الصَّلاةِ، فَذَلِكُمُ الرِّباطُ." وليسَ في حَديثِ شُعْبَةَ ذِكْرُ الرِّباطِ. وفي حَديثِ مالِكٍ ثِنْتَيْنِ "فَذَلِكُمُ الرِّباطُ، فَذَلِكُمُ الرِّباطُ"',
          },
        ],
      },
      {
        id: 4,
        title: "تسوية الصفوف",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أقيموا الصُّفوفَ وحاذُوا بينَ المناكبِ وسُدُّوا الخللَ ولينوا بأيدي إخوانِكم ولا تذَروا فرُجاتٍ للشَّيطانِ ومَن وصَلَ صفًّا وصَلَه الله ومن قطعَ صفًّا قطعَه الله"',
          },
        ],
      },
    ],
  },
  {
    id: 12,
    title: "سنن الصيام",
    sunan: [
      {
        id: 1,
        title: "إجتناب المحرمات",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُرَيرةَ رَضِيَ اللهُ عنه أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: "مَن لم يَدَعْ قَولَ الزُّورِ والعَمَلَ به، والجَهْلَ؛ فليس للهِ حاجةٌ أن يدَعَ طعامَه وشَرابَه"',
          },
        ],
      },
      {
        id: 2,
        title: "إجتناب الرفث والصخب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُريرةَ رَضِيَ اللهُ عنه، أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: "وإذا كان يومُ صَومِ أحَدِكم فلا يَرْفُثْ، ولا يصخَبْ فإن سابَّه أحدٌ، أو قاتَلَه، فليقُلْ: إنِّي امْرؤٌ صائِمٌ"',
          },
        ],
      },
      {
        id: 3,
        title: "دعاء الإفطار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن ابنِ عُمَرَ رَضِيَ اللهُ عنهما، قال: كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إذا أفطَرَ قال: "ذهَبَ الظَّمأُ وابتلَّتِ العُروقُ وثَبَتَ الأجرُ إن شاءَ اللهُ"',
          },
        ],
      },
      {
        id: 4,
        title: "تعجيل الفطور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'وعن أبي هُريرةَ رَضِيَ اللهُ عنه أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: "لا يزالُ الدِّينُ ظاهرًا ما عَجَّلَ النَّاسُ الفِطرَ؛ لأنَّ اليَهودَ والنَّصارى يُؤَخِّرونَ"',
          },
          {
            id: 2,
            title: 'عن سَهلِ بنِ سَعدٍ رَضِيَ اللهُ عنه أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "لا يزالُ النَّاسُ بخيرٍ ما عَجَّلوا الفِطرَ"',
          },
        ],
      },
      {
        id: 5,
        title: "السحور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنسِ بنِ مالكٍ رَضِيَ اللهُ عنه قال: قال النبيُّ صلَّى اللهُ عليه وسلَّم: "تسَحَّرُوا؛ فإنَّ في السَّحورِ بَرَكةً"',
          },
        ],
      },
      {
        id: 6,
        title: "السحور بالتمر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نِعمَ سحورُ المؤمنِ التَّمرُ"',
          },
        ],
      },
      {
        id: 7,
        title: "تأخير السحور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنسٍ رَضِيَ اللهُ عنه أنَّ زَيدَ بنَ ثابتٍ رَضِيَ اللهُ عنه حدَّثَه "أنَّهم تسَحَّروا مع النبيِّ صلَّى اللهُ عليه وسلَّم ثمَّ قاموا إلى الصَّلاةِ، قلتُ- أي أنَس-: كم بينهما؟ قال: قَدْرُ خَمسينَ آيةً"',
          },
        ],
      },
      {
        id: 8,
        title: "تفطير الصائمين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن زيد بن خالد الجهني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن فطَّرَ صائمًا كانَ لَهُ مثلُ أجرِهِ ، غيرَ أنَّهُ لا ينقُصُ من أجرِ الصَّائمِ شيئًا"',
          },
        ],
      },
      {
        id: 9,
        title: "الفطر على تمر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنسِ بنِ مالِكٍ رضي الله عنه قالَ : "كانَ رسولُ الله صلَّى الله عليهِ وسلَّمَ يُفطِرُ علَى رُطَباتٍ قبلَ أن يصلِّيَ فإن لم تكن رُطَباتٌ فعلى تَمراتٍ فإن لم تَكُن حَسا حَسَواتٍ مِن ماءٍ"',
          },
        ],
      },
      {
        id: 10,
        title: "قيام رمضان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن صامَ رَمَضانَ إيمانًا واحْتِسابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ، ومَن قامَ لَيْلَةَ القَدْرِ إيمانًا واحْتِسابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ"',
          },
        ],
      },
      {
        id: 11,
        title: "الإكثار من قراءة القرآن",
        isFavorite: false,
        ahadith: [
         
        ],
      },
      {
        id: 12,
        title: "الإعتكاف في مسجد في العشر الأواخر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ يَعْتَكِفُ العَشْرَ الأوَاخِرَ مِن رَمَضَانَ حتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ اعْتَكَفَ أزْوَاجُهُ مِن بَعْدِهِ"',
          },
        ],
      },
      {
        id: 13,
        title: "الإكثار من الدعاء خصوصا في العشر الأواخر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
          },
        ],
      },
      {
        id: 14,
        title: "الإجتهاد في جميع أنواع العبادات",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
          },
        ],
      },
      {
        id: 15,
        title: "عدم السب والقتال",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُريرةَ رَضِيَ اللهُ عنه، أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: "وإذا كان يومُ صَومِ أحَدِكم فلا يَرْفُثْ، ولا يصخَبْ فإن سابَّه أحدٌ، أو قاتَلَه، فليقُلْ: إنِّي امْرؤٌ صائِمٌ"',
          },
        ],
      },
      {
        id: 16,
        title: "الغمرة في رمضان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: لَمَّا رَجَعَ النبيُّ صلَّى اللهُ عليه وسلَّمَ مِن حَجَّتِهِ قالَ لِأُمِّ سِنَانٍ الأنْصَارِيَّةِ: "ما مَنَعَكِ مِنَ الحَجِّ؟" قالَتْ: أبو فُلَانٍ -تَعْنِي زَوْجَهَا- كانَ له نَاضِحَانِ، حَجَّ علَى أحَدِهِمَا، والآخَرُ يَسْقِي أرْضًا لَنَا. قالَ: "فإنَّ عُمْرَةً في رَمَضَانَ تَقْضِي حَجَّةً -أوْ حَجَّةً مَعِي-"',
          },
        ],
      },
      {
        id: 17,
        title: "صوم ثلاثة أيام من كل شهر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "أَوْصَانِي خَلِيلِي بثَلَاثٍ لا أدَعُهُنَّ حتَّى أمُوتَ: صَوْمِ ثَلَاثَةِ أيَّامٍ مِن كُلِّ شَهْرٍ، وصَلَاةِ الضُّحَى، ونَوْمٍ علَى وِتْرٍ"',
          },
          {
            id: 2,
            title: 'عن جرير بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صيامُ ثلاثةِ أيَّامٍ من كلِّ شَهرٍ صيامُ الدَّهرِ ، وأيَّامُ البيضِ صبيحةَ ثلاثَ عشرةَ وأربعَ عشرةَ وخمسَ عشرة."',
          },
          {
            id: 3,
            title: 'عن ملحان القيسي وقيل المنهال رضي الله عنهما قال: أن النبي صلى الله عليه وسلم "أنه كان يأمرُ بصيامِ البِيضِ : ثلاثَ عشرةَ ، وأربعَ عشرةَ ، وخمسَ عشرةَ ، ويقولُ : هو كصومُ الدهرِ ، أو كهيئةِ صومِ الدهرِ"',
          },
        ],
      },
      {
        id: 18,
        title: "صيام ستة أيام من شوال",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن صامَ رَمَضانَ ثُمَّ أتْبَعَهُ سِتًّا مِن شَوَّالٍ، كانَ كَصِيامِ الدَّهْرِ"',
          },
          {
            id: 2,
            title: 'عن ثوبان رضي الله عنه مولى رسول الله صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم: "جعل اللهُ الحسنةَ بعشر أمثالِها ، الشهرُ بعشرةِ أشهرٍ ، و صيامُ ستةِ أيامٍ بعد الشهرِ تمامُ السَّنةِ"',
          }
        ],
      },
      {
        id: 19,
        title: "صوم يوم في سبيل الله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ رَضِيَ الله عنه قال: قال النبي صلَّى اللهُ عليه وسلَّم: "من صام يومًا في سبيلِ الله، باعَدَ اللهُ وَجهَه عن النَّارِ سَبعينَ خريفًا"',
          },
          {
            id: 2,
            title: 'عن سَهلٍ رَضِيَ الله عنه أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم قال: "إنَّ في الجنَّةِ بابًا يقال له: الريَّانُ، يدخُلُ منه الصَّائِمونَ يومَ القيامةِ، لا يدخُلُ منه أحدٌ غَيرُهم. فيقال: أين الصَّائِمونَ؟ فيقومونَ، لا يدخُلُ منه أحدٌ غَيرُهم، فإذا دخَلُوا أُغلِقَ، فلم يدخُلْ منه أحدٌ"',
          },
        ],
      },
      {
        id: 20,
        title: "صيام يوم عرفة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صِيامُ يومِ عَرَفَةَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التي قَبلَهُ، والسنَةَ التي بَعدَهُ، وصِيامُ يومِ عاشُوراءَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التِي قَبْلَهُ"',
          },
        ],
      },
      {
        id: 21,
        title: "صيام يوم عاشوراء",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صِيامُ يومِ عَرَفَةَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التي قَبلَهُ، والسنَةَ التي بَعدَهُ، وصِيامُ يومِ عاشُوراءَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التِي قَبْلَهُ"',
          },
        ],
      },
      // {
      //   id: 20,
      //   title: "",
      //   ahadith: [
      //     {
      //       id: 1,
      //       title: "",
      //     },
      //   ],
      // },
    ],
  },
  {
    id: 13,
    title: "سنن يوم الجمعة",
    sunan: [
      {
        id: 1,
        title: "التطيب",
        desc: "من السنة التطيب ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عَمرِو بن سُلَيمٍ الأنصاريِّ، قال: أشهَدُ على أبي سعيدٍ، قال: أشهدُ على رسولِ اللهِ صلَّى اللهُ عليه وسلَّم، قال: "الغُسلُ يومَ الجُمُعةِ واجبٌ على كلِّ محتلمٍ، وأن يَستنَّ، وأنْ يمسَّ طِيبًا إنْ وَجَد"',
          },
          {
            id: 2,
            title: 'عن أبي سعيدٍ وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "مَن اغتَسَلَ يومَ الجُمُعة، واستنَّ، ومسَّ من طِيب إنْ كان عِندَه، ولبِسَ أحسنَ ثِيابِه، ثمَّ خرَج حتى يأتيَ المسجدَ، ولم يَتخطَّ رِقابَ الناسِ، ثم ركَعَ ما شاءَ اللهُ أن يَركَعَ، وأَنصَتَ إذا خرَج الإمامُ، كانتْ كفَّارةً لِمَا بينها وبينَ الجُمُعة التي قَبْلَها"',
          },
        ],
      },
      {
        id: 2,
        title: "الإغتسال",
        desc: "من السنة الإغتسال ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أوس بن أوس قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "من غسل واغتسل يوم الجمعة، وبكر وابتكر، ومشى ولم يركب، ودنا من الإمام فأنصت، كان له بكل خطوة يخطوها صيام سنة وقيامها وذلك على الله يسير"',
          },
          {
            id: 2,
            title: 'عن عَمرِو بن سُلَيمٍ الأنصاريِّ، قال: أشهَدُ على أبي سعيدٍ، قال: أشهدُ على رسولِ اللهِ صلَّى اللهُ عليه وسلَّم، قال: "الغُسلُ يومَ الجُمُعةِ واجبٌ على كلِّ محتلمٍ، وأن يَستنَّ، وأنْ يمسَّ طِيبًا إنْ وَجَد"',
          },
          {
            id: 3,
            title: 'عن أبي سعيدٍ وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "مَن اغتَسَلَ يومَ الجُمُعة، واستنَّ، ومسَّ من طِيب إنْ كان عِندَه، ولبِسَ أحسنَ ثِيابِه، ثمَّ خرَج حتى يأتيَ المسجدَ، ولم يَتخطَّ رِقابَ الناسِ، ثم ركَعَ ما شاءَ اللهُ أن يَركَعَ، وأَنصَتَ إذا خرَج الإمامُ، كانتْ كفَّارةً لِمَا بينها وبينَ الجُمُعة التي قَبْلَها"',
          },
          {
            id: 4,
            title: 'عن عبدالله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا جَاءَ أحَدُكُمُ الجُمُعَةَ، فَلْيَغْتَسِلْ"',
          },
        ],
      },
      {
        id: 3,
        title: "لبس الجميل",
        desc: "من السنة لبس الجميل ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "مَن اغتَسَلَ يومَ الجُمُعة، واستنَّ، ومسَّ من طِيب إنْ كان عِندَه، ولبِسَ أحسنَ ثِيابِه، ثمَّ خرَج حتى يأتيَ المسجدَ، ولم يَتخطَّ رِقابَ الناسِ، ثم ركَعَ ما شاءَ اللهُ أن يَركَعَ، وأَنصَتَ إذا خرَج الإمامُ، كانتْ كفَّارةً لِمَا بينها وبينَ الجُمُعة التي قَبْلَها"',
          },
        ],
      },
      {
        id: 4,
        title: "الإنصات إلى الخطبة",
        desc: "من السنة الإنصات للخطبة يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُرَيرَة رَضِيَ اللهُ عنه، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "إذا قُلتَ لصاحبِكَ يومَ الجُمُعةِ: أنصِتْ والإمامُ يَخطُبُ، فقد لغوتَ"',
          },
          {
            id: 2, 
            title: 'عن أوس بن أوس قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "من غسل واغتسل يوم الجمعة، وبكر وابتكر، ومشى ولم يركب، ودنا من الإمام فأنصت، كان له بكل خطوة يخطوها صيام سنة وقيامها وذلك على الله يسير"',
          },
        ]
      },
      {
        id: 5,
        title: "كثرة الصلاة على الرسول ﷺ",
        desc: "من السنة كثرة الصلاة على النبي صلى الله عليه وسلم يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَكثِروا الصَّلاةَ عليَّ يومَ الجمعةِ وليلةَ الجمعةِ فمن صلَّى عليَّ صلاةً صلَّى اللَّهُ عليْهِ عشرًا"',
          },
        ],
      },
      {
        id: 6,
        title: "التبكير إلى المسجد",
        desc: "من السنة التبكير للمسجد يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنِ اغْتَسَلَ يَومَ الجُمُعَةِ غُسْلَ الجَنَابَةِ ثُمَّ رَاحَ، فَكَأنَّما قَرَّبَ بَدَنَةً، ومَن رَاحَ في السَّاعَةِ الثَّانِيَةِ، فَكَأنَّما قَرَّبَ بَقَرَةً، ومَن رَاحَ في السَّاعَةِ الثَّالِثَةِ، فَكَأنَّما قَرَّبَ كَبْشًا أقْرَنَ، ومَن رَاحَ في السَّاعَةِ الرَّابِعَةِ، فَكَأنَّما قَرَّبَ دَجَاجَةً، ومَن رَاحَ في السَّاعَةِ الخَامِسَةِ، فَكَأنَّما قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإمَامُ حَضَرَتِ المَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ"',
          },
          {
            id: 2, 
            title: 'عن أوس بن أوس قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "من غسل واغتسل يوم الجمعة، وبكر وابتكر، ومشى ولم يركب، ودنا من الإمام فأنصت، كان له بكل خطوة يخطوها صيام سنة وقيامها وذلك على الله يسير"',
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا كانَ يَوْمُ الجُمُعَةِ وقَفَتِ المَلَائِكَةُ علَى بَابِ المَسْجِدِ يَكْتُبُونَ الأوَّلَ فَالأوَّلَ، ومَثَلُ المُهَجِّرِ كَمَثَلِ الذي يُهْدِي بَدَنَةً، ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً، ثُمَّ كَبْشًا، ثُمَّ دَجَاجَةً، ثُمَّ بَيْضَةً، فَإِذَا خَرَجَ الإمَامُ طَوَوْا صُحُفَهُمْ، ويَسْتَمِعُونَ الذِّكْرَ"',
          },
        ],
      },
      {
        id: 7,
        title: "السواك",
        desc: "من السنة السواك يوم الجمعة",
        isFavorite: false,
        ahadith: [
        
        ],
      },
      {
        id: 8,
        title: "قراءة سورة الكهف",
        desc: "من السنة قراءة سورة الكهف يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أبي سَعيدٍ الخُدريِّ عنِ النبيِّ صلَّى اللهُ عليه وسلَّم أنَّه قال: "مَن قَرَأَ سورةَ الكَهفِ يومَ الجُمُعةِ أضاءَ له من النورِ ما بَينَ الجُمُعتينِ"',
          },
        ],
      },
      {
        id: 9,
        title: "تحري ساعة الإجابة",
        desc: "من السنة الدعاء ساعة الإجابة يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ ذَكَرَ يَومَ الجُمُعَةِ، فَقالَ: فيه سَاعَةٌ، لا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وهو قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شيئًا، إلَّا أعْطَاهُ إيَّاهُ وأَشَارَ بيَدِهِ يُقَلِّلُهَا"',
          },
        ],
      },
      {
        id: 10,
        title: "الذهاب إلى صلاة الجمعة ماشيا",
        desc: "من السنة الذهاب إلى صلاة الجمعة ماشيا.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أوس بن أوس قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "من غسل واغتسل يوم الجمعة، وبكر وابتكر، ومشى ولم يركب، ودنا من الإمام فأنصت، كان له بكل خطوة يخطوها صيام سنة وقيامها وذلك على الله يسير"',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَلا أدُلُّكُمْ علَى ما يَمْحُو الله به الخَطايا، ويَرْفَعُ به الدَّرَجاتِ؟" قالُوا بَلَى يا رَسولَ اللهِ، قالَ: "إسْباغُ الوُضُوءِ علَى المَكارِهِ، وكَثْرَةُ الخُطا إلى المَساجِدِ، وانْتِظارُ الصَّلاةِ بَعْدَ الصَّلاةِ، فَذَلِكُمُ الرِّباطُ." وليسَ في حَديثِ شُعْبَةَ ذِكْرُ الرِّباطِ. وفي حَديثِ مالِكٍ ثِنْتَيْنِ "فَذَلِكُمُ الرِّباطُ، فَذَلِكُمُ الرِّباطُ"',
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أقيمَتِ الصَّلاةُ ، فلا تَأتوها وأنتُمْ تَسعونَ ، ولَكِن ائتوها وأنتُمْ تمشونَ ، وعليكُمُ السَّكينةَ فما أدرَكْتُمْ فصلُّوا ، وما فاتَكُم فأتمُّوا"',
          },
        ],
      },
    ],
  },
  {
    id: 14,
    title: "سنن الصلاة",
    sunan: [
      {
        id: 1,
        title: "وضع السترة في الصلاة إذا كان إماما أو منفردا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخُدريِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "إذا صلَّى أحَدُكم فليُصَلِّ إلى سُترةٍ ولْيَدْنُ منها"',
          },
          {
            id: 2,
            title: 'عن أبي ذَرٍّ الغِفاريِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "إذا قام أحَدُكم يُصلِّي، فإنَّه يستُرُه إذا كان بين يديه مِثلُ آخِرَةِ الرَّحْلِ، فإذا لم يكُنْ بين يديه مِثلُ آخِرَةِ الرَّحْلِ، فإنَّه يقطَعُ صلاتَه الحِمارُ والمرأةُ والكلبُ الأسودُ"',
          },
          {
            id: 3,
            title: 'عن أبي سعيدٍ الخُدريِّ رضيَ اللهُ عنه، قال: "سمِعْتُ النبيَّ صلَّى اللهُ عليه وسلَّم يقولُ: إذا صلَّى أحَدُكم إلى شيءٍ يستُرُه مِن النَّاسِ فأراد أحدٌ أنْ يجتازَ بين يديه فليدفَعْه، فإن أبى فليُقاتِلْه؛ فإنَّما هو شيطانٌ"',
          },
        ],
      },
      {
        id: 2,
        title: "سنن القيام",
        isFavorite: false,
        ahadith: [
        
        ],
      },
      {
        id: 3,
        title: "سنن الركوع",
        isFavorite: false,
      },
      {
        id: 4,
        title: "الرفع من الركوع",
        isFavorite: false,
      },
      {
        id: 5,
        title: "ما يقال في السجود",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ كانَ يقولُ: في سُجُودِهِ اللَّهُمَّ اغْفِرْ لي ذَنْبِي كُلَّهُ دِقَّهُ، وجِلَّهُ، وأَوَّلَهُ وآخِرَهُ وعَلانِيَتَهُ وسِرَّهُ"',
          },
        ],
      },
      {
        id: 6,
        title: "سنن الجلسة بين السجدتين",
        isFavorite: false,
      },
      {
        id: 7,
        title: "سنن التشهد",
        isFavorite: false,
      },
      {
        id: 8,
        title: "أذكار بعد الصلاة",
        isFavorite: false,
      },
      {
        id: 9,
        title: "الصلاة بالنعل",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خالِفوا اليَهودَ فإنَّهم لا يصلُّونَ في نعالِهِم ولا خفافِهِم"',
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه أن سُئِلَ: "أكانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يُصَلِّي في نَعْلَيْهِ؟" قالَ: "نَعَمْ"',
          },
        ],
      },
      {
        id: 10,
        title: "التفل على اليسار ثلاثا عند الوسوسة في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عُثْمَانَ بنَ أَبِي العَاصِ الثقفي رضي الله عنه أنه أَتَى النَّبيَّ صَلَّى الله عليه وسلَّمَ، فَقالَ: يا رَسولَ اللهِ، إنَّ الشَّيْطَانَ قدْ حَالَ بَيْنِي وبيْنَ صَلَاتي وَقِرَاءَتي؛ يَلْبِسُهَا عَلَيَّ، فَقالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "ذَاكَ شيطَانٌ يُقَالُ له: خَنْزَبٌ، فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ باللَّهِ منه، وَاتْفِلْ علَى يَسَارِكَ ثَلَاثًا". قالَ: فَفَعَلْتُ ذلكَ، فأذْهَبَهُ الله عَنِّي',
          },
        ],
      },
      {
        id: 11,
        title: "قراءة آية الكرسي بعد كل صلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أمامة البهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قرأَ آيةَ الكُرسيِّ في دبُرِ كلِّ صلاةٍ مَكْتوبةٍ لم يمنَعهُ مِن دخولِ الجنَّةِ إلَّا أن يموتَ"',
          },
        ],
      },
      {
        id: 12,
        title: "الدعاء بعد التشهد الأخير قبل التسليم من الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: كُنَّا لا نَدْري ما نقولُ في كلِّ ركعتَيْنِ، غيرَ أنْ نُسبِّحَ ونُكبِّرَ ونَحمَدَ ربَّنا، وإنَّ مُحمَّدًا صلَّى اللهُ عليه وسلَّمَ عَلَّمَ فواتِحَ الخيرِ وخواتمَهِ، فقال: "إذا قعَدْتُمْ في كلِّ ركعتَيْنِ، فقولوا: التَّحيَّاتُ للهِ، والصَّلواتُ، والطَّيِّباتُ، السَّلامُ عليكَ أيُّها النبيُّ ورحمةُ اللهِ وبركاتُهُ، السَّلامَ علينا وعلى عبادِ اللهِ الصالحينَ، أشهَدُ أنْ لا إلهَ إلَّا اللهُ، وأشهَدُ أنَّ مُحمَّدًا عبدُهُ ورسولُهُ، وَلْيتخيَّرْ أحدُكم مِنَ الدُّعاءِ أَعْجَبَهَ إليه، فَلْيَدْعُ اللهَ عزَّ وجلَّ"',
          },
        ],
      },
      {
        id: 13,
        title: "التكبير والتسبيح والتحميد عشر مرات بعد كل صلاة",
        ahadith: [
          {
            id: 2,
            title: 'عن عبد الله بن عمرو رضي الله عنهما  قال: قال رسول الله صلى الله عليه وسلم: "خصلتان، أو خلتان لا يحافظُ عليهما عبدٌ مسلمٌ إلا دخل الجنةَ، هما يسيرٌ، ومن يعملُ بهما قليلٌ، يسبِّحً في دُبُرِ كلِّ صلاةٍ عشْرًا، ويحمَدَ عشْرًا ، ويكبِّرُ عشْرًا، فذلك خمسون ومائةٌ باللسانِ، وألفٌ وخمسمائةٍ في الميزانِ، ويكبِّرُ أربعًا وثلاثين إذا أخذ مضجعَه ، ويحمَدُ ثلاثًا وثلاثين ، ويسبِّحُ ثلاثًا وثلاثين ، فذلك مائةٌ باللسانِ ، وألفٌ في الميزانِ." فلقد رأيتُ رسولُ اللهِ صلى الله عليه وسلم يعقِدُها بيدِه ، قالوا: يا رسولَ اللهِ ، كيف هما يسيرٌ ومن يعملُ بهما قليلٌ؟ قال: "يأتي أحدَكم – يعني الشيطانَ – في منامِه فيُنَوِّمُه قبل أن يقولَه ، ويأتيه في صلاتِه فيُذَكِّرَه حاجةً قبلَ أن يقولَها"',
          },
        ]
      },
      {
        id: 14,
        title: "الصلاة في وقتها",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قَالَ: "الذي تَفُوتُهُ صَلَاةُ العَصْرِ، كَأنَّما وُتِرَ أهْلَهُ ومَالَهُ"',
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: سَأَلْتُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: أيُّ العَمَلِ أحَبُّ إلى الله؟ قالَ: "الصَّلاةُ علَى وقْتِها"، قالَ: ثُمَّ أيٌّ؟ قالَ: "ثُمَّ برُّ الوالِدَيْنِ"، قالَ: ثُمَّ أيٌّ؟ قالَ: "الجِهادُ في سَبيلِ الله"، قالَ: حدَّثَني بهِنَّ، ولَوِ اسْتَزَدْتُهُ لَزادَنِي',
          },
        ],
      },
      {
        id: 15,
        title: "الصلاة في جماعة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبدُ الرَّحْمنِ بنُ أَبي عَمْرةَ رضي الله عنه قال: دَخَلَ عُثْمَانُ بنُ عَفَّانَ -رضي الله عنه- المَسْجِدَ بَعْدَ صَلَاةِ المَغْرِبِ، فَقَعَدَ وَحْدَهُ، فَقَعَدْتُ إلَيْهِ فَقالَ: يا ابْنَ أَخِي، سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ: "مَن صَلَّى العِشَاءَ في جَمَاعَةٍ فَكَأنَّما قَامَ نِصْفَ اللَّيْلِ، وَمَن صَلَّى الصُّبْحَ في جَمَاعَةٍ فَكَأنَّما صَلَّى اللَّيْلَ كُلَّهُ."',
          },
        ],
      },
      {
        id: 16,
        title: "السجود على سبع أعظم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
          },
        ],
      },
      {
        id: 17,
        title: "عدم ضم الثياب فوق بعضها البعض في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
          },
        ],
      },
      {
        id: 18,
        title: "عدم ربط الشعر في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
          },
        ],
      },
      {
        id: 19,
        title: "تعظيم الله في الركوع",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: كَشَفَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ السِّتَارَةَ والنَّاسُ صُفُوفٌ خَلْفَ أبِي بَكْرٍ، فَقالَ: "أيُّها النَّاسُ، إنَّه لَمْ يَبْقَ مِن مُبَشِّرَاتِ النُّبُوَّةِ إلَّا الرُّؤْيَا الصَّالِحَةُ، يَرَاهَا المُسْلِمُ، أوْ تُرَى له، ألَا وإنِّي نُهِيتُ أنْ أقْرَأَ القُرْآنَ رَاكِعًا، أوْ سَاجِدًا، فأمَّا الرُّكُوعُ فَعَظِّمُوا فيه الرَّبَّ عزَّ وجلَّ، وأَمَّا السُّجُودُ فَاجْتَهِدُوا في الدُّعَاءِ، فَقَمِنٌ أنْ يُسْتَجَابَ لَكُمْ." قالَ أبو بَكْرٍ، حَدَّثَنَا سُفْيَانُ، عن سُلَيْمَانَ',
          },
        ],
      },
      {
        id: 20,
        title: "الدعاء في السجود",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: كَشَفَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ السِّتَارَةَ والنَّاسُ صُفُوفٌ خَلْفَ أبِي بَكْرٍ، فَقالَ: "أيُّها النَّاسُ، إنَّه لَمْ يَبْقَ مِن مُبَشِّرَاتِ النُّبُوَّةِ إلَّا الرُّؤْيَا الصَّالِحَةُ، يَرَاهَا المُسْلِمُ، أوْ تُرَى له، ألَا وإنِّي نُهِيتُ أنْ أقْرَأَ القُرْآنَ رَاكِعًا، أوْ سَاجِدًا، فأمَّا الرُّكُوعُ فَعَظِّمُوا فيه الرَّبَّ عزَّ وجلَّ، وأَمَّا السُّجُودُ فَاجْتَهِدُوا في الدُّعَاءِ، فَقَمِنٌ أنْ يُسْتَجَابَ لَكُمْ." قالَ أبو بَكْرٍ، حَدَّثَنَا سُفْيَانُ، عن سُلَيْمَانَ',
          },
        ],
      },
    ],
  },
  {
    id: 15,
    title: "سنن الخلاء",
    sunan: [
      {
        id: 1,
        title: "قول الذكر الوارد عند دخول الخلاء والخروج منه",
        desc: "من السنة قول الدعاء الوارد عند دخول الخلاء والخروج منه",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ الخَلَاءَ قالَ: اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الخُبُثِ والخَبَائِثِ"',
          },
          {
            id: 2,
            title: 'عن عائشةَ رَضِيَ اللهُ عنها، قالت: "كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إذا خرَجَ مِن الخلاءِ قال: غُفرانَك"',
          },
        ]
      },
      {
        id: 2,
        title: "تقديم الرجل اليسرى عند الدخول، واليمنى عند الخروج",
        ahadith: [
         
        ],
      },
      {
        id: 3,
        title: "ستر الجسد والثياب من مماسة البول",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: مَرَّ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَائِطٍ مِن حِيطَانِ المَدِينَةِ، أوْ مَكَّةَ، فَسَمِعَ صَوْتَ إنْسَانَيْنِ يُعَذَّبَانِ في قُبُورِهِمَا، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: "يُعَذَّبَانِ، وما يُعَذَّبَانِ في كَبِيرٍ ثُمَّ قالَ: بَلَى، كانَ أحَدُهُما لا يَسْتَتِرُ مِن بَوْلِهِ، وكانَ الآخَرُ يَمْشِي بالنَّمِيمَةِ. ثُمَّ دَعَا بجَرِيدَةٍ، فَكَسَرَهَا كِسْرَتَيْنِ، فَوَضَعَ علَى كُلِّ قَبْرٍ منهما كِسْرَةً، فقِيلَ له: يا رَسولَ اللَّهِ، لِمَ فَعَلْتَ هذا؟ قالَ: لَعَلَّهُ أنْ يُخَفَّفَ عنْهما ما لَمْ تَيْبَسَا أوْ: إلى أنْ يَيْبَسَا"',
          },
        ],
      },
      {
        id: 4,
        title: "ترك التكلم بذكر أو بغيره",
        ahadith: [
         
        ],
      },
      {
        id: 5,
        title: "تكريم اليد اليمنى عن مس الفرج",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا شَرِبَ أحَدُكُمْ فلا يَتَنَفَّسْ في الإناءِ، وإذا بالَ أحَدُكُمْ فلا يَمْسَحْ ذَكَرَهُ بيَمِينِهِ، وإذا تَمَسَّحَ أحَدُكُمْ فلا يَتَمَسَّحْ بيَمِينِهِ"',
          },
        ],
      },
      {
        id: 6,
        title: "عدم الاستنجاء باليمين",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا شَرِبَ أحَدُكُمْ فلا يَتَنَفَّسْ في الإناءِ، وإذا بالَ أحَدُكُمْ فلا يَمْسَحْ ذَكَرَهُ بيَمِينِهِ، وإذا تَمَسَّحَ أحَدُكُمْ فلا يَتَمَسَّحْ بيَمِينِهِ"',
          },
          {
            id: 2,
            title: 'عن أم المؤمنين حفصة رضي الله عنها قالت: "أنَّ النَّبيَّ صلَّى الله عليهِ وسلَّمَ كانَ يجعلُ يمينَهُ لطعامِهِ وشرابِهِ وثيابِهِ ، ويجعلُ شمالَهُ لما سوى ذلِكَ"',
          },
          {
            id: 3,
            title: 'عن سلمان الفارسي رضي الله عنه، قال: قيل له: "قدْ عَلَّمَكُمْ نَبِيُّكُمْ صَلَّى الله عليه وسلَّمَ كُلَّ شيءٍ حتَّى الخِراءَةَ قالَ: فقالَ: أجَلْ لقَدْ نَهانا أنْ نَسْتَقْبِلَ القِبْلَةَ لِغائِطٍ، أوْ بَوْلٍ، أوْ أنْ نَسْتَنْجِيَ باليَمِينِ، أوْ أنْ نَسْتَنْجِيَ بأَقَلَّ مِن ثَلاثَةِ أحْجارٍ، أوْ أنْ نَسْتَنْجِيَ برَجِيعٍ، أوْ بعَظْمٍ"',
          },
        ],
      },
      {
        id: 7,
        title: "عدم قضاء الحاجة في طريق مسلوك وظل نافع ومورد ماء",
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن جبل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اتَّقوا الملاعنَ الثَّلاثَ البَرازَ في المواردِ وقارعةِ الطَّريقِ والظِّلِّ"',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسُولَ اللهِ صَلَّى الله عليه وَسَلَّمَ قالَ: "اتَّقُوا اللَّعَّانَيْنِ" قالوا: وَما اللَّعَّانَانِ يا رَسُولَ اللهِ؟ قالَ: "الذي يَتَخَلَّى في طَرِيقِ النَّاسِ، أَوْ في ظِلِّهِمْ"',
          },
        ],
      },
      {
        id: 8,
        title: "عدم قضاء الحاجة في الماء",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "عَنْ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ أنَّه نَهَى أنْ يُبالَ في الماءِ الرَّاكِدِ"',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَبُولَنَّ أحَدُكُمْ في المَاءِ الدَّائِمِ الذي لا يَجْرِي، ثُمَّ يَغْتَسِلُ فِيهِ"',
          },
        ],
      },
      {
        id: 9,
        title: "عدم التبول في مكان الوضوء ومكان الاستحمام",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مُغفَّل رضي الله عنه عن النبي صلى الله عليه وسلم قال: "لا يبولَنَّ أحدُكم في مُستحَمِّه، فإنَّ عامَّةَ الوَسْواسِ منه"'
          },
          {
            id: 2,
            title: 'عَن حُمَيْدِ بنِ عبدِ الرَّحمنِ الحِميريِّ قالَ: "لقيتُ رجلًا صَحِبَ النَّبيَّ صلَّى الله عليهِ وسلَّمَ كما صحبَهُ أبو هُرَيْرةَ رضيَ اللَّهُ عنهُ قالَ: نَهَى رَسولُ الله صلَّى الله عليهِ وسلَّمَ أن يمتَشِطَ أحدُنا كلَّ يومٍ ، أو يَبولَ في مغتَسلِهِ ، أو يغتسِلَ الرَّجلُ بفضلِ المرأةِ ، والمرأةُ بفضلِ الرَّجلِ ، وليغتَرِفا جميعًا"',
          },
        ],
      },
      {
        id: 10,
        title: "اجتناب قضاء الحاجة في المساجد",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "بيْنَما نَحْنُ في المَسْجِدِ مع رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ. إذْ جاءَ أعْرابِيٌّ فَقامَ يَبُولُ في المَسْجِدِ، فقالَ أصْحابُ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: مَهْ مَهْ، قالَ: قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: لا تُزْرِمُوهُ دَعُوهُ فَتَرَكُوهُ حتَّى بالَ، ثُمَّ إنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ دَعاهُ فقالَ له: إنَّ هذِه المَساجِدَ لا تَصْلُحُ لِشيءٍ مِن هذا البَوْلِ، ولا القَذَرِ إنَّما هي لِذِكْرِ اللهِ عزَّ وجلَّ، والصَّلاةِ وقِراءَةِ القُرْآنِ، أوْ كما قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ قالَ: فأمَرَ رَجُلًا مِنَ القَوْمِ فَجاءَ بدَلْوٍ مِن ماءٍ فَشَنَّهُ عليه"',
          },
        ],
      },
      {
        id: 11,
        title: "الاستتار من الناس",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبي قُراد رضي الله عنه قال: "خرَجتُ معَ رسولِ اللَّهِ إلى الخَلاءِ ، وَكانَ إذا أرادَ الحاجةَ أبعَدَ"',
          },
        ],
      },
      {
        id: 12,
        title: "يستحب لمن استجمر بالحجارة أن يوتر",
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا تَوَضَّأَ أحَدُكُمْ فَلْيَجْعَلْ في أنْفِهِ، ثُمَّ لِيَنْثُرْ، ومَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وإذَا اسْتَيْقَظَ أحَدُكُمْ مِن نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أنْ يُدْخِلَهَا في وَضُوئِهِ؛ فإنَّ أحَدَكُمْ لا يَدْرِي أيْنَ بَاتَتْ يَدُهُ"'
          },
        ],
      },
      {
        id: 13,
        title: "عدم الاستجمار بروث أو عظم أو طعام",
        ahadith: [
          {
            id: 1,
            title: 'عن سلمان الفارسي رضي الله عنه، قال: قيل له: "قدْ عَلَّمَكُمْ نَبِيُّكُمْ صَلَّى الله عليه وسلَّمَ كُلَّ شيءٍ حتَّى الخِراءَةَ قالَ: فقالَ: أجَلْ لقَدْ نَهانا أنْ نَسْتَقْبِلَ القِبْلَةَ لِغائِطٍ، أوْ بَوْلٍ، أوْ أنْ نَسْتَنْجِيَ باليَمِينِ، أوْ أنْ نَسْتَنْجِيَ بأَقَلَّ مِن ثَلاثَةِ أحْجارٍ، أوْ أنْ نَسْتَنْجِيَ برَجِيعٍ، أوْ بعَظْمٍ"',
          },
        ],
      },
      {
        id: 14,
        title: "غسل اليد بالصابون ونحوه بعد الخروج من الخلاء",
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين ميمونة بنت الحارث رضي الله عنها قالت: "صَبَبْتُ للنبيِّ صَلَّى اللهُ عليه وسلَّمَ غُسْلًا، فأفْرَغَ بيَمِينِهِ علَى يَسَارِهِ فَغَسَلَهُمَا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ قالَ بيَدِهِ الأرْضَ فَمَسَحَهَا بالتُّرَابِ، ثُمَّ غَسَلَهَا، ثُمَّ تَمَضْمَضَ واسْتَنْشَقَ، ثُمَّ غَسَلَ وجْهَهُ، وأَفَاضَ علَى رَأْسِهِ، ثُمَّ تَنَحَّى، فَغَسَلَ قَدَمَيْهِ، ثُمَّ أُتِيَ بمِنْدِيلٍ فَلَمْ يَنْفُضْ بهَا"',
          },
        ],
      },
      {
        id: 15,
        title: "عدم استقبال القبلة واستدبارها في الخلاء دون البنيان",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا جَلَسَ أَحَدُكُمْ علَى حَاجَتِهِ، فلا يَسْتَقْبِلِ القِبْلَةَ، وَلَا يَسْتَدْبِرْهَا"',
          },
          {
            id: 2,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ قالَ: "إذَا أتَيْتُمُ الغَائِطَ فلا تَسْتَقْبِلُوا القِبْلَةَ، ولَا تَسْتَدْبِرُوهَا ولَكِنْ شَرِّقُوا أوْ غَرِّبُوا" قالَ أبو أيُّوبَ: فَقَدِمْنَا الشَّأْمَ فَوَجَدْنَا مَرَاحِيضَ بُنِيَتْ قِبَلَ القِبْلَةِ فَنَنْحَرِفُ، ونَسْتَغْفِرُ اللَّهَ تَعَالَى',
          },
          {
            id: 3,
            title: 'عن سلمان الفارسي رضي الله عنه، قال: قيل له: "قدْ عَلَّمَكُمْ نَبِيُّكُمْ صَلَّى الله عليه وسلَّمَ كُلَّ شيءٍ حتَّى الخِراءَةَ قالَ: فقالَ: أجَلْ لقَدْ نَهانا أنْ نَسْتَقْبِلَ القِبْلَةَ لِغائِطٍ، أوْ بَوْلٍ، أوْ أنْ نَسْتَنْجِيَ باليَمِينِ، أوْ أنْ نَسْتَنْجِيَ بأَقَلَّ مِن ثَلاثَةِ أحْجارٍ، أوْ أنْ نَسْتَنْجِيَ برَجِيعٍ، أوْ بعَظْمٍ"',
          },
        ],
      },
    ],
  },
  {
    id: 16,
    title: "سنن الدعاء",
    sunan: [
      {
        id: 1,
        title: "الدعاء على طهارة",
        isFavorite: false,
      },
      {
        id: 2,
        title: "إستقبال القبلة",
        isFavorite: false,
      },
      {
        id: 3,
        title: "رفع اليدين",
        isFavorite: false,
      },
      {
        id: 4,
        title: "البدء بالثناء على الله عز وجل والصلاة على رسوله ﷺ",
        isFavorite: false,
      },
      {
        id: 5,
        title: "دعاء الله تعالى بأسمائه الحسنى",
        isFavorite: false,
      },
      {
        id: 6,
        title: "تكرار الدعاء والإلحاح فيه",
        isFavorite: false,
      },
      {
        id: 7,
        title: "إخفاء الدعاء",
        isFavorite: false,
      },
      {
        id: 8,
        title: "ماذا أقول في الدعاء ؟",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: "",
          },
        ],
      },
      {
        id: 9,
        title: "الدعاء للمسلمين بظهر الغيب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما مِن عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بظَهْرِ الغَيْبِ، إلَّا قالَ المَلَكُ: وَلَكَ بمِثْلٍ"',
          },
        ],
      },
      {
        id: 10,
        title: "الدعاء عند سماع صياح الديك والاستعاذة عند سماع صوت الحمار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِن فَضْلِهِ؛ فإنَّهَا رَأَتْ مَلَكًا، وإذَا سَمِعْتُمْ نَهِيقَ الحِمَارِ فَتَعَوَّذُوا باللَّهِ مِنَ الشَّيْطَانِ؛ فإنَّه رَأَى شيطَانًا"',
          },
        ],
      },
      {
        id: 11,
        title: "الدعاء عند نزول المطر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ كانَ إذَا رَأَى المَطَرَ، قالَ: "اللَّهُمَّ صَيِّبًا نَافِعًا"',
          },
        ],
      },
      {
        id: 12,
        title: "الدعاء بعد التشهد الأخير قبل التسليم من الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: كُنَّا لا نَدْري ما نقولُ في كلِّ ركعتَيْنِ، غيرَ أنْ نُسبِّحَ ونُكبِّرَ ونَحمَدَ ربَّنا، وإنَّ مُحمَّدًا صلَّى اللهُ عليه وسلَّمَ عَلَّمَ فواتِحَ الخيرِ وخواتمَهِ، فقال: "إذا قعَدْتُمْ في كلِّ ركعتَيْنِ، فقولوا: التَّحيَّاتُ للهِ، والصَّلواتُ، والطَّيِّباتُ، السَّلامُ عليكَ أيُّها النبيُّ ورحمةُ اللهِ وبركاتُهُ، السَّلامَ علينا وعلى عبادِ اللهِ الصالحينَ، أشهَدُ أنْ لا إلهَ إلَّا اللهُ، وأشهَدُ أنَّ مُحمَّدًا عبدُهُ ورسولُهُ، وَلْيتخيَّرْ أحدُكم مِنَ الدُّعاءِ أَعْجَبَهَ إليه، فَلْيَدْعُ اللهَ عزَّ وجلَّ"',
          },
        ],
      },
      {
        id: 13,
        title: "الدعاء عندما تعصف الريح",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كانَ النَّبيُّ صلَّى الله علَيهِ وسلَّمَ إذا رأَى الرِّيحَ قالَ اللَّهُمَّ إنِّي أسألُكَ مِن خَيرِها وخَيرِ ما فيها وخَيرِ ما أُرْسِلَت بِهِ وأعوذُ بِكَ مِن شرِّها وشرِّ ما فيها وشرِّ ما أُرْسِلَت بِهِ"',
          },
        ],
      },
      {
        id: 14,
        title: "الدعاء عند المصيبة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما مِن مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ، فيَقولُ ما أمَرَهُ الله: {إِنَّا لله وَإِنَّا إِلَيْهِ رَاجِعُونَ} [البقرة: 156]، اللَّهُمَّ أْجُرْنِي في مُصِيبَتِي، وأَخْلِفْ لي خَيْرًا مِنْها، إلَّا أخْلَفَ الله له خَيْرًا مِنْها"، قالَتْ: فَلَمَّا ماتَ أبو سَلَمَةَ، قُلتُ: أيُّ المُسْلِمِينَ خَيْرٌ مِن أبِي سَلَمَةَ؟ أوَّلُ بَيْتٍ هاجَرَ إلى رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، ثُمَّ إنِّي قُلتُها، فأخْلَفَ الله لي رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ، قالَتْ: أرْسَلَ إلَيَّ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ حاطِبَ بنَ أبِي بَلْتَعَةَ يَخْطُبُنِي له، فَقُلتُ: إنَّ لي بنْتًا، وأنا غَيُورٌ، فقالَ: "أمَّا ابْنَتُها فَنَدْعُو اللَّهَ أنْ يُغْنِيَها عَنْها، وأَدْعُو اللَّهَ أنْ يَذْهَبَ بالغَيْرَةِ"',
          },
        ],
      },
      {
        id: 14,
        title: "دعاء القنوت",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن الحسنِ بن عليٍّ بن أبي طالب رضيَ الله عنْهما، قال : علَّمني رسولُ الله صلَّى الله عليْهِ وسلَّمَ كلماتٍ أقولُهنَّ في الوترِ، - قالَ ابنُ جوَّاسٍ: في قنوتِ الوترِ "اللَّهمَّ اهدِني فيمن هديت، وعافِني فيمن عافيتَ، وتولَّني فيمن تولَّيتَ، وبارِك لي فيما أعطيتَ، وقني شرَّ ما قضيتَ، إنَّكَ تقضي ولا يقضى عليْكَ، وإنَّهُ لا يذلُّ من واليتَ، ولا يعزُّ من عاديتَ، تبارَكتَ ربَّنا وتعاليتَ"',
          },
        ],
      },
    ],
  },
  {
    id: 17,
    title: "سنن المريض",
    sunan: [
      {
        id: 1,
        title: "عيادة المريض",
        ahadith: [
          {
            id: 1,
            title: 'عن ثوبان مولى رسول الله صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم: "مَن عادَ مَرِيضًا لَمْ يَزَلْ في خُرْفَةِ الجَنَّةِ"، قيلَ يا رَسولَ اللهِ، وما خُرْفَةُ الجَنَّةِ؟ قالَ: "جَناها"',
          },
          {
            id: 2,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
          },
        ],
      },
      {
        id: 2,
        title: "وضع اليد على موضع الألم والدعاء",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن أبي العاص الثقفي رضي الله عنه ، أنَّهُ شَكَا إلى رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ وَجَعًا يَجِدُهُ في جَسَدِهِ مُنْذُ أَسْلَمَ، فَقالَ له رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: "ضَعْ يَدَكَ علَى الَّذي تَأَلَّمَ مِن جَسَدِكَ، وَقُلْ: باسْمِ اللهِ، ثَلَاثًا، وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِن شَرِّ ما أَجِدُ وَأُحَاذِرُ"',
          },
        ],
      },
      {
        id: 3,
        title: "التداوي بالعسل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: أنَّ رَجُلًا أتَى النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ فقالَ: أخِي يَشْتَكِي بَطْنَهُ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتَى الثَّانِيَةَ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتاهُ الثَّالِثَةَ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتاهُ فقالَ: قدْ فَعَلْتُ؟ فقالَ: "صَدَقَ اللَّهُ، وكَذَبَ بَطْنُ أخِيكَ، اسْقِهِ عَسَلًا"، فَسَقاهُ فَبَرَأَ.',
          },
        ],
      },
      
    ],
  },
  {
    id: 18,
    title: "سنن التوبة",
    sunan: [
      {
        id: 1,
        title: "صلاة ركعتين عند التوبة من الذنب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي بكر رضي الله عنه قال: سَمِعْتُ رسولَ الله صلَّى الله علَيهِ وسلَّمَ يقولُ: "ما مِن عبدٍ يذنبُ ذنبًا، فيُحسنُ الطُّهورَ، ثمَّ يقومُ فيُصلِّي رَكْعتينِ، ثمَّ يستغفِرُ اللَّهَ، إلَّا غفرَ الله لَهُ"، ثمَّ قرأَ هذِهِ الآيةَ: "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ إلى آخرِ الآيةِ"',
          },
        ],
      },
      {
        id: 2,
        title: "التصدق عند التوبة",
      },
    ],
  },
  {
    id: 19,
    title: "سنن الأعمال الصالحة",
    sunan: [
      {
        id: 1,
        title: "إزالة الأذى عن الطريق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "بيْنَما رَجُلٌ يَمْشِي بطَرِيقٍ وجَدَ غُصْنَ شَوْكٍ علَى الطَّرِيقِ فأخَّرَهُ، فَشَكَرَ اللَّهُ له فَغَفَرَ له"',
          },
        ],
      },
      {
        id: 2,
        title: "المداومة على العمل الصالح وإن قل",
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: سئل رسول الله صلى الله عليه وسلم: أي الأعمال أحب إلى الله ؟ قال: "أَحَبُّ الأعمالِ إلى اللهِ أدْومُها و إن قَلَّ"',
          },
        ],
      },
      {
        id: 3,
        title: "معاونة الأهل في أعمال البيت",
        ahadith: [
          {
            id: 1,
            title: 'عن الأسود رضي الله عنه قال: سَأَلْتُ عَائِشَةَ ما كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَصْنَعُ في بَيْتِهِ؟ قالَتْ: "كانَ يَكونُ في مِهْنَةِ أهْلِهِ - تَعْنِي خِدْمَةَ أهْلِهِ - فَإِذَا حَضَرَتِ الصَّلَاةُ خَرَجَ إلى الصَّلَاةِ"',
          },
        ],
      },
      {
        id: 4,
        title: "إحتساب النفقة على الأهل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مسعود البدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ المُسْلِمَ إذا أنْفَقَ علَى أهْلِهِ نَفَقَةً، وهو يَحْتَسِبُها، كانَتْ له صَدَقَةً"',
          },
        ],
      },
      {
        id: 5,
        title: "إعلام الرجل أخيه أنه يحبه",
        ahadith: [
          {
            id: 1,
            title: 'عن المقدام بن معدي كرب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أحبَّ أحدُكم أخاه فليُعْلمَه إيَّاه"',
          },
        ],
      },
      {
        id: 6,
        title: "كفالة اليتيم",
        ahadith: [
          {
            id: 1,
            title: 'عن سهل بن سعد الساعدي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا وَكافلُ اليتيمِ في الجنَّةِ كَهاتين ، وأشارَ بأصبُعَيْهِ يعني: السَّبَّابةَ والوسطى"',
          },
        ],
      },
      {
        id: 7,
        title: "الصدقة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن تَصَدَّقَ بعَدْلِ تَمْرَةٍ مِن كَسْبٍ طَيِّبٍ، ولَا يَقْبَلُ اللَّهُ إلَّا الطَّيِّبَ، وإنَّ اللَّهَ يَتَقَبَّلُهَا بيَمِينِهِ، ثُمَّ يُرَبِّيهَا لِصَاحِبِهِ، كما يُرَبِّي أَحَدُكُمْ فَلُوَّهُ، حتَّى تَكُونَ مِثْلَ الجَبَلِ"',
          },
        ],
      },
      {
        id: 8,
        title: "الإكثار من قراءة القرآن",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أمامة الباهلي رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "اقْرَؤُوا القُرْآنَ فإنَّه يَأْتي يَومَ القِيامَةِ شَفِيعًا لأَصْحابِهِ، اقْرَؤُوا الزَّهْراوَيْنِ البَقَرَةَ، وسُورَةَ آلِ عِمْرانَ، فإنَّهُما تَأْتِيانِ يَومَ القِيامَةِ كَأنَّهُما غَمامَتانِ، أوْ كَأنَّهُما غَيايَتانِ، أوْ كَأنَّهُما فِرْقانِ مِن طَيْرٍ صَوافَّ، تُحاجَّانِ عن أصْحابِهِما، اقْرَؤُوا سُورَةَ البَقَرَةِ، فإنَّ أخْذَها بَرَكَةٌ، وتَرْكَها حَسْرَةٌ، ولا تَسْتَطِيعُها البَطَلَةُ. قالَ مُعاوِيَةُ: بَلَغَنِي أنَّ البَطَلَةَ: السَّحَرَةُ. [وفي رواية]: غيرَ أنَّه قالَ: وكَأنَّهُما في كِلَيْهِما، ولَمْ يَذْكُرْ قَوْلَ مُعاوِيَةَ بَلَغَنِي"',
          },
        ],
      },
      {
        id: 9,
        title: "ذكر الله على كل حال",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كانَ النبيُّ صَلَّى الله عليه وسلَّمَ يَذْكُرُ اللَّهَ علَى كُلِّ أحْيَانِهِ"',
          },
        ],
      },
      {
        id: 10,
        title: "زراعة الأشجار",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنْ قامَتِ السَّاعةُ وفي يدِ أحدِكُم فَسيلةٌ فإنِ استَطاعَ أن لا تَقومَ حتَّى يغرِسَها فلْيغرِسْها"',
          },
        ],
      },
      {
        id: 11,
        title: "أعمال تنفع المسلم في قبره",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ مما يلحَقُ المؤمنَ مِنْ عملِهِ وحسناتِهِ ، بعدَ موتِهِ ، علمًا نشرَهُ ، وولدًا صالحًا تركَهَ ، ومصحفًا ورَّثَهُ ، أوْ مسجِدًا بناهُ ، أوْ بيتًا لابْنِ السبيلِ بناهُ ، أوْ نهرًا أجراهُ ، أوْ صدَقَةً أخرجَها مِنْ مالِهِ في صحَّتِهِ وحياتِهِ ، تلحقُهُ مِنْ بعدِ موتِهِ"',
          },
        ],
      },
      {
        id: 12,
        title: "الأعمال الصالحة في العشر الأوائل من ذي الحجة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما العَمَلُ في أيَّامٍ أفْضَلَ منها في هذه، قالوا: ولا الجِهادُ؟ قالَ: ولا الجِهادُ، إلَّا رَجُلٌ خَرَجَ يُخاطِرُ بنَفْسِه ومالِه، فلَمْ يَرْجِعْ بشَيءٍ"',
          },
        ],
      },
        // {
      //   id: 5,
      //   title: "",
      //   ahadith: [
      //     {
      //       id: 1,
      //       title: ""
      //     },
      //   ],
      // },
    ],
  },
  {
    id: 20,
    title: "سنن المولود",
    sunan: [
      {
        id: 1,
        title: "تحنيك المولود",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: "وُلِدَ لي غُلَامٌ، فأتَيْتُ به النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ فَسَمَّاهُ إبْرَاهِيمَ، فَحَنَّكَهُ بتَمْرَةٍ، ودَعَا له بالبَرَكَةِ، ودَفَعَهُ إلَيَّ". وكانَ أكْبَرَ ولَدِ أبِي مُوسَى',
          },
        ]
      },
    ],
  },
  {
    id: 21,
    title: "سنن البيع والشراء",
    sunan: [
      {
        id: 1,
        title: "السماحة في البيع والشراء",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله، رضي الله عنهما أنَّ رسول الله صلى الله عليه وسلم قال: "رحم الله رجلًا سمحًا إذا باع، وإذا اشترى، وإذا اقتضى"',
          },
        ]
      },
    ],
  },
  {
    id: 22,
    title: "سنن الأخلاق",
    sunan: [
      {
        id: 1,
        title: "ترك ما لا يعنيه",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من حُسنِ إسلامِ المرءِ تركُه ما لا يَعنيهِ"',
          },
        ],
      },
      {
        id: 2,
        title: "الحياء",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الإِيمانُ بضْعٌ وسَبْعُونَ، أوْ بضْعٌ وسِتُّونَ، شُعْبَةً، فأفْضَلُها قَوْلُ لا إلَهَ إلَّا اللَّهُ، وأَدْناها إماطَةُ الأذَى عَنِ الطَّرِيقِ، والْحَياءُ شُعْبَةٌ مِنَ الإيمانِ"',
          },
        ],
      },
      {
        id: 3,
        title: "إحسان الظن بالناس",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ، فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَحَسَّسُوا، ولا تَجَسَّسُوا، ولا تَنافَسُوا، ولا تَحاسَدُوا، ولا تَباغَضُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ اللهِ إخْوانًا"',
          },
        ],
      },
      {
        id: 4,
        title: "تجنب الغضب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَجُلًا قالَ للنَّبيِّ صلَّى اللهُ عليه وسلَّم: أوْصِنِي، قالَ: "لا تَغْضَبْ". فَرَدَّدَ مِرَارًا، قالَ: "لا تَغْضَبْ"',
          },
        ],
      },
      {
        id: 5,
        title: "التبسم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال لي النبي صلى الله عليه وسلم : "لا تَحْقِرَنَّ مِنَ المَعروفِ شيئًا، ولو أنْ تَلْقَى أخاكَ بوَجْهٍ طَلْقٍ"',
          },
        ],
      },
      {
        id: 6,
        title: "عدم الكذب",
        ahadith: [
          {
            id: 1,
            title: 'عن معاوية بن حيدة القشيري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ويلٌ للذي يحدِّثُ بالحديثِ ليُضحكَ به القومَ فيكذبُ ويلٌ له ويلٌ له"',
          },
        ],
      },
      {
        id: 7,
        title: "عدم النجش",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "نَهَى النبيُّ صَلَّى اللهُ عليه وسلَّمَ عَنِ النَّجْشِ"',
          },
        ],
      },
      {
        id: 8,
        title: "عدم النميمة",
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه أنَّهُ بَلَغَهُ أنَّ رَجُلًا يَنِمُّ الحَدِيثَ فقالَ حُذَيْفَةُ: سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ: "لا يَدْخُلُ الجَنَّةَ نَمَّامٌ."',
          },
        ],
      },
    ],
  },
  {
    id: 23,
    title: "السنن الرواتب",
    sunan: [
      {
        id: 1,
        title: "أداء السنن الرواتب",
        desc: "من السنة أداء السنن الرواتب.",
        ahadith: [
          {
            id: 1,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما من عبدٍ مسلمٍ يصلِّي للهِ تعالى في كلِّ يومٍ ثِنْتي عشرةَ ركعةً تطوُّعًا غيرَ فريضةٍ إلا بنى اللهُ تعالى له بيتًا في الجنَّةِ ، أو : إلا بُنِيَ له بيتٌ في الجنَّةِ :أربعًا قبلَ الظهرِ ، و ركعتَين بعدَها ، و ركعتَين بعد المغربِ ، و ركعتَين بعد العشاءِ ، و ركعتَين قبلَ صلاةِ الغَداةِ"',
          },
        ],
      },
      {
        id: 2,
        title: "سنة الفجر القبلية",
        desc: "من السنة صلاة ركعتين قبل صلاة الفجر.",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "رَكْعَتَا الفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَما فِيهَا"',
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رضِي الله عنها، قالت: "لم يكُنِ النبيُّ صلَّى اللهُ عليه وسلَّم على شيءٍ مِن النوافلِ أَشدَّ تعاهُدًا منْه على رَكعتَي الفجرِ"',
          },
          {
            id: 3,
            title: 'قالت عائشةُ أم المؤمنين رَضِيَ اللهُ عَنْها عن تطوُّعِ النبيِّ صلَّى اللهُ عليه وسلَّم: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
          },
        ],
      },
      {
        id: 3,
        title: "سنة الظهر القبلية",
        desc: "من السنة صلاة أربع ركعات (ركعتين ركعتين) قبل صلاة الظهر.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ السَّائبِ رَضِيَ اللهُ عَنْه: "أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم كان يُصلِّي أربعًا بعد أن تزولَ الشمسُ قبل الظهرِ، وقال: إنَّها ساعةٌ تُفتَحُ فيها أبوابُ السَّماء؛ فأحبُّ أن يَصعَدَ لي فيها عملٌ صالحٌ"',
          },
          {
            id: 2,
            title: 'عن عليِّ بنِ أبي طالبٍ رَضِيَ اللهُ عَنْه، قال: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُصلِّي قبلَ الظهر أربعًا، وبعدَها ركعتينِ"',
          },
          {
            id: 3,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "مَنْ صلى أربعَ ركعاتٍ قبلَ الظهرِ وأربعًا بعدَها حرَّمَهُ اللهُ على النارِ"',
          },
          {
            id: 4,
            title: 'قالت عائشةُ أم المؤمنين رَضِيَ اللهُ عَنْها عن تطوُّعِ النبيِّ صلَّى اللهُ عليه وسلَّم: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
          },
        ]
      },
      {
        id: 4,
        title: "سنة الظهر البعدية",
        desc: "من السنة صلاة أربع ركعات (ركعتين ركعتين) بعد صلاة الظهر.",
        ahadith: [
          {
            id: 1,
            title: 'عن عليِّ بنِ أبي طالبٍ رَضِيَ اللهُ عَنْه، قال: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُصلِّي قبلَ الظهر أربعًا، وبعدَها ركعتينِ"',
          },
          {
            id: 2,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "مَنْ صلى أربعَ ركعاتٍ قبلَ الظهرِ وأربعًا بعدَها حرَّمَهُ اللهُ على النارِ"',
          },
          {
            id: 3,
            title: 'قالت عائشةُ أم المؤمنين رَضِيَ اللهُ عَنْها عن تطوُّعِ النبيِّ صلَّى اللهُ عليه وسلَّم: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
          },
        ]
      },
      {
        id: 5,
        title: "سنة المغرب البعدية",
        desc: "من السنة صلاة ركعتين بعد صلاة المغرب.",
        ahadith: [
          {
            id: 1,
            title: 'عن ابنِ عُمرَ رَضِيَ اللهُ عَنْهما، قال: "حفظتُ عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم عشرَ ركعاتٍ؛ ركعتَينِ قبل الظُّهرِ، وركعتينِ بعدَها، وركعتينِ بعدَ المغربِ في بيتِه، وركعتينِ بعدَ العِشاءِ في بيتِه، وركعتينِ قبلَ الصُّبحِ، كانتْ ساعةً لا يَدخُلُ على النبيِّ صلَّى اللهُ عليه وسلَّم فيها، حدَّثَتْني حفصةُ، أنَّه كان إذا أذَّنَ المؤذِّنُ وطلَعَ الفجرُ صلَّى ركعتينِ"',
          },
          {
            id: 2,
            title: 'قالت عائشةُ أم المؤمنين رَضِيَ اللهُ عَنْها عن تطوُّعِ النبيِّ صلَّى اللهُ عليه وسلَّم: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
          },
        ],
      },
      {
        id: 6,
        title: "سنة العشاء البعدية",
        desc: "من السنة صلاة ركعتين بعد صلاة العشاء.",
        ahadith: [
          {
            id: 1,
            title: 'عن ابنِ عُمرَ رَضِيَ اللهُ عَنْهما، قال: "حفظتُ عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم عشرَ ركعاتٍ؛ ركعتَينِ قبل الظُّهرِ، وركعتينِ بعدَها، وركعتينِ بعدَ المغربِ في بيتِه، وركعتينِ بعدَ العِشاءِ في بيتِه، وركعتينِ قبلَ الصُّبحِ، كانتْ ساعةً لا يَدخُلُ على النبيِّ صلَّى اللهُ عليه وسلَّم فيها، حدَّثَتْني حفصةُ، أنَّه كان إذا أذَّنَ المؤذِّنُ وطلَعَ الفجرُ صلَّى ركعتينِ"',
          },
          {
            id: 2,
            title: 'قالت عائشةُ أم المؤمنين رَضِيَ اللهُ عَنْها عن تطوُّعِ النبيِّ صلَّى اللهُ عليه وسلَّم: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
          },
        ],
      },
    ],
  },
  {
    id: 24,
    title: "سنن صلاة النوافل",
    sunan: [
      {
        id: 1,
        title: "أداء صلاة النافلة في البيت",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا قَضَى أحَدُكُمُ الصَّلاةَ في مَسْجِدِهِ، فَلْيَجْعَلْ لِبَيْتِهِ نَصِيبًا مِن صَلاتِهِ، فإنَّ اللَّهَ جاعِلٌ في بَيْتِهِ مِن صَلاتِهِ خَيْرًا"',
          },
          {
            id: 2,
            title: 'عن زيدِ بنِ ثابتٍ، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "صلُّوا أيُّها الناسُ في بُيوتِكم؛ فإنَّ أفضلَ صلاةِ المرءِ في بيتِه إلَّا الصلاةَ المكتوبةَ"',
          },
        ],
      },
      {
        id: 2,
        title: "صلاة الضحى",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذرٍّ رَضِيَ اللهُ عنه، عنِ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّه قال: "يُصبِحُ على كلِّ سُلامَى من أحدِكم صَدقةٌ؛ فكلُّ تَحميدةٍ صدقةٌ، وكلُّ تهليلةٍ صدقةٌ، وأمْرٌ بالمعروفِ صَدقةٌ، ونهيٌ عن المنكَرِ صدقةٌ، ويُجزِئُ عن ذلك ركعتانِ يَركعُهما من الضُّحَى"',
          },
          {
            id: 2,
            title: 'عن أبي الدَّرداءِ رَضِيَ اللهُ عنه، قال: "أَوْصاني حبيبي بثلاثٍ لنْ أَدَعهنَّ ما عشتُ: بصيامِ ثلاثةِ أيَّامٍ من كلِّ شهرٍ، وصلاةِ الضُّحى، وأنْ لا أنامَ حتى أُوتِرَ"',
          },
          {
            id: 3,
            title: 'عن أبي هُرَيرَة رَضِيَ اللهُ عنه، قال: "أَوْصاني خليلي صلَّى اللهُ عليه وسلَّم بثلاثٍ: صيامِ ثلاثةِ أيَّامٍ من كلِّ شهرٍ، وركعتي الضُّحى، وأنْ أُوتِرَ قبل أن أرقُدَ"',
          },
          {
            id: 4,
            title: 'عن عائشةَ رَضِيَ اللهُ عنها، قالت: "كان رسولُ الله صلَّى اللهُ عليه وسلَّم يُصلِّي الضحى أربعًا، ويَزيد ما شاءَ الله"',
          },
          {
            id: 5,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يُحَافِظُ على صلاةِ الضُّحَى إلا أَوَّابٌ وهي صلاةُ الأَوَّابِينَ"',
          },
        ],
      },
      {
        id: 3,
        title: "قيام الليل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من قامَ بعشرِ آياتٍ لم يُكتب منَ الغافلينَ ومن قامَ بمائةِ آيةٍ كتبَ منَ القانتينَ ومن قامَ بألفِ آيةٍ كتبَ منَ المقنطرينَ"',
          },
          {
            id: 2,
            title: 'عن ابنِ عُمرَ رَضِيَ اللهُ عنهما، أنَّ رجلًا سألَ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم عن صلاةِ اللَّيلِ، فقال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "صلاةُ الليلِ مَثْنَى مَثْنَى، فإذا خشِي أحدُكم الصُّبحَ، صلَّى ركعةً واحدةً تُوتِرُ له ما قدْ صلَّى"',
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "لاَ تدع قيامَ اللَّيلِ فإنَّ رسولَ الله صلى الله عليه وسلم كانَ لاَ يدعُهُ وَكانَ إذا مرضَ أو كسلَ صلَّى قاعدًا"',
          },
          {
            id: 4,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عَنْها، "أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يقومُ من اللَّيل حتى تَتفطَّر قدماه"، فقالت عائشةُ: لِمَ تَصنعُ هذا يا رسولَ اللهِ، وقد غفر اللهُ لك ما تقدَّمَ مِن ذنبِك وما تأخَّر؟! قال: "أفلا أحبُّ أن أكونَ عبدًا شكُورًا؟!"',
          },
          {
            id: 5,
            title: 'عن عبدِ اللهِ بنِ سَلَامٍ رَضِيَ اللهُ عَنْه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "يا أيُّها الناسُ، أفْشُوا السَّلام، وأطْعِموا الطَّعام، وصِلُوا الأرحام، وصَلُّوا باللَّيلِ والناسُ نِيام، تَدخلوا الجَنَّةَ بسَلام"',
          },
          {
            id: 6,
            title: 'وعن أبي مالكٍ الأشعريِّ رَضِيَ اللهُ عَنْه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "إنَّ في الجَنَّةِ غُرفًا يُرى ظاهرُها من باطنِها، وباطنُها من ظاهرِها، أعدَّها اللهُ تعالى لِمَن أَطعَمَ الطَّعام، وأَلانَ الكلام، وتابَع الصِّيام، وأفْشَى السَّلام، وصَلَّى باللَّيلِ والناسُ نِيام"',
          },
          {
            id: 7,
            title: 'عن أبي أُمامةَ الباهليِّ رَضِيَ اللهُ عَنْه، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم: "عَليكم بقِيامِ اللَّيلِ؛ فإنَّه دَأَبُ الصَّالحينَ قَبلَكم، وقُربةٌ لكم إلى ربِّكم، ومَكْفَرَةٌ للسيِّئاتِ، ومَنْهَاةٌ عن الإثمِ"',
          },
          {
            id: 8,
            title: 'عن أَبي هُرَيرَة رَضِيَ اللهُ عَنْه، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "أفضلُ الصَّلاةِ بعدَ الصلاةِ المكتوبةِ، الصلاةُ في جَوفِ الليلِ"',
          },
          {
            id: 9,
            title: 'عن أبي سَلمةَ بنِ عبدِ الرحمنِ أنَّه سألَ عائشةَ رَضِيَ اللهُ عَنْها: كيف كانتْ صلاة رسولِ اللهِ صلَّى اللهُ عليه وسلَّم في رمضان؟ فقالت: "ما كان يَزيدُ في رمضانَ، ولا في غيرِه على إحْدى عَشرةَ ركعةً؛ يُصلِّي أربعَ رَكَعاتٍ فلا تسألْ عن حُسنهنَّ وطولهنَّ، ثم يُصلِّي أربعًا، فلا تسألْ عن حُسنهنَّ وطولهنِّ، ثم يُصلِّي ثلاثًا"',
          },
          {
            id: 10,
            title: 'عن ابنِ عبَّاسٍ رَضِيَ اللهُ عَنْهما قال: "كان صلاةُ النبيِّ صلَّى اللهُ عليه وسلَّم ثلاثَ عَشرةَ ركعةً. يعني: باللَّيل"',
          },
          {
            id: 11,
            title: 'عن عبدِ اللهِ بنِ عُمرَ رَضِيَ اللهُ عَنْهما، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "صلاةُ الليلِ مَثنَى مَثنى، فإذا رأيتَ أنَّ الصبحَ يُدركُك فأَوتِر بواحدةٍ"، قال: فقيل لابن عُمر: ما مَثنَى مَثنَى؟ قال تُسلِّم في كلِّ ركعتينِ',
          },
          {
            id: 12,
            title: 'عن عائشةَ زوجِ النبيِّ صلَّى اللهُ عليه وسلَّم، قالت: "كانَ رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يُصلِّي فيما بين أن يَفرغَ من صلاةِ العِشاءِ - وهي التي يدعو الناسُ العتمةَ - إلى الفجرِ إحْدى عشرةَ ركعةً، يُسلِّمُ بين كلِّ ركعتينِ، ويُوتِرُ بواحدةٍ"',
          },
        ],
      },
      {
        id: 4,
        title: "صلاة التوبة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي بكر رضي الله عنه قال: سَمِعْتُ رسولَ الله صلَّى الله علَيهِ وسلَّمَ يقولُ: "ما مِن عبدٍ يذنبُ ذنبًا، فيُحسنُ الطُّهورَ، ثمَّ يقومُ فيُصلِّي رَكْعتينِ، ثمَّ يستغفِرُ اللَّهَ، إلَّا غفرَ الله لَهُ"، ثمَّ قرأَ هذِهِ الآيةَ: "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ إلى آخرِ الآيةِ"',
          },
        ],
      },
      {
        id: 5,
        title: "صلاة الوتر",
        ahadith: [
         
        ],
      },
      {
        id: 6,
        title: "صلاة الإستخارة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبدالله رضي الله عنه قال: "كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ في الأُمُورِ كُلِّهَا كما يُعَلِّمُنَا السُّورَةَ مِنَ القُرْآنِ؛ يقولُ: إذَا هَمَّ أحَدُكُمْ بالأمْرِ، فَلْيَرْكَعْ رَكْعَتَيْنِ مِن غيرِ الفَرِيضَةِ، ثُمَّ لْيَقُل: اللَّهُمَّ إنِّي أسْتَخِيرُكَ بعِلْمِكَ، وأَسْتَقْدِرُكَ بقُدْرَتِكَ، وأَسْأَلُكَ مِن فَضْلِكَ العَظِيمِ؛ فإنَّكَ تَقْدِرُ ولَا أقْدِرُ، وتَعْلَمُ ولَا أعْلَمُ، وأَنْتَ عَلَّامُ الغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ خَيْرٌ لي في دِينِي ومعاشِي وعَاقِبَةِ أمْرِي - أوْ قالَ: عَاجِلِ أمْرِي وآجِلِهِ - فَاقْدُرْهُ لي ويَسِّرْهُ لِي، ثُمَّ بَارِكْ لي فِيهِ، وإنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ شَرٌّ لي في دِينِي ومعاشِي وعَاقِبَةِ أمْرِي - أوْ قالَ: في عَاجِلِ أمْرِي وآجِلِهِ - فَاصْرِفْهُ عَنِّي واصْرِفْنِي عنْه، واقْدُرْ لي الخَيْرَ حَيْثُ كَانَ، ثُمَّ أرْضِنِي قالَ: «وَيُسَمِّي حَاجَتَهُ»".',
          },
        ],
      },
      {
        id: 7,
        title: "صلاة الجنازة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن شَهِدَ الجَنازَةَ حتَّى يُصَلِّيَ، فَلَهُ قِيراطٌ، ومَن شَهِدَ حتَّى تُدْفَنَ كانَ له قِيراطانِ"، قيلَ: وما القِيراطانِ؟ قالَ: "مِثْلُ الجَبَلَيْنِ العَظِيمَيْنِ"',
          },
        ],
      },
      {
        id: 8,
        title: "صلاة الكسوف والخسوف",
        ahadith: [
          {
            id: 1,
            title: 'عن المغيرة بن شعبة رضي الله عنه قال: كَسَفَتِ الشَّمْسُ علَى عَهْدِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ يَومَ مَاتَ إبْرَاهِيمُ، فَقالَ النَّاسُ: كَسَفَتِ الشَّمْسُ لِمَوْتِ إبْرَاهِيمَ، فَقالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: "إنَّ الشَّمْسَ والقَمَرَ لا يَنْكَسِفَانِ لِمَوْتِ أحَدٍ ولَا لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ فَصَلُّوا، وادْعُوا اللَّهَ"',
          },
        ],
      },
      {
        id: 9,
        title: "صلاة التهجد",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يَنْزِلُ رَبُّنا تَبارَكَ وتَعالَى كُلَّ لَيْلةٍ إلى السَّماءِ الدُّنْيا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ، يقولُ: مَن يَدْعُونِي، فأسْتَجِيبَ له؟ مَن يَسْأَلُنِي فأُعْطِيَهُ؟ مَن يَستَغْفِرُني فأغْفِرَ له؟"',
          },
        ],
      },
      {
        id: 10,
        title: "صلاة الاستسقاء",
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ زيدِ بنِ عاصمٍ، قال: "رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يومًا خرَج يَستسقي، قال: فحوَّل إلى الناسِ ظَهرَه، واستقبل القِبلةَ يَدْعو، ثم حوَّلَ رِداءَه، ثم صلَّى لنا ركعتينِ، جهَر فيهما بالقِراءةِ"',
            source: "صحيح البخاري 1025",
          },
        ],
      },
      {
        id: 11,
        title: "صلاة العيدين",
        ahadith: [
         
        ],
      },
      {
        id: 12,
        title: "المحافظة على قيام الليل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قالَ لي رَسولُ الله صلَّى اللهُ عليه وسلَّمَ: "يا عَبْدَ الله، لا تَكُنْ مِثْلَ فُلانٍ؛ كانَ يَقُومُ اللَّيْلَ، فَتَرَكَ قِيَامَ اللَّيْلِ"',
          },
        ],
      },
    ],
  },
  {
    id: 25,
    title: "سنن في المنزل",
    sunan: [
      {
        id: 1,
        title: "المشي حافيا في المنزل",
        ahadith: [
          {
            id: 1,
            title: "",
          },
        ],
      },
      {
        id: 2,
        title: "الإستئذان قبل الدخول ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الاستئذانُ ثَلاثٌ ، فإن أذنَ لَكَ وإلَّا فارجِعْ"',
          },
        ],
      },
      {
        id: 3,
        title: "صلاة ركعتين عند الخروج من المنزل وعند الدخول",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا خرجتَ من منزلكَ فصلّ ركعتين يمنعانكَ من مخرجِ السوءِ ، وإذا دخلتَ إلى منزلكِ فصلّ ركعتينَ يمنعانكَ من مدخلِ السوءِ"'
          },
        ],
      },
      {
        id: 4,
        title: "الوقوف عن يمين الباب أو شماله",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بسر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تأْتوا البيوتَ من أبوابها ، ولكن ائْتوها من جوانبِها ، فاستأذِنوا فإن أُذِنَ لكم فادْخلوا ، وإلا فارْجِعوا"',
          },
        ],
      },
      {
        id: 5,
        title: "ذكر الله عند دخول المنزل",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ، فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ، قالَ الشَّيْطَانُ: لا مَبِيتَ لَكُمْ، وَلَا عَشَاءَ، وإذَا دَخَلَ، فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ، قالَ الشَّيْطَانُ: أَدْرَكْتُمُ المَبِيتَ، وإذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ، قالَ: أَدْرَكْتُمُ المَبِيتَ وَالْعَشَاءَ. وفي روايةٍ : وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ طَعَامِهِ، وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ دُخُولِهِ."',
          },
        ],
      },
    ],
  },
  {
    id: 26,
    title: "سنن الإغتسال",
    sunan: [
      {
        id: 1,
        title: "البدأ بالوضوء عند الإغتسال",
        ahadith: [
         
        ]
      },
      {
        id: 2,
        title: "غسل اليدين ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ إذَا اغْتَسَلَ مِنَ الجَنَابَةِ، بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كما يَتَوَضَّأُ لِلصَّلَاةِ، ثُمَّ يُدْخِلُ أصَابِعَهُ في المَاءِ، فيُخَلِّلُ بهَا أُصُولَ شَعَرِهِ، ثُمَّ يَصُبُّ علَى رَأْسِهِ ثَلَاثَ غُرَفٍ بيَدَيْهِ، ثُمَّ يُفِيضُ المَاءَ علَى جِلْدِهِ كُلِّهِ"',
            source: "صحيح البخاري 248",
          },
        ]
      },
      {
        id: 3,
        title: "غسل الفرج بالشمال",
        ahadith: [
          {
            id: 1,
            title: 'عن ميمونة بنت الحارث أم المؤمنين رضي الله عنها قالت: "وَضَعْتُ لِرَسولِ الله صَلَّى اللهُ عليه وسلَّمَ غُسْلًا وسَتَرْتُهُ، فَصَبَّ علَى يَدِهِ، فَغَسَلَهَا مَرَّةً أوْ مَرَّتَيْنِ - قالَ: سُلَيْمَانُ لا أدْرِي، أذَكَرَ الثَّالِثَةَ أمْ لَا؟ - ثُمَّ أفْرَغَ بيَمِينِهِ علَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، ثُمَّ دَلَكَ يَدَهُ بالأرْضِ أوْ بالحَائِطِ، ثُمَّ تَمَضْمَضَ واسْتَنْشَقَ، وغَسَلَ وجْهَهُ ويَدَيْهِ، وغَسَلَ رَأْسَهُ، ثُمَّ صَبَّ علَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ خِرْقَةً، فَقالَ بيَدِهِ هَكَذَا، ولَمْ يُرِدْهَا"',
            source: "صحيح البخاري 266",
          },
        ]
      },
    ],
  },
  {
    id: 27,
    title: "سنن العيد",
    sunan: [
      {
        id: 1,
        title: "الذهاب إلى مصلى العيد من طريق، والعودة من طريق آخر",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبدالله رضي الله عنه قال: "كان النبيُّ صلَّى اللهُ عليه وسلَّم إذا كان يومُ العيدِ خالَفَ الطريقَ"',
            source: "صحيح البخاري 986",
          },
        ],
      },
      {
        id: 2,
        title: "الأكل يوم عيد الفطر قبل الذهاب للمصلى",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ لا يَغْدُو يَومَ الفِطْرِ حتَّى يَأْكُلَ تَمَراتٍ. وقال مرجأ بن رجاء...: ويَأْكُلُهُنَّ وِتْرًا"',
            source: "صحيح البخاري 953",
          },
        ],
      },
    ],
  },
  {
    id: 28,
    title: "سنن عن الحيوانات",
    sunan: [
      {
        id: 1,
        title: "عدم سب الديك",
        ahadith: [
          {
            id: 1,
            title: 'عن زيد بن خالد الجهني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تسُبُّوا الدِّيكَ ، فإنَّهُ يُوقِظُ للصلاةِ"',
            source: "الجامع الصغير 9767",
          },
        ]
      },
      {
        id: 2,
        title: "قتل الوزغ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قَتَلَ وزَغًا في أوَّلِ ضَرْبَةٍ كُتِبَتْ له مِئَةُ حَسَنَةٍ، وفي الثَّانِيَةِ دُونَ ذلكَ، وفي الثَّالِثَةِ دُونَ ذلكَ. وفي رواية : في أوَّلِ ضَرْبَةٍ سَبْعِينَ حَسَنَةً"',
            source: "صحيح مسلم 2240",
          },
        ]
      },
      {
        id: 3,
        title: "الرفق بالحيوانات",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "يا عائِشَةُ إنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ، ويُعْطِي علَى الرِّفْقِ ما لا يُعْطِي علَى العُنْفِ، وما لا يُعْطِي علَى ما سِواهُ"',
            source: "صحيح مسلم 2593",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "عُذِّبَتِ امْرَأَةٌ في هِرَّةٍ سَجَنَتْها حتَّى ماتَتْ، فَدَخَلَتْ فيها النَّارَ، لا هي أطْعَمَتْها ولا سَقَتْها، إذْ حَبَسَتْها، ولا هي تَرَكَتْها تَأْكُلُ مِن خَشاشِ الأرْضِ"',
            source: "صحيح البخاري 3482",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "بَيْنما رَجُلٌ يَمْشِي، فاشْتَدَّ عليه العَطَشُ، فَنَزَلَ بئْرًا، فَشَرِبَ مِنْها، ثُمَّ خَرَجَ فإذا هو بكَلْبٍ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ العَطَشِ، فقالَ: لقَدْ بَلَغَ هذا مِثْلُ الذي بَلَغَ بي، فَمَلَأَ خُفَّهُ، ثُمَّ أمْسَكَهُ بفِيهِ، ثُمَّ رَقِيَ، فَسَقَى الكَلْبَ، فَشَكَرَ اللَّهُ له، فَغَفَرَ له"، قالوا: يا رَسولَ الله، وإنَّ لنا في البَهائِمِ أجْرًا؟ قالَ: "في كُلِّ كَبِدٍ رَطْبَةٍ أجْرٌ"',
            source: "صحيح البخاري 2363",
          },
        ]
      },
      {
        id: 4,
        title: "عدم بيع وشراء القطط والكلاب إلا كلاب الصيد",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أن رسولَ اللهِ صلى الله عليه وسلم نهى عن ثمنِ السِّنَّوْرِ ، والكلبِ ، إلا كلبَ صيدٍ."',
            source: "صحيح النسائي 4306",
          },
        ],
      },
      {
        id: 5,
        title: "إطعام وسقي الحيوانات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "بَيْنما رَجُلٌ يَمْشِي، فاشْتَدَّ عليه العَطَشُ، فَنَزَلَ بئْرًا، فَشَرِبَ مِنْها، ثُمَّ خَرَجَ فإذا هو بكَلْبٍ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ العَطَشِ، فقالَ: لقَدْ بَلَغَ هذا مِثْلُ الذي بَلَغَ بي، فَمَلَأَ خُفَّهُ، ثُمَّ أمْسَكَهُ بفِيهِ، ثُمَّ رَقِيَ، فَسَقَى الكَلْبَ، فَشَكَرَ اللَّهُ له، فَغَفَرَ له"، قالوا: يا رَسولَ الله، وإنَّ لنا في البَهائِمِ أجْرًا؟ قالَ: "في كُلِّ كَبِدٍ رَطْبَةٍ أجْرٌ"',
            source: "صحيح البخاري 2363",
          },
        ],
      },
    ],
  },
  {
    id: 29,
    title: "سنن عن الجنازة",
    sunan: [
      {
        id: 1,
        title: "اتباع الجنائز",
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
        ]
      },
      {
        id: 2,
        title: "زيارة القبور",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كنتُ نهيتُكم عن زيارَةِ القبورِ ألا فزورُوها ، فإِنَّها تُرِقُّ القلْبَ ، و تُدْمِعُ العينَ ، وتُذَكِّرُ الآخرةَ ، ولا تقولوا هُجْرًا"',
            source: "صحيح الجامع 4584"
          },
        ],
      },
      {
        id: 3,
        title: "صلاة الجنازة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن شَهِدَ الجَنازَةَ حتَّى يُصَلِّيَ، فَلَهُ قِيراطٌ، ومَن شَهِدَ حتَّى تُدْفَنَ كانَ له قِيراطانِ"، قيلَ: وما القِيراطانِ؟ قالَ: "مِثْلُ الجَبَلَيْنِ العَظِيمَيْنِ"',
            source: "صحيح البخاري 1325",
          },
        ],
      },
      // {
      //   id: 3,
      //   title: "",
      //   ahadith: [
      //     {
      //       id: 1,
      //       title: "",
      //     },
      //   ],
      // },
    ],
  },
  {
    id: 30,
    title: "سنن عن الحج",
    sunan: [
      {
        id: 1,
        title: "الرَّمَل في الطواف",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "كانَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ إذَا طَافَ الطَّوَافَ الأوَّلَ خَبَّ ثَلَاثًا ومَشَى أَرْبَعًا، وكانَ يَسْعَى بَطْنَ المَسِيلِ إذَا طَافَ بيْنَ الصَّفَا والمَرْوَةِ، فَقُلتُ لِنَافِعٍ: أَكانَ عبدُ الله يَمْشِي إذَا بَلَغَ الرُّكْنَ اليَمَانِيَ؟ قالَ: لَا، إلَّا أَنْ يُزَاحَمَ علَى الرُّكْنِ، فإنَّه كانَ لا يَدَعُهُ حتَّى يَسْتَلِمَهُ"',
          },
        ]
      },
    ],
  },
  {
    id: 31,
    title: "سنن صلة الرحم والزيارة",
    sunan: [
      {
        id: 1,
        title: "صلة الرحم",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "الرَّحِمُ شِجْنَةٌ، فمَن وصَلَها وصَلْتُهُ، ومَن قَطَعَها قَطَعْتُهُ"',
            source: "صحيح البخاري 5989",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيَصِلْ رَحِمَهُ، ومَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ"',
            source: "صحيح البخاري 6138",
          },
          {
            id: 3,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليس الواصلُ بالمكافِيءِ ولكنَّ الواصِلَ الذي إذا انقطعتْ رحمُه وصلَها"',
            source: "صحيح الجامع 5385",
          },
        ],
      },
      {
        id: 2,
        title: "التزاور في الله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنَّ رَجُلًا زارَ أخًا له في قَرْيَةٍ أُخْرَى، فأرْصَدَ الله له علَى مَدْرَجَتِهِ مَلَكًا، فَلَمَّا أتَى عليه، قالَ: أيْنَ تُرِيدُ؟ قالَ: أُرِيدُ أخًا لي في هذِه القَرْيَةِ، قالَ: هلْ لكَ عليه مِن نِعْمَةٍ تَرُبُّها؟ قالَ: لا، غيرَ أنِّي أحْبَبْتُهُ في اللهِ عزَّ وجلَّ، قالَ: فإنِّي رَسولُ اللهِ إلَيْكَ بأنَّ اللَّهَ قدْ أحَبَّكَ كما أحْبَبْتَهُ فِيهِ"',
            source: "صحيح مسلم 2567",
          },
        ],
      },
      {
        id: 3,
        title: "الإستئذان قبل الدخول ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الاستئذانُ ثَلاثٌ ، فإن أذنَ لَكَ وإلَّا فارجِعْ"',
            source: "صحيح الترمذي 2690",
          },
        ],
      },
      {
        id: 4,
        title: "الوقوف عن يمين الباب أو شماله",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بسر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تأْتوا البيوتَ من أبوابها ، ولكن ائْتوها من جوانبِها ، فاستأذِنوا فإن أُذِنَ لكم فادْخلوا ، وإلا فارْجِعوا"',
            source: "صحيح الترغيب 2731",
          },
        ],
      },
    ],
  },
  {
    id: 32,
    title: "سنن الفطرة والنظافة",
    sunan: [
      {
        id: 1,
        title: "الختان",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
        ],
      },
      {
        id: 2,
        title: "الاستحداد (حلق شعر العانة)",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 3,
        title: "نتف الإبط",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 4,
        title: "تقليم الأظافر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 5,
        title: "قص الشارب",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
          {
            id: 3,
            title: 'عن عبد الله ابنِ عُمرَ رَضِيَ اللهُ عنهما أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "خَالِفُوا المُشْرِكِينَ؛ وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ". وَكانَ ابنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ علَى لِحْيَتِهِ، فَما فَضَلَ أَخَذَهُ',
            source: "صحيح البخاري 5892",
          },
        ],
      },
      {
        id: 6,
        title: "عدم القزع (حلق بعض الرأس وترك بعض)",
        ahadith: [
          {
            id: 1,
            title: 'عن نافعٍ، عن ابنِ عُمَرَ رضِي الله عنهما: "أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم نهى عن القَزَعِ" قال: قلتُ لنافعٍ: وما القَزَعُ؟ قال: يُحلَقُ بَعضُ رأسِ الصَّبيِّ، ويُترَكُ بَعضٌ',
            source: "",
          },
        ],
      },
      {
        id: 7,
        title: "إعفاء اللحية",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
          {
            id: 2,
            title: 'عن عبد الله ابنِ عُمرَ رَضِيَ اللهُ عنهما أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "خَالِفُوا المُشْرِكِينَ؛ وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ". وَكانَ ابنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ علَى لِحْيَتِهِ، فَما فَضَلَ أَخَذَهُ',
            source: "صحيح البخاري 5892",
          },
        ],
      },
      {
        id: 8,
        title: "السِّواكُ",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 9,
        title: "غَسْلُ البَراجِمِ (مَفاصِلِ الأصابِعِ وعُقَدِها)",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 10,
        title: "إستنشاق الماء",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 11,
        title: "انتقاص الماء (التَّطهُّرُ بالماءِ بعدَ قَضاءِ الحاجَةِ)",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",
          },
        ],
      },
      {
        id: 12,
        title: "المضمضة",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",
          },
        ],
      },
      {
        id: 13,
        title: "عدم تركها لأكثر من أربعين يوما",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "وُقِّتَ لنا في قَصِّ الشَّارِبِ، وتَقْلِيمِ الأظْفارِ، ونَتْفِ الإبِطِ، وحَلْقِ العانَةِ، أنْ لا نَتْرُكَ أكْثَرَ مِن أرْبَعِينَ لَيْلَةً"',
            source: "صحيح مسلم 258",
          },
        ],
      },
    ],
  },
  {
    id: 33,
    title: "سنن طلب العلم",
    sunan: [
      {
        id: 1,
        title: "طلب العلم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من سلك طريقًا يطلبُ فيه علمًا ، سلك اللهُ به طريقًا من طرقِ الجنةِ ، وإنَّ الملائكةَ لتضعُ أجنحتَها رضًا لطالبِ العِلمِ ، وإنَّ العالِمَ ليستغفرُ له من في السماواتِ ومن في الأرضِ ، والحيتانُ في جوفِ الماءِ ، وإنَّ فضلَ العالمِ على العابدِ كفضلِ القمرِ ليلةَ البدرِ على سائرِ الكواكبِ ، وإنَّ العلماءَ ورثةُ الأنبياءِ ، وإنَّ الأنبياءَ لم يُورِّثُوا دينارًا ولا درهمًا ، ورَّثُوا العِلمَ فمن أخذَه أخذ بحظٍّ وافرٍ"',
            source: "صحيح أبي داود 3641 "
          },
        ],
      },
    ],
  },
  {
    id: 34,
    title: "سنن الأذكار",
    sunan: [
      {
        id: 1,
        title: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير 10 مرات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قالَ: "لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، عَشْرَ مِرَارٍ كانَ كَمَن أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِن وَلَدِ إسْمَاعِيلَ"',
            source: "صحيح مسلم 2693",
          },
        ],
      },
      {
        id: 2,
        title: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير 100 مرة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّمَ قالَ: مَن قالَ: "لا إلَهَ إلَّا الله، وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ، وهو علَى كُلِّ شَيءٍ قَدِيرٌ، في يَومٍ مِئَةَ مَرَّةٍ؛ كانَتْ له عَدْلَ عَشْرِ رِقابٍ، وكُتِبَتْ له مِئَةُ حَسَنَةٍ، ومُحِيَتْ عنْه مِئَةُ سَيِّئَةٍ، وكانَتْ له حِرْزًا مِنَ الشَّيْطانِ يَومَهُ ذلكَ حتَّى يُمْسِيَ، ولَمْ يَأْتِ أحَدٌ بأَفْضَلَ ممَّا جاءَ به، إلَّا أحَدٌ عَمِلَ أكْثَرَ مِن ذلكَ."',
            source: "صحيح البخاري 3293",
          },
        ],
      },
      {
        id: 3,
        title: "سُبْحانَ الله وبِحَمْدِهِ 100 مرة في اليوم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قال: "سُبْحانَ الله وبِحَمْدِهِ، في يَومٍ مِائَةَ مَرَّةٍ؛ حُطَّتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ"',
            source: "صحيح البخاري 6405",
          },
        ],
      },
      {
        id: 4,
        title: "التسبيح 100 مرة في اليوم",
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: كُنَّا عِنْدَ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ، فَقالَ: "أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَومٍ أَلْفَ حَسَنَةٍ؟" فَسَأَلَهُ سَائِلٌ مِن جُلَسَائِهِ: كيفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قالَ: "يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ، فيُكْتَبُ له أَلْفُ حَسَنَةٍ، أَوْ يُحَطُّ عنْه أَلْفُ خَطِيئَةٍ"',
            source: "صحيح مسلم 2698",
          },
        ],
      },
      {
        id: 5,
        title: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ 3 مرات",
        ahadith: [
          {
            id: 1,
            title: 'عن جويرية بنت الحارث أم المؤمنين رضي الله عنها قالت: أنَّ النَّبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ مِن عِندِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهي في مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهي جَالِسَةٌ، فَقالَ: ما زِلْتِ علَى الحَالِ الَّتي فَارَقْتُكِ عَلَيْهَا؟ قالَتْ: نَعَمْ، قالَ النَّبيُّ صَلَّى اللَّهُ عليه وَسَلَّمَ: لقَدْ قُلتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لو وُزِنَتْ بما قُلْتِ مُنْذُ اليَومِ لَوَزَنَتْهُنَّ: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ"',
            source: "صحيح مسلم 2726",
          },
        ],
      },
      {
        id: 6,
        title: "سيد الاستغفار",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ. قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ"',
            source: "صحيح البخاري 6306",
          },
        ],
      },
    ],
  },
   // {
  //   id: 29,
  //   title: "",
  //   sunan: [
  //     {
  //       id: 1,
  //       title: "",
  //       ahadith: [
  //         {
  //           id: 1,
  //           title: "",
  //         },
  //       ],
  //     },
  //   ],
  // },
];
