export const data = [
  //done
  {
    id: 1,
    title: "الإسلام",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "كم عدد أركان الإسلام؟",
            options: ["5", "4", "7"],
            answer: "5",
            just: 
              "عدد أركان الإسلام 5."
              + "\n\n" +
              "عن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعتُ رسول الله -صلى الله عليه وسلم- يقول: «بُني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، والحج، وصوم رمضان»"
          },      
          //2
          {
            ques: "كم عدد أركان الإيمان؟",
            options: ["4", "5", "6"],
            answer: "6",
            just:
              "عدد أركان الإسلام 6 وهي:"
              + "\n" +
              "الإيمان بالله"
              + "\n" +
              "الإيمان بالملائكة"
              + "\n" +
              "الإيمان بالكتب السماوية"
              + "\n" +
              "الإيمان بالأنبياء والرسل"
              + "\n" +
              "الإيمان باليوم الآخر"
              + "\n" +
              "الإيمان بالقضاء وبالقدر خيره وشره"
          },
          //3
          {
            ques: "واحد من هذه الاختيارات ليس من سُنن يوم الجمعة فما هو؟",
            options: ["الاغتسال", "التطيّب والسواك", "صلة الرحم"],
            answer: "صلة الرحم",
            just: "صلة الرحم ليست من سنن يوم الجمعة."
          },
          //4
          {
            ques: "ما هي أعظم فتنة تمر على البشريّة؟",
            options: ["المسيح الدجال", "يأجوج ومأجوج", "الدنيا"],
            answer: "المسيح الدجال",
            just: 
              "أعظم فتنة تمر على البشريّة هي المسيح الدجال."
              + "\n" +
              "فعن عمران بن حصين رضي الله عنه قال، سمعت رسول الله صلى الله عليه وسلم يقول: (ما بين خلق آدم إلى قيام الساعة خلق أكبر من الدجال)"
          },
          //5
          {
            ques: 'في أي جهة يقع باب الكعبة المشرفة؟',
            options: [
              "في الجهة الغربية من الكعبة", 
              "في الجهة الجنوبية من الكعبة",
              "في الجهة الشمالية من الكعبة",
              "في الجهة الشرقية من الكعبة",
            ],
            answer: "في الجهة الشرقية من الكعبة",
            just: "يقع باب الكعبة المشرفة في الجهة الشرقية.",
          },    
          //6
          {
            ques: 'أطول الناس أعناقا يوم القيامة؟',
            options: ['المؤذنون', 'الصائمون', 'الصابرون'],
            answer: 'المؤذنون',
            just: 
              "أطول الناس أعناقا يوم القيامة هم المؤذنون."
              + "\n" + 
              "عن معاوية بن أبي سفيان رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: «الْمُؤَذِّنونَ أطولُ الناسِ أعناقًا يومَ القِيامةِ»"
          },   
          //7
          {
            ques: 'من هو أول شخص آمن بالنبي محمد صلى الله عليه وسلم؟',
            options: [
              'أبو بكر الصديق رضي الله عنه', 
              'خديجة بنت خويلد رضي الله عنها', 
              'معاذ بن جبل رضي الله عنه'
            ],
            answer: 'خديجة بنت خويلد رضي الله عنها',
            just: "أول من آمن من النساء والرجال بالنبي محمد صلى الله عليه وسلم هي السيدة خديجة بنت خويلد رضي الله عنها."
          }, 
          //8 
          {
            ques: 'ما هو أول ما يحاسب به العبد يوم القيامة؟',
            options: [
              'الصوم', 
              'الصلاة', 
              'الزكاة', 
            ],
            answer: 'الصلاة', 
            just: 
              "أول ما يحاسب به العبد يوم القيامة هو الصلاة."
              + "\n" +
              "عن أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ الله صَلَّى الله عَلَيْهِ وَسَلَّمَ يَقُولُ : ( إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ مِنْ عَمَلِهِ صَلَاتُهُ فَإِنْ صَلُحَتْ فَقَدْ أَفْلَحَ وَأَنْجَحَ وَإِنْ فَسَدَتْ فَقَدْ خَابَ وَخَسِرَ ، فَإِنْ انْتَقَصَ مِنْ فَرِيضَتِهِ شَيْءٌ قَالَ الرَّبُّ عَزَّ وَجَلَّ : انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَيُكَمَّلَ بِهَا مَا انْتَقَصَ مِنْ الْفَرِيضَةِ ؟ ثُمَّ يَكُونُ سَائِرُ عَمَلِهِ عَلَى ذَلِكَ )"
          }, 
          //9
          {
            ques: "كم عدد الكتب السماوية التي أنزلها الله تعالى؟",
            options: ["1", "2", "3", "4",],
            answer: "1",
            just: "عدد الكتب السماوية التي أنزلها الله تعالى هو 4 كتب، وهي التوراة والإنجيل والزبور والقرآن الكريم."
          },
          //10
          {
            ques: "ما هو المسجد الذي يعتبر أكبر مسجد في العالم؟",
            options: [
              'المسجد الحرام', 
              'المسجد الأقصى', 
              'المسجد النبوي',
            ],
            answer: 'المسجد الحرام', 
            just: "المسجد الذي يعتبر أكبر مسجد في العالم هو المسجد الحرام في مكة المكرمة."
          }
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'ما هي الغزوة التي وقعت في رمضان؟',
            options: ['غزوة بدر', 'غزوة الخندق', 'غزوة بني قينقاع'],
            answer: 'غزوة بدر',
            just: 
              "الغزوة التي وقعت في رمضان هي غزوة بدر الكبرى التي وقعت في صبيحة يوم الجمعة 17 رمضان من العام الثاني للهجرة (2 ه) الموافق ل 13 مارس 624م"
          },   
          //2
          {
            ques: 'ما هي الأرض التي سماها الرسول صلى الله عليه وسلم بأرض الصدق؟',
            options: ['الحبشة', 'مكة', 'المدينة المنورة'],
            answer: 'الحبشة'
          },
          //3
          {
            ques: 'ما اسم خازن جهنم؟',
            options: ['مالك', 'جبرائيل', 'رضوان'],
            answer: 'مالك',
            just: 
              "إسم خازن جهنم هو مالك."
              + "\n" +
              "قال الله تعالى في سورة الزخرف في الآية 77:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُم مَّاكِثُونَ ٧٧۝"
            },
          //4
          {
            ques: "ما هي البسملة؟",
            options: [
              'قول سبحان الله', 
              'قول الله أكبر',
              'قول الحمد لله',
              'قول بسم الله', 
            ],
            answer: 'قول بسم الله', 
            just: "البسملة هي قول بسم الله"
          },
          //5
          {
            ques: 'من هو أول من يقرع باب الجنة في يوم القيامة؟',
            options: [
              'آدم عليه السلام', 
              'جبريل عليه السلام',
              'سيدنا محمد صلى الله عليه وسلم', 
            ],
            answer: 'سيدنا محمد صلى الله عليه وسلم', 
            just: 
              "أول من يقرع باب الجنة يوم القيامة هو سيدنا محمد صلى الله عليه وسلم."
              + "\n" +
              "عن أنس بن مالك قال رسول الله صلى الله عليه وسلم: أنا أكثرُ الأنبياءِ تبعًا يومَ القيامةِ ، و أنا أوَّلُ من يَقرعُ بابَ الجنَّةِ."
          },
          //6
          {
            ques: 'ما هي الحوقلة؟',
            options: [
              'قول بسم الله', 
              'قول سبحان الله', 
              'قول الله أكبر',
              'قول لا حول ولا قوة إلا بالله',
            ],
            answer: 'قول لا حول ولا قوة إلا بالله',
            just: "الحوقلة هي قول لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِالله."
          },
          //7
          {
            ques: 'كلمتان خفيفتان على اللِّسَان ثقيلتان فِي الْمِيزَان حبيبتان إِلَى الرَّحْمَن',
            options: [
              'سبحان الله ولا إله إلا الله',
              'الحمد لله والله أكبر',
              'سبحان الله وبحمده سبحان الله العظيم',
            ],
            answer: 'سبحان الله وبحمده سبحان الله العظيم',
            just: 'عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: "كَلِمَتَانِ خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن: سبحان الله وبحمده، سبحان الله العظيم".'
          },
          //8
          {
            ques: 'كم عدد أسماء الله الحسنى المعروفة؟',
            options: ['100', '99', '90'],
            answer: '99',
            just: 
              "عدد أسماء الله المعروفة هي 99 اسما."
              + "\n" +
              "قال رسول الله صلى الله عليه وسلم: «إنَّ للهِ تعالى تسعةً و تسعين اسمًا مائةً إلا واحدًا ، من أحصاها دخل الجنَّةَ»"
          },
          //9
          {
            ques: 'كم عدد أبواب الجنة؟',
            options: ['8', '7', '6', '5',],
            answer: '8',
            just: 
              "عدد أبواب الجنة 8."
              + "\n" +
              "قال رسول الله صلى الله عليه وسلم: (فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ)"
          },
          //10
          {
            ques: 'كم عدد أبواب جهنم؟',
            options: ['8', '7', '6', '5'],
            answer: '7',
            just: 
              "عدد أبواب جهنم 7."
              + "\n" +
              "قال الله عز وجل في سورة الحجر في الآية 43 و 44:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ ٣٤۝ لَهَا سَبْعَةُ أَبْوَابٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ ٤٤۝"
          },
        ],
      },
    ],
  },



  //done
  {
    id: 2,
    title: "القرآن الكريم",
    img: require("./assets/Quran.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "ما إسم السورة التي في بدايتها ونهايتها تسبيح؟",
            options: [
              "سورة الحشر",
              "سورة النور",
              "سورة الرحمن",
              "سورة الملك"
            ],
            answer: "سورة الحشر",
            just: 
              "السورة التي في بدايتها ونهايتها تسبيح هي سورة الحشر." 
              + "\n\n" + 
              "قال الله تعالى في سورة الحشر في الآية 1 و 24:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "سَبَّحَ للهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ١۝"
              + "\n\n" +
              "هُوَ ٱللهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤٢۝",
          },      
          //2
          {
            ques: "ما هي أطول سورة في القرآن الكريم؟",
            options: [
              "سورة آل عمران",
              "سورة الأعراف",
              "سورة الشعراء",
              "سورة البقرة",
            ],
            answer: "سورة البقرة",
            just: 
              "أطول سورة في القرآن الكريم هي سورة البقرة." 
              + "\n" + 
              "عدد آياتها: 286"
              + "\n" + 
              "عدد كلماتها: 6144" 
              + "\n" + 
             "عدد حروفها: 25613"
          },
          //3
          {
            ques: "ما هي أصغر سورة في القرآن الكريم؟",
            options: [
              "سورة الإخلاص", 
              "سورة الكوثر", 
              "سورة العصر",
            ],
            answer: "سورة الكوثر",
            just: 
              "أصغر سورة في القرآن الكريم هي سورة الكوثر."
              + "\n" + 
              "عدد آياتها: 3"
              + "\n" + 
              "عدد كلماتها: 10"
              + "\n" + 
              "عدد حروفها: 42",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ ١۝ فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ ٢۝ إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ ٣۝"
          },
          //4
          {
            ques: "ما هي السورة التي ذكر فيها شهر رمضان؟",
            options: [
              "سورة البقرة", 
              "سورة الأنعام", 
              "سورة المائدة", 
              "سورة النساء",
            ],
            answer: "سورة البقرة",
            just:
              "السورة التي ذكر فيها شهر رمضان هي سورة البقرة في الآية 185:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ٥٨١۝"
          },   
          //5   
          {
            ques: "ما هي السورة التي ذكر فيها الله في كل آياتها؟",
            options: [
              "سورة الأنفال", 
              "سورة المجادلة", 
              "سورة التوبة",
              "سورة يونس",
            ],
            answer: "سورة المجادلة",
            just: "السورة التي ذكر فيها الله في كل آياتها هي سورة المجادلة، حيث ذكرت كلمة الله في كل من الواحد والعشرين آية.",
          },
          //6
          {
            ques: "ما هي السورة التي فيها سجدتين؟",
            options: [
              "سورة يوسف",
              "سورة الرعد",
              "سورة هود",
              "سورة الحج",
            ],
            answer: "سورة الحج",
            just: "السورة التي فيها سجدتين هي سورة الحج، في الآية 18 والآية 77:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِّنَ النَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ ۗ وَمَن يُهِنِ اللَّهُ فَمَا لَهُ مِن مُّكْرِمٍ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ۩ ٨١۝"
              + "\n\n" + 
              "يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ ۩ ٧٧۝"
          },
          //7
          {
            ques: "ما هي السورة التي لا يوجد فيها حرف الميم ؟",
            options: [
              "سورة إبراهيم", 
              "سورة النحل", 
              "سورة الكوثر", 
              "سورة الحجر",
            ],
            answer: "سورة الكوثر",
            just: "السورة التي لا يوجد فيها حرف الميم هي سورة الكوثر.", 
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ ١۝ فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ ٢۝ إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ ٣۝"
          },      
          //8
          {
            ques: "من أكثر نبي ذكر في القرآن الكريم؟",
            options: [
              "آدم عليه السلام", 
              "عيسى عليه السلام", 
              "موسى عليه السلام", 
              "محمد صلى الله عليه وسلم",
            ],
            answer: "موسى عليه السلام",
            just: 'أكثر نبي ذكر في القرآن الكريم هو موسى عليه السلام حيث ذكر إسم "موسى" 136 مرة في القرآن الكريم.'
          },  
          //9    
          {
            ques: "كم عدد سور القرآن الكريم؟",
            options: [
              "114", 
              "113", 
              "115",
              "112",
            ],
            answer: "114",
            just: "عدد سور القرآن الكريم 114 سورة." 
          },   
          //10   
          {
            ques: "أول نبي ذُكرت قصته في القرآن الكريم",
            options: [
              "هود عليه السلام", 
              "نوح عليه السلام", 
              "آدم عليه السلام",
            ],
            answer: "آدم عليه السلام",
            just: "أول نبي ذكرت قصته في القرآن هو آدم عليه السلام.",
          }, 
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'ما هي أعظم آية في القرآن الكريم؟',
            options: ['آية الدين', 'آية الكرسي'],
            answer: 'آية الكرسي',
            just: 
              "أعظم آية في القرآن الكريم هي آية الكرسي وهي الآية 255 من سورة البقرة:", 
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "ٱللهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢۝"
          },
          //2
          {
            ques: "ما هي السورة التي لا تبدأ بالبسملة؟",
            options: [
              "سورة التوبة", 
              "سورة الأنبياء", 
              "سورة المؤمنون",
              "سورة النور",
            ],
            answer: "سورة التوبة",
            just: 
              "السورة الوحيدة التي لا تبدأ بالبسملة هي سورة التوبة، حيث تبدأ سورة التوبة هكذا:",
            justVerse: 
              "بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ ١۝"
          },
          //3
          {
            ques: "ما هي السورة التي تعدل ثلث القرآن؟",
            options: [
              "سورة الشعراء", 
              "سورة الفرقان", 
              "سورة الإخلاص",
              "سورة البقرة", 
            ],
            answer: "سورة الإخلاص",
            just: "السورة التي تعدل ثلث القرآن هي سورة الإخلاص, حيث أخبر رسول الله صلى الله عليه وسلم في العديد من أحاديثه أنّ قراءة سورة الإخلاص تعدل ثلث القرآن، ومن هذه الأحاديث ما يأتي:"
              + "\n\n" + 
              "ما ثبت عن أبي سعيد الخدري رضي الله عنه قال: (أنَّ رَجُلًا سَمِعَ رَجُلًا يَقْرَأُ {قُلْ هُوَ اللَّهُ أَحَدٌ} يُرَدِّدُها، فَلَمَّا أصْبَحَ جاءَ إلى رَسولِ اللَّهِ صلى الله عليه وسلم، فَذَكَرَ ذلكَ له، وكَأنَّ الرَّجُلَ يَتَقالُّها، فقالَ رَسولُ اللَّهِ صلى الله عليه وسلم: والذي نَفْسِي بيَدِهِ، إنَّها لَتَعْدِلُ ثُلُثَ القُرْآنِ)."
              + "\n\n" + 
              "قول رسول الله صلى الله عليه وسلم: (احْشُدُوا، فإنِّي سَأَقْرَأُ علَيْكُم ثُلُثَ القُرْآنِ، فَحَشَدَ مَن حَشَدَ، ثُمَّ خَرَجَ نَبِيُّ اللهِ صلى الله عليه وسلم، فَقَرَأَ: {قُلْ هو اللَّهُ أحَدٌ}، ثُمَّ دَخَلَ، فقالَ بَعْضُنا لِبَعْضٍ: إنِّي أُرَى هذا خَبَرٌ جاءَهُ مِنَ السَّماءِ فَذاكَ الذي أدْخَلَهُ، ثُمَّ خَرَجَ نَبِيُّ اللهِ صلى الله عليه وسلم، فقالَ: إنِّي قُلتُ لَكُمْ سَأَقْرَأُ علَيْكُم ثُلُثَ القُرْآنِ، ألا إنَّها تَعْدِلُ ثُلُثَ القُرْآنِ)",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "قُلْ هُوَ اللهُ أَحَدٌ ١۝ اللهُ الصَّمَدُ ٢۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ٣۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ٤۝"
          }, 
          //4
          {
            ques: "كم عدد المرات التي ذكر فيها إسم النبي موسى عليه السلام في سورة البقرة؟",
            options: [
              "10", 
              "11", 
              "12",
              "13",
            ],
            answer: "13",
            just: "عدد المرات التي ذكر فيها إسم النبي موسى عليه السلام في سورة البقرة هو 13 مرة."
              + "\n" +
              "ذكر إسم النبي موسى عليه السلام في هذه الآيات: 51, 53, 54, 55, 60, 61, 67, 87, 92, 108, 136, 246, 248."
          },   
          //5 
          {
            ques: "ما هي السورة التي ذكرت فيها البسملة مرتين ؟",
            options: [
              "سورة الأنعام", 
              "سورة التوبة", 
              "سورة النمل",
              "سورة لقمان",
            ],
            answer: "سورة النمل",
            just: 
              "السورة التي ذكرت فيها البسملة مرتين هي سورة النمل، حيث توجد البسملة في بداية السورة وفي وسطها في الآية 30:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "طسٓ ۚ تِلْكَ آيَاتُ الْقُرْآنِ وَكِتَابٍ مُّبِينٍ ١۝"
              + "\n\n" + 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "إِنَّهُ مِنْ سُلَيْمَانَ وَإِنَّهُ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ٠٣۝"
          },
          //6
          {
            ques: "في أي شهر نزل القرآن الكريم؟",
            options: ["رجب", "رمضان", "شعبان"],
            answer: "رمضان",
            just: 
              // "نزل القرآن الكريم في شهر رمضان، حيث قال الله تعالى في سورة البقرة في الآية 185:"
              "نزل القرآن الكريم في شهر رمضان، حيث قال الله تعالى في سورة القدر في الآية 1, وفي سورة الدخان من الآية 1 إلى 3, وفي سورة البقرة في الآية 185:",
             justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ ١۝"
              + "\n\n" + 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "حم ١۝ وَالْكِتَابِ الْمُبِينِ ٢۝ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ ٣۝"
              + "\n\n" + 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ٥٨١۝"
          },
          //7
          {
            ques: 'كم مرة ذكر شهر رمضان في القرآن الكريم؟',
            options: ['مرة', 'مرتان', 'خمسة مرات'],
            answer: 'مرة',
            just: "ذكر شهر رمضان مرة واحدة في القرآن الكريم في سورة البقرة في الآية 185:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ٥٨١۝"
          }, 
          //8
          {
            ques: 'ما هما المسجدان اللذان تم ذكرهما في نفس الآية؟',
            options: [
              'المسجد الحرام والأقصى', 
              'المسجد الحرام والنبوي', 
              'المسجد الأقصى والنبوي',
            ],
            answer: 'المسجد الحرام والأقصى', 
            just: "المسجدان اللذان تم ذكرهما في نفس الآية هما المسجد الحرام والأقصى، حيث ذكرا في سورة الإسراء في الآية 1:",
            justVerse: 
            "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
            + "\n" + 
            "سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا ۚ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ ١۝"
          },
          //9
          {
            ques: 'ما هي السورة التي فيها تقسيم الميراث؟',
            options: [
              'سورة يس', 
              'سورة النساء', 
              'سورة الصافات',
              'سورة ص',
            ],
            answer: 'سورة النساء',
            just: "السورة التي فيها تقسيم الميراث هي سورة النساء."
          },
          //10
          {
            ques: 'ما هي أطول آية في القرآن الكريم؟',
            options: ['آية الدين', 'آية الكرسي'],
            answer: 'آية الدين',
            just: 
              "أطول آية في القرآن الكريم هي آية الدين وهي الآية 282 من سورة البقرة:", 
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰ أَجَلٍ مُّسَمًّى فَاكْتُبُوهُ ۚ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌ بِالْعَدْلِ ۚ وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ اللهُ ۚ فَلْيَكْتُبْ وَلْيُمْلِلِ الَّذِي عَلَيْهِ الْحَقُّ وَلْيَتَّقِ اللَّهَ رَبَّهُ وَلَا يَبْخَسْ مِنْهُ شَيْئًا ۚ فَإِن كَانَ الَّذِي عَلَيْهِ الْحَقُّ سَفِيهًا أَوْ ضَعِيفًا أَوْ لَا يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُ بِالْعَدْلِ ۚ وَاسْتَشْهِدُوا شَهِيدَيْنِ مِن رِّجَالِكُمْ ۖ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَامْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ الشُّهَدَاءِ أَن تَضِلَّ إِحْدَاهُمَا فَتُذَكِّرَ إِحْدَاهُمَا الْأُخْرَىٰ ۚ وَلَا يَأْبَ الشُّهَدَاءُ إِذَا مَا دُعُوا ۚ وَلَا تَسْأَمُوا أَن تَكْتُبُوهُ صَغِيرًا أَوْ كَبِيرًا إِلَىٰ أَجَلِهِ ۚ ذَٰلِكُمْ أَقْسَطُ عِندَ اللهِ وَأَقْوَمُ لِلشَّهَادَةِ وَأَدْنَىٰ أَلَّا تَرْتَابُوا ۖ إِلَّا أَن تَكُونَ تِجَارَةً حَاضِرَةً تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلَّا تَكْتُبُوهَا ۗ وَأَشْهِدُوا إِذَا تَبَايَعْتُمْ ۚ وَلَا يُضَارَّ كَاتِبٌ وَلَا شَهِيدٌ ۚ وَإِن تَفْعَلُوا فَإِنَّهُ فُسُوقٌ بِكُمْ ۗ وَاتَّقُوا اللَّهَ ۖ وَيُعَلِّمُكُمُ اللهُ ۗ وَاللهُ بِكُلِّ شَيْءٍ عَلِيمٌ ٢٨٢۝"
          },
        ],
      },
      {
        title: "إختبار 3",
        id: 3,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "ما اسم الجبلين اللذين تم ذكرهما في نفس الآية؟",
            options: [
              "الصفا والمروة", 
              "الطور وعرفات", 
            ],
            answer: "الصفا والمروة", 
            just:
              "إسم الجبلين اللذين تم ذكرهما في نفس الآية هما الصفا والمروة."
              + "\n\n" + 
             "قال الله تعالى في سورة البقرة في الآية 158:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "۞ إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا ۚ وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ ٨٥١۝"
          },
          //2
          {
            ques: 'في أي سورة ذكر الغراب في القرآن الكريم؟',
            options: [
              'سورة الزخرف', 
              'سورة المائدة', 
              'سورة الدخان',
              'سورة غافر',
            ],
            answer: 'سورة المائدة',
            just: 
              "ذكر الغراب في سورة المائدة في الآية 31:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "فَبَعَثَ اللهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ ۚ قَالَ يَا وَيْلَتَا أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي ۖ فَأَصْبَحَ مِنَ النَّادِمِينَ ١٣۝"
          },
          //3
          {
            ques: 'ما هي السورة التي ورد فيها لفظ البصل في القرآن الكريم؟',
            options: [
              'سورة البقرة', 
              'سورة آل عمران', 
              'سورة المائدة',
            ],
            answer: 'سورة البقرة',
            just: "السورة التي ورد فيها لفظ البصل في القرآن الكريم هي سورة البقرة في الآية 61:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ مِن بَقْلِهَا وَقِثَّائِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَىٰ بِالَّذِي هُوَ خَيْرٌ ۚ اهْبِطُوا مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَاءُوا بِغَضَبٍ مِّنَ اللهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا يَكْفُرُونَ بِآيَاتِ اللهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ الْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا وَّكَانُوا يَعْتَدُونَ ١٦۝"
          },
          //4
          {
            ques: 'كم عدد آيات السجود في القرآن الكريم؟',
            options: ['10', '14', '15', "20"],
            answer: '15',
            just: 
              "عدد آيات السجود في القرآن الكريم هو 15."
              + "\n" + 
              " آيات السجود هي:"
                + "\n" + 
              " سورة الأعراف الآية 206"
                + "\n" + 
              " سورة الرعد الآية 15"
                + "\n" + 
              " سورة النحل من الآية 49 إلى 50"
                + "\n" + 
              " سورة الإسراء من الآية 107 إلى 109"
                + "\n" + 
              " سورة مريم الآية 58"
                + "\n" + 
              " سورة الحج الآية 18"
                + "\n" + 
              " سورة الحج الآية 88"
                + "\n" + 
              " سورة الفرقان الآية 60"
                + "\n" + 
              " سورة النمل من الآية 25 إلى 26"
                + "\n" + 
              " سورة السجدة الآية 15"
                + "\n" + 
              " سورة ص الآية 24"
                + "\n" + 
              " سورة فصلت من الآية 37 إلى 38"
                + "\n" + 
              " سورة النجم الآية 62"
                + "\n" + 
              " سورة الإنشقاق الآية 21"
                + "\n" + 
              " سورة العلق الآية 19"
          },
          //5
          {
            ques: 'ما هي السورة التي تخلو تماما من حرف الراء وجميع آياتها تنتهي بحرف الدال؟',
            options: ['سورة المسد', 'سورة العصر', 'سورة النصر', 'سورة الإخلاص'],
            answer: 'سورة الإخلاص',
            just: "السورة التي تخلو تماما من حرف الراء وجميع آياتها تنتهي بحرف الدال هي سورة الإخلاص.",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "قُلْ هُوَ اللهُ أَحَدٌ ١۝ اللهُ الصَّمَدُ ٢۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ٣۝ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ٤۝"
          },
          //6
          {
            ques: 'كم مرة تم فيها ذكر حيوان "العجل" في سورة البقرة؟',
            options: [
              '4 مرات',
              '6 مرات',
              '3 مرات',
            ],
            answer: '4 مرات',
            just: 'تم ذكر حيوان "العجل" في سورة البقرة أربع مرات، في الآيات 51، 54, 92, 93.',
          },
          //7
          {
            ques: 'كم مرة تم فيها ذكر حيوان "العجل" في القرآن الكريم؟',
            options: [
              '4 مرات',
              '6 مرات',
              '3 مرات'
            ],
            answer: '6 مرات',
            just: 'تم ذكر حيوان "العجل" في القرآن الكريم ست مرات، أربع مرات في سورة البقرة في الآيات 51 و 54 و 92 و 93، ومرة في سورة النساء في الآية 153، ومرة في سورة الأعراف في الآية 152.'
          },
          //8
          {
            ques: 'كم عدد حملة العرش كما ذكر في القرآن الكريم؟',
            options: [
              '8',
              '4',
              '7',
              '6'
            ],
            answer: '8',
            just: 
              "عدد حملة العرش كما ذكر في القرآن الكريم هو 8." 
              + "\n" +
              "قال الله عز وجل في سورة الحاقة الآية 17:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَالْمَلَكُ عَلَىٰ أَرْجَائِهَا ۚ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ ٧١۝"
          },
          //9
          {
            ques: 'ما أول رقم تم ذكره في القرآن الكريم ؟',
            options: [
              '7',
              '1',
              '5'
            ],
            answer: '7',
            just: "أول رقم تم ذكره في القرآن الكريم هو الرقم 7 حيث ذكر في سورة البقرة في الآية 29:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ ۚ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ ٩٢۝"
          },
          //10
          {
            ques: 'ما هي الألوان التي تم ذكرها في سورة البقرة ؟',
            options: [
              'اللون الأسود والأصفر والأبيض.',
              'اللون الأسود والأحمر والأبيض.',
              'اللون الأسود والأزرق والأبيض.',
            ],
            answer: 'اللون الأسود والأصفر والأبيض.',
            just: 
              "الألوان التي تم ذكرها في سورة البقرة هي الأسود والأصفر والأبيض."
              + "\n\n" + 
              "ذكر اللون الأصفر في الآية 69، واللون الأسود والأبيض في الآية 187:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ النَّاظِرِينَ ٩٦۝"
              + "\n\n" + 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ ۚ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ ۗ عَلِمَ اللهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ ۖ فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللهُ لَكُمْ ۚ وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ ۖ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ ۚ وَلَا تُبَاشِرُوهُنَّ وَأَنتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ ۗ تِلْكَ حُدُودُ اللهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ ٧٨١۝"
          },
        ],
      }
    ],
  },



  //done
  {
    id: 3,
    title: "الرسول ﷺ",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "متى ولد النبي محمد صلى الله عليه وسلم؟",
            options: [
              "يوم الإثنين 12 ربيع الأول",
              "يوم الجمعة 17 رمضان",
              "يوم الأحد 27 رجب",
              "يوم الأربعاء 22 صفر"
            ],
            answer: "يوم الإثنين 12 ربيع الأول",
            just: "ولد النبي محمد صلى الله عليه وسلم يوم الإثنين 12 ربيع الأول."
          },      
          //2
          {
            ques: 'ما اسم العام الذي ولد فيه رسول الله صلى الله عليه وسلم؟',
            options: [
              'عام الحزن', 
              'عام الفتح',
              'عام الفيل', 
            ],
            answer: 'عام الفيل',
            just: "إسم العام الذي ولد فيه رسول الله صلى الله عليه وسلم هو عام الفيل."
          },  
          //3
          {
            ques: "أين ولد الرسول محمد صلى الله عليه وسلم؟",
            options: [
              'مكة المكرمة',
              'المدينة المنورة',
            ],
            answer: 'مكة المكرمة',
            just: "ولد الرسول محمد صلى الله عليه وسلم في مكة المكرمة."
          },     
          // 4 
          {
            ques: 'كم كان عمر النبي عندما بعث؟',
            options: ['20', '30', '40', "50"],
            answer: '40',
            just: "كان عمر النبي محمد صلى الله عليه وسلم عندما بعث 40 عاما."
          },
          //5
          {
            ques: 'في أي بيت من بيوت زوجات رسول الله صلى الله عليه وسلم توفي؟',
            options: [
              'عائشة بنت أبي بكر رضي الله عنها', 
              'سودة بنت زمعة رضي الله عنها',
              'أم حبيبة رضي الله عنها',
              'حفصة بنت عمر بن الخطاب رضي الله عنها'
            ],
            answer: 'عائشة بنت أبي بكر رضي الله عنها',
            just: "توفي رسول الله صلى الله عليه وسلم في بيت زوجته السيدة عائشة بنت أبي بكر رضي الله عنها."
          },
          //6
          {
            ques: "من هى أم النبي صلى الله عليه وسلم؟",
            options: ["حليمة السعدية", "آمنة بنت وهب"],
            answer: "آمنة بنت وهب",
            just: "أم النبي صلى الله عليه وسلم هي آمنة بنت وهب."
          },
          //7
          {
            ques: "من هو أب النبي صلى الله عليه وسلم؟",
            options: [
              "أبو طالب بن عبد المطلب",
              "عبد الله بن عبد المطلب",
              "حمزة بن عبد المطلب",
              "العباس بن عبد المطلب",
            ],
            answer: "عبد الله بن عبد المطلب",
            just: "أب النبي صلى الله عليه وسلم هو عبد الله بن عبد المطلب."
          },  
          //8
          {
            ques: "من هي أكبر بنات رسول الله صلى الله عليه وسلم؟",
            options: [
              "فاطمة الزهراء رضي الله عنها",
              "رقية رضي الله عنها",
              "أم كلثوم رضي الله عنها ",
              "زينب رضي الله عنها",
            ],
            answer: "زينب بنت محمد",
            just: "أكبر بنات رسول الله صلى الله عليه وسلم هي زينب رضي الله عنها"
          },
          //9
          {
            ques: "كم عدد أبناء الرسول صلى الله عليه وسلم؟",
            options: ["3", "4", "7"],
            answer: "7",
            just: 
              "عدد أولاد الرسول محمد صلى الله عليه وسلم هو 7 أولاد، 3 أبناء و 4 بنات."
              + "\n" +
              "الأبناء 3 وهم:"
              + "\n" +
              "القاسم رضي الله عنه"
              + "\n" +
              "عبد الله رضي الله عنه"
              + "\n" +
              "إبراهيم رضي الله عنه"
              + "\n" +
              "البنات 4 وهن:"
              + "\n" +
              "زينب رضي الله عنها"
              + "\n" +
              "رقية رضي الله عنها"
              + "\n" +
              "أم كلثوم رضي الله عنها"
              + "\n" +
              "فاطمة الزهراء رضي الله عنها"
          },  
          //10    
          {
            ques: "ما إسم الغزوة التي جرح فيها النبي محمد صلى الله عليه وسلم؟",
            options: ["غزوة بدر", "غزوة الخندق", "غزوة أحد"],
            answer: "غزوة أحد",
            just: "الغزوة التي جرح فيها النبي محمد صلى الله عليه وسلم هي غزوة بدر."
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "من هي من بنات رسول الله صلى الله عليه وسلم أشبه بالرسول؟",
            options: [
              "فاطمة الزهراء رضي الله عنها", 
              "زينب رضي الله عنها", 
              "رقية رضي الله عنها", 
              "أم كلثوم رضي الله عنها",
            ],
            answer: "فاطمة الزهراء رضي الله عنها",
            just: 
              "فاطمة الزهراء رضي الله عنها هي التي أشبه بأبيها الرسول محمد صلى الله عليه وسلم."
              + "\n\n" +
              "قالت عائشة رضي الله عنها: ما رأيتُ أحدًا كانَ أشبَه سمتًا وَهديًا ودلًّا برسولِ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ من فاطمةَ كانت إذا دخلت عليهِ قامَ إليها فأخذَ بيدِها وقبَّلَها وأجلسَها في مجلسِه وَكانَ إذا دخلَ عليها قامت فأخذت بيدِه فقبَّلتهُ وأجلستهُ في مجلسِها"
          },
          //2
          {
            ques: 'ما هو الملجأ الذي اتخذه الرسول صلى الله عليه وسلم مكانا سريا من أجل الدعوة في مكة؟',
            options: [
              'غار حراء',
              'دار الأرقم بن أبي الأرقم',
            ],
            answer: 'دار الأرقم بن أبي الأرقم',
            just: "الملجأ الذي اتخذه الرسول صلى الله عليه وسلم مكانا سريا من أجل الدعوة في مكة هو دار الأرقم بن أبي الأرقم."
          },
          //3
          {
            ques: 'من هي أول من تزوجها الرسول صلى الله عليه وسلم؟',
            options: [
              'خديجة بنت خويلد رضي الله عنها',
              'سودة بنت زمعة رضي الله عنها',
              'عائشة بنت أبي بكر رضي الله عنها',
              'حفصة بنت عمر بن الخطاب رضي الله عنها',
            ],
            answer: 'خديجة بنت خويلد رضي الله عنها',
            just: "أول من تزوجها الرسول صلى الله عليه وسلم هي السيدة خديجة بنت خويلد رضي الله عنها."
          },
          //4
          {
            ques: 'كم كان عمر السيدة خديجة بنت خويلد رضي الله عنها حين تزوجت الرسول صلى الله عليه وسلم؟',
            options: [
              '20 عاما',
              '30 عاما',
              '40 عاما',
              '50 عاما',
            ],
            answer: '40 عاما',
            just: "كان عمر السيدة خديجة بنت خويلد رضي الله عنها 40 عاما حين تزوجت الرسول محمد صلى الله عليه وسلم."
          },
          //5
          {
            ques: 'كم كان عمر النبي صلى الله عليه وسلم حينما تزوج السيدة خديجة بنت خويلد رضي الله عنها؟',
            options: [
              '20 عاما',
              '25 عاما',
              '30 عاما',
              '35 عاما',
            ],
            answer: '25 عاما',
            just: "كان عمر النبي صلى الله عليه وسلم حينما تزوج السيدة خديجة بنت خويلد رضي الله عنها 25 عاما"
          },
          //6
          {
            ques: 'من هو الذي تولى رعاية النبي صلى الله عليه وسلم عندما كان طفلاً؟',
            options: [
              'عمه العباس بن عبد المطلب',
              'عمه حمزة بن عبد المطلب',
              'جده عبد المطلب',
            ],
            answer: 'جده عبد المطلب',
            just: "الذي تولى رعاية النبي صلى الله عليه وسلم عندما كان طفلاً هو جده عبد المطلب."
          },
          //7
          {
            ques: 'من هو الذي سمى النبي محمد صلى الله عليه وسلم؟',
            options: [
              'أمه آمنة بنت وهب',
              'أبوه عبد الله بن عبد المطلب',
              'جده عبد المطلب',
              'عمه حمزة بن عبد المطلب',
            ],
            answer: 'جده عبد المطلب',
            just: "الذي سمى النبي محمد صلى الله عليه وسلم هو جده عبد المطلب."
          },
          //8
          {
            ques: 'من هو أول أعمام النبي إسلاما؟',
            options: [
              'حمزة بن عبد المطلب',
              'العباس بن عبد المطلب'
            ],
            answer: 'حمزة بن عبد المطلب',
            just: "أول أعمام النبي إسلاما هو حمزة بن عبد المطلب."
          },
          //9
          {
            ques: 'كم عدد عمات النبي صلى الله عليه وسلم؟',
            options: [
              '6',
              '4',
              '8',
              '2'
            ],
            answer: '6',
            just: 
              "عدد عمات النبي صلى الله عليه وسلم هو 6 وهن:"
              + "\n" +
              "صفيّة"
              + "\n" +
              "أمّ حكيم البيضاء"
              + "\n" +
              "عاتكة"
              + "\n" +
              "أميمة"
              + "\n" +
              "أروى"
              + "\n" +
              "برّة"
          },
          //10
          {
            ques: 'كم عدد خالات النبي صلى الله عليه وسلم؟',
            options: ['1', '2', '3', '4'],
            answer: '2',
            just: 
              "عدد خالات النبي محمد صلى الله عليه وسلم هو 2 وهن:"
              + "\n" +
              "فاختة بنت عمرو الزهرية"
              + "\n" +
              "الفريعة بنت وهب الزهرية"
          },
        ],
      },
    ],
  },



  {
    id: 4,
    title: "الأنبياء والرسل",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'من هو الذي يقتل المسيح الدجال؟',
            options: [
              'عيسى عليه السلام', 
              'موسى عليه السلام',
              "محمد صلى الله عليه وسلم",
              'ذو الكفل عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: "الذي يقتل المسيح الدجال هو النبي عيسى عليه السلام."
              + "\n\n" +
              "عن أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ صلى اللهُ عليه وسلم: (وَالَّذِي نَفْسِي بِيَدِهِ، لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمْ ابْنُ مَرْيَمَ حَكَمًا عَدْلًا، فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الخِنْزِيرَ، وَيَضَعَ الجِزْيَةَ، وَيَفِيضَ المَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ، حَتَّى تَكُونَ السَّجْدَةُ الوَاحِدَةُ خَيْرًا مِنَ الدُّنْيَا وَمَا فِيهَا. ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: وَاقْرَءُوا إِنْ شِئْتُمْ: (وَإِنْ مِنْ أَهْلِ الكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ، وَيَوْمَ القِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا))."
          },
          //2
          {
            ques: "من هو أول رسول أُرسِل إلى الأرض؟",
            options: [
              "إدريس عليه السلام", 
              "محمد صلى الله عليه وسلم",
              "نوح عليه السلام",
              "هود عليه السلام",
            ],
            answer: "نوح عليه السلام",
            just: 
              'أول رسول أُرسِل إلى الأرض هو نوح عليه السلام.'
          },
          //3
          {
            ques: "إلى من أرسل النبي صالح عليه السلام؟",
            options: ["قوم مدين", "قوم ثمود", "قوم عاد", "قوم فرعون",],
            answer: "قوم ثمود",
            just: 
              "أرسل النبي صالح عليه السلام إلى قوم ثمود."
              + "\n\n" +
              "قال الله عز وجل في سورة الأعراف في الآية 73:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ ٣٧۝",
          },
          //4
          {
            ques: "من هو النبي الذي بُعث إلى قوم مدين؟",
            options: [
              "هود عليه السلام", 
              "شعيب عليه السلام", 
              "موسى عليه السلام",
              "اليسع عليه السلام",
            ],
            answer: "شعيب عليه السلام",
            just: 
              "النبي الذي بُعث إلى قوم مدين هو شعيب عليه السلام."
              + "\n\n" +
              "قال الله عز وجل في سورة الأعراف في الآية 85:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ فَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ ٥٨۝"
          }, 
          //5
          {
            ques: "من هو النبي الذي ألقى عصاه فتحولت إلى ثعبان بإذن الله؟",
            options: [
              "محمد صلى الله عليه وسلم", 
              "موسى عليه السلام", 
              "يوسف عليه السلام",
              "ذو الكفل عليه السلام",
            ],
            answer: "موسى عليه السلام",
            just: 
              "النبي الذي ألقى عصاه فتحولت إلى ثعبان هو موسى عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة الأعراف من الآية 104 إلى 107:",
            justVerse:  
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ ٤٠١۝ حَقِيقٌ عَلَىٰ أَن لَّا أَقُولَ عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ قَدْ جِئْتُكُم بِبَيِّنَةٍ مِّن رَّبِّكُمْ فَأَرْسِلْ مَعِيَ بَنِي إِسْرَائِيلَ ٥٠١۝ قَالَ إِن كُنتَ جِئْتَ بِآيَةٍ فَأْتِ بِهَا إِن كُنتَ مِنَ الصَّادِقِينَ ٦٠١۝ فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُّبِينٌ ٧٠١۝"
          },
          //6
          {
            ques: "من هو النبي الذي كانت معجزته إنقسام البحر؟",
            options: [
              "هارون عليه السلام", 
              "يعقوب عليه السلام", 
              "محمد صلى الله عليه وسلم",
              "موسى عليه السلام",
            ],
            answer: "موسى عليه السلام",
            just: 
              "النبي الذي كانت معجزته إنقسام البحر هو موسى عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة الشعراء في الآية 63:",           
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "فَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنِ اضْرِب بِّعَصَاكَ الْبَحْرَ ۖ فَانفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيمِ ٣٦۝"
          },
          //7
          {
            ques: 'كم عدد الأنبياء الذين ذكروا في القرآن الكريم؟',
            options: ['10', '15', '25'],
            answer: '25',
            just: 
              "عدد الأنبياء الذين ذكروا في القرآن الكريم هو 25 وهم:"
              + "\n" +
              "آدم عليه السلام"
              + "\n" +
              "إدريس عليه السلام"
              + "\n" +
              "نوح عليه السلام"
              + "\n" +
              "هود عليه السلام"
              + "\n" +
              "صالح عليه السلام"
              + "\n" +
              "إبراهيم عليه السلام"
              + "\n" +
              "لوط عليه السلام"
              + "\n" +
              "إسماعيل عليه السلام"
              + "\n" +
              "إسحاق عليه السلام"
              + "\n" +
              "يعقوب عليه السلام"
              + "\n" +
              "يوسف عليه السلام"
              + "\n" +
              "أيوب عليه السلام"
              + "\n" +
              "شعيب عليه السلام"
              + "\n" +
              "موسى عليه السلام"
              + "\n" +
              "هارون عليه السلام"
              + "\n" +
              "ذو الكفل عليه السلام"
              + "\n" +
              "داود عليه السلام"
              + "\n" +
              "سليمان عليه السلام"
              + "\n" +
              "إلياس عليه السلام"
              + "\n" +
              "اليسع عليه السلام"
              + "\n" +
              "يونس عليه السلام"
              + "\n" +
              "زكريا عليه السلام"
              + "\n" +
              "يحيى عليه السلام"
              + "\n" +
              "عيسى عليه السلام"
              + "\n" +
              "محمد صلى الله عليه وسلم"
          },
          //8
          {
            ques: 'من أول من قال السلام عليكم ورحمة الله وبركاته؟',
            options: [
              'آدم عليه السلام', 
              'موسى عليه السلام', 
              'عيسى عليه السلام',
              'محمد صلى الله عليه وسلم',
            ],
            answer: 'آدم عليه السلام',
            just: 
              "أول من قال السلام عليكم ورحمة الله وبركاته هو أبونا آدم عليه السلام." 
              + "\n\n" +
              "قال رسول الله صلى الله عليه وسلم: خلق اللهُ آدمَ على صُورتِه ، وطُولُه سِتُّونَ ذِراعًا ، ثُم قال : اذْهبْ فَسَلِّم على أُولئِكَ النَّفَرِ – وهُم نَفَرٌ من الملائِكةِ جُلُوسٌ – فاسْتمِعْ ما يُحَيُّونَك ؛ فإِنَّها تَحَيَُّتُك وتَحيةُ ذُرِّيَّتِكَ ، فذَهبَ فقال : السَّلامُ عليكم ، فقالُوا : السَّلامُ عليكَ ورحمةُ اللهِ ، فزَادُوهُ ( ورَحمةُ اللهِ ) فكُلُّ مَن يَدخلُ الجنةَ على صورةِ آدمَ في طُولِه سِتُّونَ ذِراعًا ، فلمْ تَزلْ الخَلْقُ تَنقُصُ بعدَه حتى الآنَ"
          },
          //9
          {
            ques: 'من النبي الذي طلب منه قومه أن ينزل لهم مائدة من السماء؟',
            options: [
              "محمد صلى الله عليه وسلم",
              'موسى عليه السلام', 
              'عيسى عليه السلام', 
              'إبراهيم عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: "النبي الذي طلب منه قومه أن ينزل لهم مائدة من السماء هو عيسى عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة المائدة في الآية 112:",          
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "إِذْ قَالَ الْحَوَارِيُّونَ يَا عِيسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ ۖ قَالَ اتَّقُوا اللَّهَ إِن كُنتُم مُّؤْمِنِينَ ٢١١۝"
          },
          //10
          {
            ques: 'من النبي الذي قتل جالوت؟',
            options: [
              'داود عليه السلام', 
              "محمد صلى الله عليه وسلم",
              'يعقوب عليه السلام', 
              'لوط عليه السلام',
            ],
            answer: 'داود عليه السلام',
            just: "النبي الذي قتل جالوت هو داود عليه السلام."
              + "\n\n" +
              "قال الله عز وجل في سورة البقرة في الآية 251:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "فَهَزَمُوهُم بِإِذْنِ اللهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ ۗ وَلَوْلَا دَفْعُ اللهِ النَّاسَ بَعْضَهُم بِبَعْضٍ لَّفَسَدَتِ الْأَرْضُ وَلَٰكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعَالَمِينَ ١٥٢۝"
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'من هو النبي الملقب بشيخ المرسلين؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'نوح عليه السلام',
              'إبراهيم عليه السلام', 
              'آدم عليه السلام',
            ],
            answer: 'نوح عليه السلام',
            just: 
              "النبي الملقب بشيخ المرسلين هو نوح عليه السلام لأنه عاش طويلا على الأقل 950 سنة والله أعلم."
              + "\n\n" +
              "قال الله عز وجل في سورة العنكبوت في الآية 14:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ ٤١۝"
          }, 
          //2
          {
            ques: 'من هو النبي الملقب بأبو الأنبياء؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'نوح عليه السلام',
              'إبراهيم عليه السلام',
              'آدم عليه السلام',
            ],
            answer: 'إبراهيم عليه السلام',
            just: "النبي الملقب بأبو الأنبياء هو إبراهيم عليه السلام لأن كل الأنبياء الذين جاءوا من بعده من ذريته، بدءا بنبي الله إسحاق، وانتهاءً بخاتم الأنبياء رسول الله صلى الله عليه وسلم."
          },  
          //3
          {
            ques: 'من هو النبي الذي لقب بكليم الله؟',
            options: [
              'عيسى عليه السلام',
              'محمد صلى الله عليه وسلم',
              'آدم عليه السلام',
              'موسى عليه السلام',
            ],
            answer: 'موسى عليه السلام',
            just: 
              "النبي الذي لقب بكليم الله هو موسى عليه السلام."
              + "\n\n" + 
              "قال الله تعالى في سورة الأعراف في الآية 143:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَلَمَّا جَاءَ مُوسَىٰ لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنظُرْ إِلَيْكَ ۚ قَالَ لَن تَرَانِي وَلَٰكِنِ انظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرَانِي ۚ فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَىٰ صَعِقًا ۚ فَلَمَّا أَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ وَأَنَا أَوَّلُ الْمُؤْمِنِينَ ٣٤١۝"
          },
          //4
          {
            ques: 'من هو خليل الله؟',
            options: [
            'إبراهيم عليه السلام',
            'صالح عليه السلام',
            'شعيب عليه السلام',
            'محمد صلى الله عليه وسلم',
          ],
            answer: 'إبراهيم عليه السلام',
            just: 
              "خليل الله هو النبي إبراهيم عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة  النساء في الآية 125:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَمَنْ أَحْسَنُ دِينًا مِّمَّنْ أَسْلَمَ وَجْهَهُ لِلهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۗ وَاتَّخَذَ اللهُ إِبْرَاهِيمَ خَلِيلًا ٥٢١۝"
          },
          //5
          {
            ques: 'من هو خطيب الأنبياء؟',
            options: [
            'هارون عليه السلام',
            'داود عليه السلام',
            'محمد صلى الله عليه وسلم',
            'شعيب عليه السلام'
            ],
            answer: 'شعيب عليه السلام',
          },
          //6
          {
            ques: 'من هو النبي الملقب بالصديق؟',
            options: [
              'يوسف عليه السلام',
              'يونس عليه السلام',
              'محمد صلى الله عليه وسلم',
              'ذو الكفل عليه السلام',
            ],
            answer: 'يونس عليه السلام',
          },
          //7
          {
            ques: 'من هو النبي الملقب بالمسيح؟',
            options: [
              'موسى عليه السلام',
              'محمد صلى الله عليه وسلم',
              'عيسى عليه السلام',
              'لوط عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: 
              "النبي الملقب بالمسيح هو عيسى عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة آل عمران في الآية 45:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "إِذْ قَالَتِ الْمَلَائِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ اسْمُهُ الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ وَجِيهًا فِي الدُّنْيَا وَالْآخِرَةِ وَمِنَ الْمُقَرَّبِينَ ٥٤۝"
          },
          //8
          {
            ques: 'من هو النبي الملقب بسيد الأولين وسيد الآخرين؟',
            options: [
              'آدم عليه السلام',
              'موسى عليه السلام',
              'نوح عليه السلام',
              'محمد صلى الله عليه وسلم',
            ],
            answer: 'محمد صلى الله عليه وسلم',   
            just: ""
          },
          //9
          {
            ques: 'من هو النبي الذي لقب بخليفة الله؟',
            options: [
              'النبي يوسف عليه السلام',
              'النبي عيسى عليه السلام',
              'محمد صلى الله عليه وسلم',
              'النبي داود عليه السلام',
            ],
            answer: 'النبي داود عليه السلام',
          },
          //10
          {
            ques: 'من هو النبي الملقب بالنبي الملك؟',
            options: [
              'محمد صلى الله عليه وسلم',
            'النبي سليمان عليه السلام',
            'النبي إبراهيم عليه السلام',
            'النبي آدم عليه السلام',
            ],
            answer: 'النبي سليمان عليه السلام',
            just: ""
          },
        ],
      },
      {
        title: "إختبار 3",
        id: 3,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'ما نوع العذاب الذي عذب الله به قوم نوح؟',
            options: [
              'الحريق',
              'الزلزال',
              'الجفاف',
              'الطوفان',
            ],
            answer: 'الطوفان',
            just: 
              "عذب الله قوم نوح بالطوفان."
              + "\n\n" +
              "قال الله تعالى في سورة العنكبوت في الآية 14:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ ٤١۝"
          },
          //2
          {
            ques: 'من هما النبيان اللذان إشتركا في بناء الكعبة؟',
            options: [
              'نوح وهود عليهما السلام',
              'إبراهيم وإسحاق عليهما السلام',
              'إبراهيم وإسماعيل عليهما السلام',
              'يعقوب ويوسف عليهما السلام',
            ],
            answer: 'إبراهيم وإسماعيل عليهما السلام',
            just: 
              "النبيان اللذان إشتركا في بناء الكعبة هما إبراهيم وإسماعيل عليهما السلام."
              + "\n\n" +
              "قال الله تعالى في سورة البقرة في الآية 127:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ ٧٢١۝"
          },
          //3
          {
            ques: 'من هو النبي الذي خُلق من دون أب أو أم؟',
            options: [
              'عيسى عليه السلام',
              'آدم عليه السلام',
              'موسى عليه السلام',
              'محمد صلى الله عليه وسلم',
            ],
            answer: 'آدم عليه السلام',
          },
          //4
          {
            ques: 'من هو النبي الذي تآمر عليه اخوته؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'إسحاق عليه السلام',
              'يوسف عليه السلام',
              'يعقوب عليه السلام',
            ],
            answer: 'يوسف عليه السلام',
          },    
          //5  
          {
            ques: 'من هو النبي الذي إبتلعه الحوت؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'يوسف عليه السلام',
              'يونس عليه السلام',
              'نوح عليه السلام',
            ],
            answer: 'يونس عليه السلام',
            just: 
              "النبي الذي إبتلعه الحوت هو يونس عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة الصافات من الآية 139 إلى 142:",
              justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَإِنَّ يُونُسَ لَمِنَ الْمُرْسَلِينَ ٩٣١۝ إِذْ أَبَقَ إِلَى الْفُلْكِ الْمَشْحُونِ ٠٤١۝ فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِينَ ١٤١۝ فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ ٢٤١۝"
          },     
          //6
          {
            ques: 'من هو النبي الذي طمع بأن يرى الله عز وجل؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'موسى عليه السلام',
              'عيسى عليه السلام',
              'إبراهيم عليه السلام',
            ],
            answer: 'موسى عليه السلام',
          },
          //7
          {
            ques: 'من هو النبي الذي أنزل الله عليه الإنجيل؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'داود عليه السلام',
              'موسى عليه السلام',
              'عيسى عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: 
              "النبي الذي أنزل الله عليه الإنجيل هو عيسى عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة المائدة في الآية 46:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَقَفَّيْنَا عَلَىٰ آثَارِهِم بِعِيسَى ابْنِ مَرْيَمَ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ ۖ وَآتَيْنَاهُ الْإِنجِيلَ فِيهِ هُدًى وَنُورٌ وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ وَهُدًى وَمَوْعِظَةً لِّلْمُتَّقِينَ ٦٤۝"
          },
          //8
          {
            ques: 'من هو النبي الذي سخر له الله الجن والطير وعلمه لغة الطير؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'عيسى عليه السلام',
              'يعقوب عليه السلام',
              'سليمان عليه السلام',
            ],
            answer: 'سليمان عليه السلام',
            just: "",
          },
          //9
          {
            ques: "كم عدد المرات التي ورد فيها إسم الرسول محمد صلى الله عليه وسلم في القرآن الكريم؟",
            options: [
              '4 مرات',
              '3 مرات',
              '5 مرات',
              '2 مرات',
            ],
            answer: '4 مرات',
            just: 
              "ورد إسم الرسول محمد صلى الله عليه وسلم 4 مرات في القرآن الكريم."
              + "\n" +
              "في سورة آل عمران في الآية 144"
              + "\n" +
              "في سورة الأحزاب في الآية 40"
              + "\n" +
              "في سورة محمد في الآية 2"
              + "\n" +
              "في سورة الفتح في الآية 29"
          },
          //10
          {
            ques: 'ما هو اليوم الذي خلق الله فيه سيدنا آدم عليه السلام؟',
            options: [
              'الجمعة',
              'الإثنين',
              'الثلثاء',
              'الأربعاء',
            ],
            answer: 'الجمعة',
            just: "",
          },
        ],
      },
      {
        title: "إختبار 4",
        id: 4,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'ما هي الحشرة التي تحدثت مع النبي سليمان عليه السلام؟',
            options: [
              'النحلة',
              'النملة',
            ],
            answer: 'النملة',
            just: 
              "الحشرة التي تحدث مع النبي سليمان عليه السلام هي النملة."
              + "\n\n" +
              "قال الله تعالى في سورة النمل من الآية 18 إلى 19:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "حَتَّىٰ إِذَا أَتَوْا عَلَىٰ وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ ٨١۝ فَتَبَسَّمَ ضَاحِكًا مِّن قَوْلِهَا وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ ٩١۝"
          },
          //2
          {
            ques: 'ما هو الطائر الذي تكلم مع النبي سليمان عليه السلام؟',
            options: ['العقاب', 'البومة', 'الهدهد', 'النسر',],
            answer: 'الهدهد',
            just: 
              "الطائر الذي تكلم مع النبي سليمان عليه السلام هو الهدهد."
              + "\n\n" +
              "قال الله تعالى في سورة النمل من الآية 20 إلى 22:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ ٠٢۝ لَأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُّبِينٍ ١٢۝ فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ ٢٢۝"
          },
          //3
          {
            ques: 'كم عدد أبناء سيدنا إبراهيم عليه السلام في القرآن الكريم؟',
            options: ['2', '3', '5', '1'],
            answer: '2',
            just: 
              "ورد في القرآن الكريم وجود ولدين لسيدنا إبراهيم عليه السلام وكلاهما من الأنبياء وهما:"
              + "\n" +
              "إسماعيل عليه السلام"
              + "\n" +
              "إسحاق عليه السلام"
          },
          //4
          {
            ques: 'من هو النبي الذي صام عن الكلام لمدة ثلاثة أيام؟',
            options: [
              'موسى عليه السلام', 
              'إبراهيم عليه السلام', 
              'زكريا عليه السلام', 
              'هارون عليه السلام'
            ],
            answer: 'زكريا عليه السلام', 
            just: 
              "النبي الذي صام عن الكلام لمدة ثلاثة أيام هو النبي زكريا عليه السلام."
              + "\n\n" +
              // "قال الله تعالى في سورة مريم من الآية 7 إلى 11:"
              // + "\n" +
              // "يَـٰزَڪَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُ مِن قَبۡلُ سَمِيًّا ٧۝ قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌ  وَڪَانَتِ ٱمۡرَأَتِى عَاقِرًا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡڪِبَرِ عِتِيًّا ٨۝ قَالَ كَذَالِكَ قَالَ رَبُّكَ هُوَ عَلَىَّ هَيِّنٌ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـًٔا ٩۝ قَالَ رَبِّ ٱجۡعَل لِّىٓ ءَايَةً قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَـٰثَ لَيَالٍ سَوِيًّا ٠١۝ فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡہِمۡ أَن سَبِّحُواْ بُكۡرَةً وَعَشِيًّا ١١۝"
              // + "\n\n" +
              "قال الله تعالى في سورة آل عمران من الآية 38 إلى 41:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "هُنَالِكَ دَعَا زَڪَرِيَّا رَبَّهُ ۥ‌ۖ قَالَ رَبِّ هَبۡ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً‌ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ ٨٣۝ فَنَادَتۡهُ ٱلۡمَلَـٰٓٮِٕكَةُ وَهُوَ قَآٮِٕمٌ يُصَلِّى فِى ٱلۡمِحۡرَابِ أَنَّ ٱللَّهَ يُبَشِّرُكَ بِيَحۡيَىٰ مُصَدِّقَۢا بِكَلِمَةٍ مِّنَ ٱللَّهِ وَسَيِّدًا وَحَصُورًا وَنَبِيًّا مِّنَ ٱلصَّـٰلِحِينَ ٩٣۝ قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌ وَقَدۡ بَلَغَنِىَ ٱلۡڪِبَرُ وَٱمۡرَأَتِى عَاقِرٌ قَالَ كَذَالِكَ ٱللَّهُ يَفۡعَلُ مَا يَشَآءُ ٠٤۝ قَالَ رَبِّ ٱجۡعَل لِّىٓ ءَايَةً قَالَ ءَايَتُكَ أَلَّا تُڪَلِّمَ ٱلنَّاسَ ثَلَـٰثَةَ أَيَّامٍ إِلَّا رَمۡزًا‌ۗ وَٱذۡكُر رَّبَّكَ ڪَثِيرًا وَسَبِّحۡ بِٱلۡعَشِىِّ وَٱلۡإِبۡڪَـٰرِ ١٤۝"
          },
          //5
          {
            ques: 'من هو النبي الذي كان قومه يعبدون الأيكة؟',
            options: [
              'النبي إدريس عليه السلام', 
              'النبي هود عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي شعيب عليه السلام',
            ],
            answer: 'النبي شعيب عليه السلام',
            just: "النبي الذي كان قومه يعبدون الأيكة هو النبي شعيب عليه السلام"
          },
          //6
          {
            ques: 'من هو النبي الذي أمره الله بأن يصنع سفينة؟',
            options: [
              "يوسف عليه السلام",
              "نوح عليه السلام",
              "زكريا عليه السلام",
              "اليسع عليه السلام",
            ],
            answer: "نوح عليه السلام",
            just: 
              "النبي الذي أمره الله بأن يصنع سفينة هو النبي نوح عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة هود في الآية 36 و 37:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ ٦٣۝ وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ ٧٣۝"
          },
          //7
          {
            ques: 'كيف أهلك الله قوم عاد؟',
            options: [
              'بزلزال',
              'بالجفاف',
              'بالغرق',
              'بريح صرصر عاتية', 
            ],
            answer: 'بريح صرصر عاتية',
            just: 
              "أهلك الله قوم عاد بريح صرصر عاتية."
              + "\n\n" +
              "قال الله تعالى في سورة الحاقة في الآية 6:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ ٦۝"
          },
          //8
          {
            ques: 'من هو النبي الذي ألان الله له الحديد؟',
            options: [
              'نوح عليه السلام', 
              'موسى عليه السلام', 
              'داود عليه السلام', 
              'يوسف عليه السلام'
            ],
            answer: 'داود عليه السلام',
            just: 
              "النبي الذي ألان الله له الحديد هو داود عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة سبأ في الآية 10:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلًا ۖ يَا جِبَالُ أَوِّبِي مَعَهُ وَالطَّيْرَ ۖ وَأَلَنَّا لَهُ الْحَدِيدَ ٠١۝"
          },
          //9
          {
            ques: 'من هو كفيل السيدة مريم؟',
            options: [
              "موسى عليه السلام",
              "زكريا عليه السلام",
              "عيسى عليه السلام",
              "يحيى عليه السلام",
            ],
            answer: "زكريا عليه السلام",
            just: 
              "كفيل السيدة مريم هو النبي زكريا عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة آل عمران في الآية 37:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًا ۖ قَالَ يَا مَرْيَمُ أَنَّىٰ لَكِ هَٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ اللَّهِ ۖ إِنَّ اللَّهَ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ ٧٣۝"
          },
          //10
          {
            ques: 'من هو النبي الذي تعرض لسخرية من قومه؟',
            options: [
              'عيسى عليه السلام', 
              'داود عليه السلام', 
              'موسى عليه السلام', 
              'نوح عليه السلام',
            ],
            answer: 'نوح عليه السلام',
            just: 
              "النبي الذي تعرض لسخرية من قومه هو النبي نوح عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة هود من الآيات 36 إلى 38:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ ٦٣۝ وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ ٧٣۝ وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِّن قَوْمِهِ سَخِرُوا مِنْهُ ۚ قَالَ إِن تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنكُمْ كَمَا تَسْخَرُونَ ٨٣۝"
          },
        ],
      },
      {
        title: "إختبار 5",
        id: 5,
        score: 0,
        taken: false,
        questions: [   
          {
            ques: 'من هو النبي النجار؟',
            options: ['نوح عليه السلام', 'زكريا عليه السلام', 'إدريس عليه السلام'],
            answer: 'زكريا عليه السلام',
          },
          //2
          {
            ques: 'من هو النبي الحداد؟',
            options: ['داود عليه السلام', 'صالح عليه السلام', 'يوسف عليه السلام'],
            answer: 'داود عليه السلام',
            just: 
              "كان النبي داود عليه السلام حدادا يصنع الدروع."
              + "\n\n" +
              "قال الله تعالى في سورة سبأ في الآية 10 و 11:",
            justVerse:
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلًا ۖ يَا جِبَالُ أَوِّبِي مَعَهُ وَالطَّيْرَ ۖ وَأَلَنَّا لَهُ الْحَدِيدَ ٠١۝ أَنِ اعْمَلْ سَابِغَاتٍ وَقَدِّرْ فِي السَّرْدِ ۖ وَاعْمَلُوا صَالِحًا ۖ إِنِّي بِمَا تَعْمَلُونَ بَصِيرٌ ١١۝"
          },
          {
            ques: 'ما مهنة رسولنا الكريم قبل أن يُبعث؟',
            options: ['الرعي والتجارة', 'الزراعة والصيد', 'البناء والحرف اليدوية'],
            answer: 'الرعي والتجارة',
          },
          {
            ques: 'من هو النبي الخياط؟',
            options: ['آدم عليه السلام', 'إدريس عليه السلام', 'يوسف عليه السلام'],
            answer: 'إدريس عليه السلام',
          },
          {
            ques: 'ما مهنة النبي موسى؟',
            options: ['راعي', 'صياد', 'حرفي'],
            answer: 'راعي',
          },
          {
            ques: 'ما مهنة سيدنا آدم؟',
            options: ['فلاح', 'حرفي', 'تاجر'],
            answer: 'فلاح',
          },
          {
            ques: 'ما مهنة إلياس عليه السلام؟',
            options: ['حداد', 'نساج', 'خياط'],
            answer: 'نساج',
          },
          {
            ques: 'ما مهنة إبراهيم عليه السلام؟',
            options: ['تاجر أقمشة', 'حرفي', 'صياد'],
            answer: 'تاجر أقمشة',
          },
          {
            ques: 'ما مهنة النبي إسحاق عليه السلام؟',
            options: ['حرفي', 'راعي', 'نجار'],
            answer: 'راعي',
          },
          {
            ques: 'ما مهنة نوح عليه السلام؟',
            options: ['نجار', 'حداد', 'صياد'],
            answer: 'نجار',
          },
        ],
      },
      {
        title: "إختبار 6",
        id: 6,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'من هي أول إمرأة تزوجها النبي إبراهيم عليه السلام؟',
            options: [
              'هاجر عليها السلام', 
              'سارة عليها السلام', 
            ],
            answer: 'سارة عليها السلام',
            just: "أول إمرأة تزوجها النبي إبراهيم عليه السلام هي سارة عليها السلام."
          },
          //2
          {
            ques: 'من هو النبي الذي بقي حياً حتى الآن؟',
            options: [
              'إدريس عليه السلام', 
              'عيسى عليه السلام', 
              'إسماعيل عليه السلام', 
              'شعيب عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: 
              "النبي الذي بقي حيا حتى الآن هو عيسى عليه السلام."
              + "\n\n" +
              "جميع الأنبياء عليه السلام قد ماتوا إلا عيسى عليه السلام، فقد رفعه الله إلى السماء وسينزل إلى الأرض وسيموت وسيصلي عليه المسلمون."
              + "\n\n" +
              "قال الله تعالى في سورة النساء من الآية 157 إلى 159:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" + 
              "وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِن شُبِّهَ لَهُمْ ۚ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِّنْهُ ۚ مَا لَهُم بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًا ٧٥١۝ بَل رَّفَعَهُ اللهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا ٨٥١۝ وَإِن مِّنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ ۖ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا ٩٥١۝"
          },
          //3
          {
            ques: 'ما إسم أم النبي إسماعيل عليه السلام؟',
            options: [
              'سارة عليها السلام', 
              'هاجر عليها السلام', 
            ],
            answer: 'هاجر عليها السلام',
            just: "إسم أم النبي إسماعيل عليه السلام هو هاجر عليها السلام."
          },  
          //4    
          {
            ques: 'من هو النبي الذي خرجت ناقته من الصخر؟',
            options: [
              'النبي إسماعيل عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي صالح عليه السلام',
            ],
            answer: 'النبي صالح عليه السلام',
            just: "النبي الذي خرجت ناقته من الصخر هو صالح عليه السلام."
          },
          //5
          {
            ques: 'من هو النبي الذي لم تحرقه النار؟',
            options: [
              'النبي نوح عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي لوط عليه السلام',
            ],
            answer: 'النبي إبراهيم عليه السلام',
            just: 
              "النبي الذي لم تحرقه النار هو إبراهيم عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة الأنبياء في الآية 69:",
            justVerse:
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ ٩٦۝"
          },
          //6
          {
            ques: 'من هو النبي الذي أعطاه الله ملكاً لم يعطه لأحد بعده؟',
            options: [
              'النبي داوود عليه السلام', 
              'النبي سليمان عليه السلام', 
              'النبي يوسف عليه السلام',
            ],
            answer: 'النبي سليمان عليه السلام',
            just: 
              "النبي الذي أعطاه الله ملكاً لم يعطه لأحد بعده هو النبي سليمان عليه السلام."
              + "\n\n" +
              "قال الله تعالى في سورة ص في الآيات 34 و 35:",
            justVerse:
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ ٤٣۝ قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ ٥٣۝"
          },
          //7
          {
            ques: 'من معجزات نبينا محمد عليه الصلاة والسلام؟',
            options: [
              'كلامه في المهد', 
              'القرآن الكريم', 
              'تأويل الرؤى',
            ],
            answer: 'القرآن الكريم',
            just: "من معجزات نبينا محمد صلى الله عليه وسلم القرآن الكريم."
          }, 
          //8
          {
            ques: 'من هو النبي الذي كانت معجزته الإسراء والمعراج؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'إبراهيم عليه السلام',
              'موسى عليه السلام',
              'عيسى عليه السلام',
            ],
            answer: 'محمد صلى الله عليه وسلم',
            just: 
              "النبي الذي كانت معجزته الإسراء والمعراج هو سيدنا النبي محمد صلى الله عليه وسلم."
              + "\n\n" +
              "قال الله تعالى في سورة الإسراء في الآية 1:",
            justVerse:
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا ۚ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ ١۝"
          }, 
          //9
          {
            ques: 'من هو أول من خط بالقلم؟',
            options: [
              'نوح عليه السلام', 
              'آدم عليه السلام', 
              'إدريس عليه السلام', 
              'موسى عليه السلام'
            ],
            answer: 'إدريس عليه السلام',
          },
          //10
          {
            ques: 'كم لبث النبي نوح عليه السلام بدعوة قومه لعبادة الله؟',
            options: [
              '1000 عام',
              '950 عاماً',
              '900 عام',
              '800 عام'
            ],
            answer: '950 عاماً',
            just: 
              "لبث النبي نوح عليه السلام بدعوة قومه لعبادة الله 950 عاما"
              + "\n" +
              "قال الله تعالى في سورة العنكبوت في الآية 14:",
            justVerse:
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ ٤١۝"
          },
        ],
      },
    ],
  },



  //done
  {
    id: 5,
    title: "الصحابة",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'من أول من استضاف الرسول صلى الله عليه وسلم في بيته عندما وصل المدينة؟',
            options: [
              'أبو أيوب الأنصاري رضي الله عنه',
              'سعد بن معاذ الأنصاري رضي الله عنه',
              'عمر بن الخطاب رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
            ],
            answer: 'أبو أيوب الأنصاري رضي الله عنه',
            just: "أول من استضاف الرسول صلى الله عليه وسلم في بيته عندما وصل المدينة هو أبو أيوب الأنصاري رضي الله عنه."
          },
          //2
          {
            ques: "من هو الصحابي الذي كانت تسلم عليه الملائكة؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "عثمان بن عفان رضي الله عنه",
              "عمران بن حصين رضي الله عنه",
            ],
            answer: "عمران بن حصين رضي الله عنه",
            just: "الصحابي الذي كانت تسلم عليه الملائكة هو عمران بن حصين رضي الله عنه."
          },      
          //3
          {
            ques: "من هو أول من عقدت له راية في الإسلام؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه",
              "حمزة بن عبد المطلب رضي الله عنه",
              "خالد بن الوليد رضي الله عنه",
            ],
            answer: "حمزة بن عبد المطلب رضي الله عنه",
            just: "أول من عقدت له راية في الإسلام هو حمزة بن عبد المطلب رضي الله عنه."
          },
          //4
          {
            ques: "من هو أول من سل سيفه في سبيل الله؟",
            options: [
              "خالد بن الوليد رضي الله عنه",
              "سعد بن أبي وقاص رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "الزبير بن العوام رضي الله عنه"
            ],
            answer: "الزبير بن العوام رضي الله عنه",
            just: "أول من سل سيفه في سبيل الله هو الزبير بن العوام رضي الله عنه."
          },      
          //5
          {
            ques: "من هو الصحابي الذي اهتزّ لموته عرش الرحمن؟",
            options: [
              "سعد بن معاذ رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه"
            ],
            answer: "سعد بن معاذ رضي الله عنه",
            just: "الصحابي الذي اهتزّ لموته عرش الرحمن هو سعد بن معاذ رضي الله عنه.",
          },   
          //6   
          {
            ques: "من الذي قد قال فيه عمر بن الخطاب يوم وفاته، لقد مات اليوم سيد المسلمين؟",
            options: [
              "أُبَيّ بن كعب رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "خالد بن الوليد رضي الله عنه",
            ],
            answer: "أُبَيّ بن كعب رضي الله عنه",
            just: "الذي قد قال فيه عمر بن الخطاب يوم وفاته، لقد مات اليوم سيد المسلمين هو أبي بن كعب رضي الله عنه."
          },
          //7
          {
            ques: "ما هي أول غزوة شارك فيها الصحابي عبد الله بن عمر رضي الله عنه؟",
            options: [
              "غزوة بدر",
              "غزوة الخندق",
              "فتح مكة",
              "غزوة تبوك"
            ],
            answer: "غزوة الخندق",
            just: "أول غزوة شارك فيها الصحابي عبد الله بن عمر رضي الله عنه هي غزوة الخندق.",
          },    
          //8  
          {
            ques: "من هو أول صحابي قرأ القرآن الكريم جهراً؟",
            options: [
              "عمر بن الخطاب رضي الله عنه", 
              "علي بن أبي طالب رضي الله عنه", 
              "عبد الله بن مسعود رضي الله عنه", 
              "أبو بكر الصديق رضي الله عنه"
            ],
            answer: "عبد الله بن مسعود رضي الله عنه",
            just: "أول صحابي قرأ القرآن الكريم جهرا هو عبد الله بن مسعود رضي الله عنه.",
          },  
          //9    
          {
            ques: "من هو الصحابي الملقب بذي النورين؟",
            options: [
              "أبو بكر الصديق رضي الله عنه", 
              "عمر بن الخطاب رضي الله عنه", 
              "علي بن أبي طالب رضي الله عنه", 
              "عثمان بن عفان رضي الله عنه"
            ],
            answer: "عثمان بن عفان رضي الله عنه",
            just: "الصحابي الملقب بذي النورين هو عثمان بن عفان رضي الله عنه.",
          },      
          //10
          {
            ques: 'من هو الصحابي المُلقب بـحيدرة؟',
            options: [
              'أسامة بن زيد رضي الله عنه',
              'معاوية بن أبي سفيان رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه'
            ],
            answer: 'علي بن أبي طالب رضي الله عنه',
            just: "الصحابي الملقب بحيدرة هو علي بن أبي طالب رضي الله عنه.",
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'من هو سيف الله المسلول؟',
            options: ['معاذ بن جبل رضي الله عنه', 'علي بن أبي طالب رضي الله عنه', 'خالد بن الوليد رضي الله عنه'],
            answer: 'خالد بن الوليد رضي الله عنه',
            just: "سيف الله المسلول هو خالد بن الوليد رضي الله عنه."
          },
          //2
          {
            ques: 'من الذي عندما قتل رفع بين السماء والأرض؟',
            options: [
              'عامر بن فهيرة رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
              'خالد بن الوليد رضي الله عنه',
              'زيد بن حارثة رضي الله عنه',
            ],
            answer: 'عامر بن فهيرة رضي الله عنه',
            just: "الذي عندما قتل رفع بين السماء والأرض هو عامر بن فهيرة رضي الله عنه."
          },
          //3
          {
            ques: 'من هو أول من ولد في الإسلام في أرض الحبشة؟',
            options: [
              'عبد الله بن جعفر بن أبي طالب رضي الله عنهما',
              'جعفر بن أبي طالب رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
              'عبد الله بن عبد المطلب رضي الله عنه',
            ],
            answer: 'عبد الله بن جعفر بن أبي طالب رضي الله عنهما',
            just: "أول من ولد في الإسلام في أرض الحبشة هو عبد الله بن جعفر بن أبي طالب رضي الله عنه."
          },
          //4
          {
            ques: 'أين توفي الصحابي عبد الله بن حُذافة السُهمي رضي الله عنه؟',
            options: [
              'في مصر',
              'في المدينة',
              'في مكة المكرمة',
            ],
            answer: 'في مصر',
            just: "توفي الصحابي عبد الله بن حُذافة السُهمي رضي الله عنه في مصر."
          },
          //5
          {
            ques: "من الذي قد قَبّل رأس ملك الروم حتي يقوم بإطلاق سراح أسرى المسلمين؟",
            options: [
              "خالد بن الوليد رضي الله عنه",
              "سعد بن أبي وقاص رضي الله عنه",
              "زيد بن حارثة رضي الله عنه",
              "عبد الله بن حذافة السُهمي رضي الله عنه",
            ],
            answer: "عبد الله بن حذافة السُهمي رضي الله عنه",
            just: "الذي قَبّل رأس ملك الروم حتي يقوم بإطلاق سراح أسرى المسلمين هو عبد الله بن حذافة السهمي رضي الله عنه."
          },
          //6
          {
            ques: "من الذي رأى الأذان في المنام؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "عبد الله بن زيد الأنصاري رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "عثمان بن عفان رضي الله عنه",
            ],
            answer: "عبد الله بن زيد الأنصاري رضي الله عنه",
            just: "الذي رأى الأذان في المنام هو عبد الله بن زيد الأنصاري رضي الله عنه."
          },
          //7
          {
            ques: "من هو أول من قام بإستقبال القبلة في حياته وفي مماته؟",
            options: [
              "البراء بن معرور الأنصاري رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه"
            ],
            answer: "البراء بن معرور الأنصاري رضي الله عنه",
            just: "أول من قام بإستقبال القبلة في حياته وفي مماته هو البراء بن معرور الأنصاري رضي الله عنه."
          },
          //8
          {
            ques: "ما هي أول غزوة شارك فيها الصحابي عبد الله بن عمر رضي الله عنه؟",
            options: ["غزوة الخندق", "غزوة بدر", "غزوة أحد", "غزوة خيبر"],
            answer: "غزوة الخندق",
            just: "أول غزوة شارك فيها الصحابي عبد الله بن عمر رضي الله عنه هي خزوة الخندق."
          },
          //9
          {
            ques: 'من هو الصحابي الملقب بأبو المساكين؟',
            options: [
              'جعفر بن أبي طالب رضي الله عنه',
              'عبدالله بن مسعود رضي الله عنه',
              'سعد بن أبي وقاص رضي الله عنه',
              'زيد بن حارثة رضي الله عنه'
            ],
            answer: 'جعفر بن أبي طالب رضي الله عنه',
            just: "الصحابي الملقب بأبو المساكين هو جعفر بن أبي طالب رضي الله عنه."
          },
          //10
          {
            ques: 'من هو الصحابي الملقب بذو الجناحين؟',
            options: [
              'خالد بن الوليد رضي الله عنه',
              'زيد بن حارثة رضي الله عنه',
              'عمرو بن العاص رضي الله عنه',
              'جعفر بن أبي طالب رضي الله عنه',
            ],
            answer: 'جعفر بن أبي طالب رضي الله عنه',
            just: "الصحابي الملقب بذو الجناحين هو جعفر بن أبي طالب رضي الله عنه."
          },
        ],
      }
    ],
  },



  //done
  {
    id: 6,
    title: "الصوم والصلاة",    
    img: require("./assets/r4.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: "ما هي الصلاة التي تعتبر سنة مؤكدة في شهر رمضان؟",
            options: ["صلاة التراويح", "صلاة الضحى", "صلاة الوتر", "صلاة الاستخارة"],
            answer: "صلاة التراويح",
            just: "الصلاة التي تعتبر سنة مؤكدة في شهر رمضان هي صلاة التراويح."
          },
          //2
          {
            ques: "ما هي صلاة الأوابين؟",
            options: [
              "صلاة الضحى", 
              "صلاة الظهر", 
              "صلاة العشاء",
              "صلاة الإستسقاء",
            ],
            answer: "صلاة الضحى",
            just: 
              "صلاة الأوابين هي صلاة الضحى."
              + "\n\n" +
              "قال النبي صلى الله عليه وسلم: «لا يحافظ على صلاة الضحى إلا أوَّابٌ ، وهي صلاة الأوَّابين»"
              + "\n\n" +
              "و الأوَّابُ هو كثير الرجوع إلى الله"
          },
          //3
          {
            ques: "ما هي أول صلاة فرضت على النبي صلى الله عليه وسلم؟",
            options: [
              "صلاة الفجر", 
              "صلاة الظهر",
              "صلاة العصر", 
              "صلاة المغرب", 
              "صلاة العشاء",
            ],
            answer: "صلاة الظهر",
            just: "أول صلاة فرضت على النبي محمد صلى الله عليه وسلم هي صلاة الظهر."
          },
          //4
          {
            ques: "ما هي الصلاة التي نكرر فيها الركوع مرتين في كل ركعة؟",
            options: ["صلاة العيد", "صلاة الخسوف والكسوف", "صلاة الاستسقاء",],
            answer: "صلاة الخسوف والكسوف",
            just: "الصلاة التي نكرر فيها الركوع مرتين في كل ركعة هي صلاة الخسوف والكسوف."
          },
          //5
          {
            ques: '"كل عمل ابن آدم له إلا ......... فإنه لي وأنا أجزي به"',
            options: ["الصلاة", "الصوم", "الحج"],
            answer: "الصوم",
            just: "عن أبي هريرة رضي الله، أن رسول الله صلى الله عليه وسلم قال: (قالَ اللهُ: كُلُّ عَمَلِ ابْنِ آدَمَ له، إلَّا الصِّيَامَ؛ فإنَّه لي، وأَنَا أجْزِي به، والصِّيَامُ جُنَّةٌ، وإذَا كانَ يَوْمُ صَوْمِ أحَدِكُمْ فلا يَرْفُثْ ولَا يَصْخَبْ، فإنْ سَابَّهُ أحَدٌ أوْ قَاتَلَهُ، فَلْيَقُلْ: إنِّي امْرُؤٌ صَائِمٌ. والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لَخُلُوفُ فَمِ الصَّائِمِ أطْيَبُ عِنْدَ اللهِ مِن رِيحِ المِسْكِ. لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا: إذَا أفْطَرَ فَرِحَ، وإذَا لَقِيَ رَبَّهُ فَرِحَ بصَوْمِهِ)."
          },
          //6
          {
            ques: "ما هي الصلاة التي قال عنها رسول الله صلى الله عليه وسلم خير من الدنيا وما فيها؟",
            options: ["سنة الفجر", "سنة العشاء", "صلاة الضحى"],
            answer: "سنة الفجر",
            just: 
              "الصلاة التي قال عنها رسول الله صلى الله عليه وسلم خير من الدنيا وما فيها هي سنة الفجر (السنة القبلية لصلاة الفجر) التي نصليها قبل صلاة الفجر."
              + "\n\n" +
              "عن عائشةَ رَضِيَ اللهُ عَنْها، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: «ركعتَا الفجرِ خيرٌ من الدُّنيا وما فيها»"
          },
          //7
          {
            ques: 'ماذا تسمى الصلاة التي نصليها في الليل بعد الإستيقاظ من النوم؟',
            options: [
              'صلاة التراويح', 
              'صلاة التهجد',
              'صلاة العشاء',
              'صلاة الإستخارة'
            ],
            answer: 'صلاة التهجد',
            just: "الصلاة التي نصليها في الليل بعد الإستيقاظ من النوم هي صلاة التهجد."
          },  
          //8 
          {
            ques: 'متى فُرض الصيام على المسلمين؟',
            options: ['في السنة الثانية للهجرة', 'في السنة الخامسة للهجرة', 'قبل هجرة النبي صلى الله عليه وسلم'],
            answer: 'في السنة الثانية للهجرة',
            just: "فرض الصيام على المسلمين في السنة الثانية للهجرة."
          },
          //9
          {
            ques: 'كم عدد الصلوات التي فُرضت على أمة محمد صلى الله عليه وسلم أول مرة؟',
            options: ['55 صلاة', '50 صلاة', '5 صلوات'],
            answer: '50 صلاة',
            just: 
              "عدد الصلوات التي فرضت على أمة محمد صلى الله عليه وسلم هو 50 صلاة."
              + "\n\n" +
              "قالَ ابنُ حَزْمٍ، وأَنَسُ بنُ مالِكٍ: قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: فَفَرَضَ اللَّهُ علَى أُمَّتي خَمْسِينَ صَلاةً، قالَ: فَرَجَعْتُ بذلكَ حتَّى أمُرَّ بمُوسَى، فقالَ مُوسَى عليه السَّلامُ: ماذا فَرَضَ رَبُّكَ علَى أُمَّتِكَ؟ قالَ: قُلتُ: فَرَضَ عليهم خَمْسِينَ صَلاةً، قالَ لي مُوسَى عليه السَّلامُ: فَراجِعْ رَبَّكَ، فإنَّ أُمَّتَكَ لا تُطِيقُ ذلكَ، قالَ: فَراجَعْتُ رَبِّي، فَوَضَعَ شَطْرَها، قالَ: فَرَجَعْتُ إلى مُوسَى عليه السَّلامُ، فأخْبَرْتُهُ قالَ: راجِعْ رَبَّكَ، فإنَّ أُمَّتَكَ لا تُطِيقُ ذلكَ، قالَ: فَراجَعْتُ رَبِّي، فقالَ: هي خَمْسٌ وهي خَمْسُونَ لا يُبَدَّلُ القَوْلُ لَدَيَّ، قالَ: فَرَجَعْتُ إلى مُوسَى، فقالَ: راجِعْ رَبَّكَ، فَقُلتُ: قَدِ اسْتَحْيَيْتُ مِن رَبِّي، قالَ: ثُمَّ انْطَلَقَ بي جِبْرِيلُ حتَّى نَأْتِيَ سِدْرَةَ المُنْتَهَى فَغَشِيَها ألْوانٌ لا أدْرِي ما هي؟ قالَ: ثُمَّ أُدْخِلْتُ الجَنَّةَ، فإذا فيها جَنابِذُ اللُّؤْلُؤَ، وإذا تُرابُها المِسْكُ."
          },
          //10
          {
            ques: "كم عدد ركعات صلاة العشاء ؟",
            options: [ 
              '2',
              '3',
              '4'
            ],
            answer: '4',
            just: "عدد ركعات صلاة العشاء هو 4 ركعات."
          },  
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          //1
          {
            ques: 'ما هما صلاتي البردين؟',
            options: ['الفجر والظهر', 'الفجر والعصر', 'المغرب والعشاء'],
            answer: 'الفجر والعصر',
            just: "صلاتي البردين هما صلاة الفجر وصلاة العصر."
              + "\n\n" + 
              "عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «من صلَّى البَردينِ دخلَ الجنَّةَ»"
              + "\n\n" + 
              "وقد سميت صلاة الفجر وصلاة العصر بالبردين لأن صلاة الفجر فيها برد الليل، وصلاة العصر فيها برد النهار."
          },
          //2
          {
            ques: 'ما هي أول صلاة أقامها المسلمون بعد تحويل القبلة من بيت المقدس إلى الكعبة المشرفة؟',
            options: [
              'صلاة الفجر',
              'صلاة الظهر',
              'صلاة العصر',
              'صلاة المغرب',
              'صلاة العشاء',
            ],
            answer: 'صلاة العصر',
            just: "أول صلاة أقامها المسلمون بعد تحويل القبلة من بيت المقدس إلى الكعبة المشرفة هي صلاة العصر."
          },
          //3
          {
            ques: 'ما هي الصلاة التي ليس لها سنة راتبة؟',
            options: [
              'صلاة الفجر',
              'صلاة الظهر',
              'صلاة العصر',
              'صلاة المغرب',
              'صلاة العشاء',
            ],
            answer: 'صلاة العصر',
            just: "الصلاة التي ليس لها سنة راتبة هي صلاة العصر."
          },
          //4
          {
            ques: 'كم عدد مرات مسح الرأس في الوضوء؟',
            options: [
              'مرة واحدة',
              'مرتان',
              'ثلاث مرات',
            ],
            answer: 'مرة واحدة',
            just: "عدد مسح الرأس في الوضوء هو مرة واحدة.",
          },
          //5
          {
            ques: 'ما هي الصلاة التي تصلى طلبا لنزول الغيث (المطر)؟',
            options: [
              'صلاة الإستخارة',
              'صلاة الإستسقاء',
              'صلاة قيام الليل',
              'صلاة التهجد',
            ],
            answer: 'صلاة الإستسقاء',
            just: "الصلاة التي تصلى طلبا لنزول الغيث (المطر) هي صلاة الإستسقاء.",
          },
          //6
          {
            ques: 'ما هي الصلاة التي في كل ركعة قيامان وقراءتان وركوعان وسجودان؟',
            options: [
              'صلاة الضحى',
              'صلاة الإستخارة',
              'صلاة الخسوف والكسوف',
              'صلاة التهجد',
            ],
            answer: 'صلاة الخسوف والكسوف',
            just: "الصلاة التي في كل ركعة قيامان وقراءتان وركوعان وسجودان هي صلاة الخسوف والكسوف.",
          },
          //7
          {
            ques: 'ماذا نقول في السجود؟',
            options: [
              'سبحان ربي الأعلى',
              'سبحان ربي العظيم',
              'سمع الله لمن حمده ربنا ولك الحمد'
            ],
            answer: 'سبحان ربي الأعلى',
            just: 'نقول في السجود "سبحان ربي الأعلى" ثلاث مرات، ويجوز قولها أكثر والدعاء أيضا.',
          },
          //8
          {
            ques: 'ماذا نقول في الركوع؟',
            options: [
              'سبحان ربي الأعلى',
              'سبحان ربي العظيم',
              'سمع الله لمن حمده ربنا ولك الحمد'
            ],
            answer: 'سبحان ربي العظيم',
            just: 'نقول في الركوع "سبحان ربي العظيم" ثلاث مرات، ويجوز قولها أكثر والدعاء أيضا.',
          },
          //9
          {
            ques: 'ماذا نقول بعد القيام من الركوع؟',
            options: [
              'سمع الله لمن حمده ربنا ولك الحمد',
              'سبحان ربي العظيم',
              'سبحان ربي الأعلى'
            ],
            answer: 'سمع الله لمن حمده ربنا ولك الحمد',
            just: 'نقول بعد القيام من الركوع "سمع الله لمن حمده ربنا ولك الحمد".',
          },
          //10
          {
            ques: 'ما هو عدد فرائض الوضوء في القرآن الكريم؟',
            options: [
              '6',
              '7',
              '4',
              '8'
            ],
            answer: '4',
            just: 
              "عدد فرائض الوضوء في القرآن الكريم هو 4."
              + "\n\n" + 
              "قال الله عز وجل في سورة المائدة في الآية 6:",
            justVerse: 
              "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ"
              + "\n" +
              "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ اللهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ ٦۝",
          },
        ],
      },
    ],
  },
];
