export const data = [
  //done sourced
  {
    id: 1,
    title: "سنن السفر",
    sunan: [
      {
        id: 1,
        title: "إختيار أمير في السفر",
        desc: "من السنة إختيار أمير في السفر.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا كانَ ثلاثةٌ في سفَرٍ فليؤمِّروا أحدَهُم"',
            source: "صحيح أبي داود 2609",
          },
        ],
      },
      {
        id: 2,
        title: "التكبير عند الصعود والتسبيح عند النزول",
        desc: "من السنة التكبير عند الصعود والتسبيح عند النزول",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "كُنَّا إذَا صَعِدْنَا كَبَّرْنَا، وإذَا نَزَلْنَا سَبَّحْنَا"',
            source: "صحيح البخاري 2993",
            expl: "المُسلِمُ الحَقُّ ذَاكرٌ للهِ تعالَى، مُستَشعِرٌ لِعَظَمَتِه في كُلِّ أحوالِه، وهكذا كان النَّبيُّ صلَّى اللهُ عليه وسلَّمَ وأصحابُه، كما يُبَيَّنُ هذا الحَديثُ، فيَروي جابِرُ بنُ عَبدِ اللهِ رَضيَ اللهُ عنهما أنَّهم كانوا كُلَّما صَعِدوا مُرتَفَعًا في طَريقِهم كَبَّروا، فقالوا: اللهُ أكبَرُ، وكُلَّما نَزَلوا مُنزَلًا وهَبَطوا منه سَبَّحوا، فقالوا: سُبحانَ اللهِ؛ لِأنَّه لَمَّا كان الصُّعودُ ارتِفاعًا، ناسَبَه التَّكبيرُ، أي: أنَّ اللهَ سُبحانَه أكبَرُ مِن كُلِّ كَبيرٍ، وأعْلَى مِن كُلِّ رَفيعٍ، كما أنَّ في التَّكبيرِ عِندَ إشرافِه على الجِبالِ وكُلِّ مُرتَفَعٍ استِشعارًا لِكِبرياءِ اللهِ عَزَّ وجَلَّ، ولَمَّا كان النُّزولُ هُبوطًا، ناسَبَه التَّنزيهُ؛ لِأنَّه سُبحانَه هو العَليُّ الكَبيرُ، ولِأنَّ التَّسبيحَ تَنزيهُ اللهِ عن صِفاتِ الانخِفاضِ والضِّعةِ، وقيلَ: التَّسبيحُ في بُطونِ الأوديةِ، وفي المُنخَفَضاتِ، مُستَنبَطٌ مِن قِصَّةِ نَبيِّ اللهِ يُونُسَ عليه الصَّلاةُ والسَّلامُ؛ قال اللهُ تعالَى: {فَلَوْلَا أَنَّهُ كَانَ مِنَ الْمُسَبِّحِينَ * لَلَبِثَ فِي بَطْنِهِ إِلَى يَوْمِ يُبْعَثُونَ} [الصافات: 143، 144]، فنَجَّاه اللهُ تعالَى بتَسبيحِه في بَطْنِ الحُوتِ مِنَ الظُّلُماتِ، فامتَثَلَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ هذا التَّسبيحَ في بُطونِ الأوديةِ؛ لِيُنَجِّيَه اللهُ منها.",
          },
        ],
      },
      {
        id: 3,
        title: "الدعاء حين نزول منزل",
        desc: "من السنة الدعاء حين نزول منزل",
        ahadith: [
          {
            id: 1,
            title: 'عن خولة بنت حكيم رضي الله عنها قالت: سمعت رسول الله صلى الله عليه وسلم يقول: "مَن نَزَلَ مَنْزِلًا، ثُمَّ قالَ: أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ؛ لَمْ يَضُرَّهُ شَيءٌ حتَّى يَرْتَحِلَ مِن مَنْزِلِهِ ذلكَ"',
            source: "صحيح مسلم 2708",
          },
        ],
      },
      {
        id: 4,
        title: "البدأ بالمسجد إذا قدم من السفر",
        desc: "من السنة البدأ بالمسجد عند القدوم من سفر",
        ahadith: [
          {
            id: 1,
            title: 'عن كعب بن مالك رضي الله عنه قال: "...وكانَ إذَا قَدِمَ مِن سَفَرٍ، بَدَأَ بالمَسْجِدِ، فَيَرْكَعُ فيه رَكْعَتَيْنِ، ثُمَّ جَلَسَ لِلنَّاسِ..."',
            source: "صحيح البخاري 4418",
          },
        ],
      },
      {
        id: 5,
        title: "عدم سفر المرأة وحدها",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بالله واليَومِ الآخِرِ أنْ تُسافِرَ مَسِيرَةَ يَومٍ ولَيْلَةٍ ليسَ معها حُرْمَةٌ"',
            source: "صحيح البخاري 1088",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 2,
    title: "سنن اللباس",
    sunan: [
      {
        id: 1,
        title: "التَّيامُنُ عند لُبسِ الثِّيابِ",
        isFavorite: false,
        desc: "من السنة إذا أراد المسلم أن يلبس نعليه أن يبدأ باليمنى ، ومن السنة إذا أراد أن ينزع نعليه أن يبدأ باليسرى.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه أن الرسول صلى الله عليه وسلم قال: "إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ باليَمِينِ، وإذَا نَزَعَ فَلْيَبْدَأْ بالشِّمَالِ، لِيَكُنِ اليُمْنَى أَوَّلَهُما تُنْعَلُ، وَآخِرَهُما تُنْزَعُ".',
            source: "صحيح البخاري 5855",
          },
          {
            id: 2,
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"', 
            source: "صحيح بخاري 168",
          },
          {
            id: 3,
            title: 'عن أبي هُريرةَ رضي الله عنه، قال: قال رَسولُ الله صلَّى اللهُ عليه وسلَّم: "إذا لَبِستُم وإذا توضَّأتُم، فابدَؤوا بأيامِنِكم"',
            source: "صحيح أبي داود 4141",
          },
          {
            id: 4,
            title: 'عن حارثةَ بنِ وَهبٍ الخُزاعيِّ، قال: "حَدَّثَتْني حَفصةُ زَوجُ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يَجعَلُ يَمينَه لطعامِه وشَرابِه وثِيابِه، ويجعَلُ شِمالَه لِما سِوى ذلك"',
            source: "صحيح أبي داود 32",
          },
        ],
      },
      {
        id: 2,
        title: "دعاء ليس ثوب جديد",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخُدريِّ رضي الله عنه، قال: "كان رسولُ الله صلَّى اللهُ عليه وسلَّم: إذا استجَدَّ ثَوبًا سَمَّاه باسْمِه؛ إمَّا قميصًا أو عِمامةً، ثمَّ يقولُ: اللَّهُمَّ لك الحَمدُ أنت كسَوتَنِيه، أسألُك مِن خَيرِه وخَيرِ ما صُنِعَ له، وأعوذُ بك مِن شَرِّه وشَرِّ ما صُنِعَ له"',
            source: "الجامع الصغير 6544",
          },
          {
            id: 2,
            title: 'عن مُعاذِ بنِ أنَسٍ رضي الله عنه، أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "مَن لَبِسَ ثَوبًا فقال: الحَمدُ لله الذي كَساني هذا الثَّوبَ ورَزَقَنيه مِن غَيرِ حَولٍ مِنِّي ولا قُوَّةٍ، غُفِرَ له ما تقَدَّمَ مِن ذَنبِه"',
            source: "صحيح أبي داود 4023",
          },
        ],
      },
      {
        id: 3,
        title: "ما يقولُ مَن رأَى على أخيه ثوبًا جديدًا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أمِّ خالدٍ بنتِ خالدٍ رضي الله عنها، قالت: "أُتِيَ النَّبيُّ صلَّى اللهُ عليه وسلَّم بثيابٍ فيها خَميصةٌ سَوداءُ صَغيرةٌ، فقال: مَن تَرَونَ نكسو هذه؟ فسكَتَ القَومُ، قال: ائتُوني بأمِّ خالدٍ، فأُتِيَ بها تُحمَلُ، فأخَذَ الخميصةَ بِيَدِه فألبَسَها وقال: أبلِي وأخْلِقي. وكان فيها علَمٌ أخضَرُ أو أصفَرُ، فقال: يا أمَّ خالدٍ، هذا سَنَاهْ"',
            source: "صحيح البخاري 5823",
          },
        ],
      },
      {
        id: 4,
        title: "لُبسُ الأبيضِ مِن الثِّيابِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "البِسوا من ثيابِكُمُ البياضَ فإنَّها مِن خيرِ ثيابِكُم، وَكَفِّنوا فيها موتاكم"',
            source: "صحيح أبي داود 3878",
          },
        ],
      },
      {
        id: 5,
        title: "لُبسُ الثِّيابِ الجَميلةِ والحَسَنةِ بدونِ إسرافٍ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ مَسعودٍ رضي الله عنه، عن النبيِّ صلَّى اللهُ عليه وسلَّم قال: "لا يَدخُلُ الجَنَّةَ مَن كان في قَلبِه مِثقالُ ذَرَّةٍ مِن كِبرٍ، قال رجلٌ: إنَّ الرَّجُلَ يحِبُّ أن يكونَ ثَوبُه حسَنًا ونَعلُه حَسَنةً، قال: إنَّ اللهَ جَميلٌ يُحِبُّ الجَمالَ، الكِبرُ بطَرُ الحَقِّ، وغَمطُ النَّاسِ"',
            source: "صحيح مسلم 91",
          },
          {
            id: 2,
            title: 'عن عَمرِو بنِ شُعَيبٍ، عن أبيه، عن جَدِّه رضي الله عنه: أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "كُلُوا واشْرَبوا، وتصَدَّقوا والبَسُوا، في غَيرِ مَخِيلةٍ ولا سَرَفٍ؛ إنَّ اللهَ يُحِبُّ أن تُرى نِعمَتُه على عَبدِه"',
            source: "صحيح ابن ماجه 2920",
          },
        ],
      },
      {
        id: 7,
        title: "التواضُعُ في الثِّيابِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أُمامةَ رضي الله عنه، قال: "ذكَرَ أصحابُ رَسولِ الله صلَّى اللهُ عليه وسلَّم يومًا عِندَه الدُّنيا، فقال رسولُ الله صلَّى اللهُ عليه وسلَّم: ألا تَسْمَعونَ، ألا تَسْمَعونَ، إنَّ البَذاذةَ مِن الإيمانِ، إنَّ البَذاذةَ مِن الإيمانِ"',
            source: "صحيح أبي داود 4161",
          },
        ],
      },
      {
        id: 8,
        title: "نظافةُ المَلبَسِ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابرِ بنِ عبدِ اللهِ، قال: "أتانا رسولُ الله صلَّى اللهُ عليه وسلَّم، فرأى رجُلًا شَعِثًا قد تفَرَّقَ شَعرُه، فقال: أمَا كان يجِدُ هذا ما يُسَكِّنُ به شَعْرَه، ورأى رجلًا آخَرَ وعليه ثيابٌ وَسِخةٌ، فقال: أما كان هذا يجِدُ ماءً يَغسِلُ به ثَوبَه"',
            source: "السلسلة الصحيحة 493",
          },
        ],
      },
      {
        id: 9,
        title: "عدم المشيء في نعل واحد",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُريرةَ رَضِيَ اللهُ عنه، أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم قال: "لا يَمشي أحَدُكم في نَعلٍ واحدةٍ، لِيُحْفِهما جميعًا، أو لِيُنعِلْهما جميعًا"',
            source: "صحيح البخاري 5856",
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ نَهَى أَنْ يَأْكُلَ الرَّجُلُ بشِمَالِهِ، أَوْ يَمْشِيَ في نَعْلٍ وَاحِدَةٍ، وَأَنْ يَشْتَمِلَ الصَّمَّاءَ، وَأَنْ يَحْتَبِيَ في ثَوْبٍ وَاحِدٍ كَاشِفًا عن فَرْجِهِ"',
            source: "صحيح مسلم 2099",
          },
          {
            id: 3,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَمْشِ في نعْلٍ واحدٍ ، ولَا تَحْتَبِ في ثَوْبٍ واحِدٍ ، ولَا تَأْكُلْ بِشِمالِكَ ، ولَا تَشْتَمِلْ الصمَّاءَ ، ولَا تَضَعْ إحدَى رِجلَيكَ علَى الأخرَى إذا استَلْقَيْتَ"',
            source: "صحيح الجامع 7453",
          },
        ],
      },
      {
        id: 10,
        title: "عدم اشتمال الصماء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ نَهَى عن بَيْعَتَيْنِ، وعَنْ لِبْسَتَيْنِ وعَنْ صَلَاتَيْنِ: نَهَى عَنِ الصَّلَاةِ بَعْدَ الفَجْرِ حتَّى تَطْلُعَ الشَّمْسُ، وبَعْدَ العَصْرِ حتَّى تَغْرُبَ الشَّمْسُ، وعَنِ اشْتِمَالِ الصَّمَّاءِ، وعَنِ الِاحْتِبَاءِ في ثَوْبٍ واحِدٍ، يُفْضِي بفَرْجِهِ إلى السَّمَاءِ، وعَنِ المُنَابَذَةِ، والمُلَامَسَةِ"',
            source: "صحيح البخاري 584",
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ نَهَى أَنْ يَأْكُلَ الرَّجُلُ بشِمَالِهِ، أَوْ يَمْشِيَ في نَعْلٍ وَاحِدَةٍ، وَأَنْ يَشْتَمِلَ الصَّمَّاءَ، وَأَنْ يَحْتَبِيَ في ثَوْبٍ وَاحِدٍ كَاشِفًا عن فَرْجِهِ"',
            source: "صحيح مسلم 2099",
          },
          {
            id: 3,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَمْشِ في نعْلٍ واحدٍ ، ولَا تَحْتَبِ في ثَوْبٍ واحِدٍ ، ولَا تَأْكُلْ بِشِمالِكَ ، ولَا تَشْتَمِلْ الصمَّاءَ ، ولَا تَضَعْ إحدَى رِجلَيكَ علَى الأخرَى إذا استَلْقَيْتَ"',
            source: "صحيح الجامع 7453",
          },
        ],
      },
      {
        id: 11,
        title: "إستعمال الطيب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "حُبِّبَ إلي منَ الدُّنيا ، النساءُ ، والطِّيبُ ، وجُعِلَ قرةُ عيني في الصلاةِ"',
            source: "صحيح النسائي 3949",
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها قالت: "... وكانَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ يَشْتَدُّ عليه أنْ يُوجَدَ منه الرِّيحُ..."',
          },
          {
            id: 3,
            title: 'عن عَزْرةُ بنُ ثابتٍ الأنصاريُّ قال: دَخَلْتُ عليه فَنَاوَلَنِي طِيبًا، قالَ: كانَ أنَسٌ رَضِيَ الله عنْه لا يَرُدُّ الطِّيبَ. قالَ: وزَعَمَ أنَسٌ: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَرُدُّ الطِّيبَ"',
            source: "صحيح البخاري 2582",
          },
        ],
      },
      {
        id: 12,
        title: "عدم لبس الرجال للذهب والحرير",
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
          {
            id: 2,
            title: 'عن عليِّ بنِ أبي طالبٍ رضيَ اللهُ عنهُ قال : "إنَّ نبيَّ اللهِ صلَّى اللهُ عليْهِ وسلَّمَ أخذ حريرًا فجعلَه في يمينِه ، وأخذ ذهبًا فجعلَه في شمالِه ، ثم قال: إنَّ هذيْنِ حرامٌ على ذكورِ أمتي"',
            source: "صحيح أبي داود 4057",
          },
          {
            id: 3,
            title: 'عن علي بن أبي طالب رضي الله عنه قال: "نَهَانِي رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ عَنِ التَّخَتُّمِ بالذَّهَبِ، وَعَنْ لِبَاسِ القَسِّيِّ، وَعَنِ القِرَاءَةِ في الرُّكُوعِ وَالسُّجُودِ، وَعَنْ لِبَاسِ المُعَصْفَرِ"',
            source: "صحيح مسلم 2078",
          },
        ],
      },
      {
        id: 13,
        title: "ما يجِبُ على الرجُلِ سَترُه أمام الرِّجالِ",
        ahadith: [
          {
            id: 1,
            title: "",
          },
        ],
      },
    ],
  },
  //need 1 
  {
    id: 3,
    title: "سنن الوضوء",
    sunan: [
      {
        id: 1,
        title: "غسل الكفين ثلاثا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حمران مولى عثمان بن عفان رضي الله عنهما قال: "أنَّ عثمانَ دعا بوَضُوءٍ ، فتوضأَ ، فغسل كفيْه ثلاثَ مراتٍ ، ثم مضمض واستنشق ، ثم غسل وجهَه ثلاثَ مراتٍ ، ثم غسلَ يده اليمنى إلى المرفقِ ثلاثَ مراتٍ ، ثمَّ غسل يده اليسرى مثلَ ذلك ، ثم مسح برأسِه ، ثم غسل رجلَه اليمنى إلى الكعبين ثلاثَ مراتٍ ، ثم غسل رجلَه اليسرى مثلَ ذلك ، ثم قال : رأيتُ رسولَ اللهِ ، توضأ نحو وضوئي هذا ، ثم قال : قال رسولُ اللهِ : من توضَّأ نحو وضوئي هذا ثم قام فركع ركعتين لا يحدِّثُ فيهما نفسه غفِر له ما تقدم من ذنبِهِ"',
            source: "صحيح النسائي 116",
          },
        ],
      },
      {
        id: 2,
        title: "الإستنثار باليسار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عَمرو بن أبي حسَن: أنَّه "سأل عبدَ الله بنَ زيد عن وضوءِ النبيِّ صلَّى اللهُ عليه وسلَّم، فدعَا بتَورٍ من ماءٍ، فتوضَّأ لهم، فكفأَ على يديه فغسَلَهما ثلاثًا، ثم أدخَلَ يدَه في الإناءِ، فمضمَضَ واستنشَقَ، واستنثَرَ ثلاثًا بثلاثِ غرَفاتٍ من ماءٍ"',
            source: "",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا تَوَضَّأَ أحَدُكُمْ فَلْيَجْعَلْ في أنْفِهِ، ثُمَّ لِيَنْثُرْ، ومَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وإذَا اسْتَيْقَظَ أحَدُكُمْ مِن نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أنْ يُدْخِلَهَا في وَضُوئِهِ؛ فإنَّ أحَدَكُمْ لا يَدْرِي أيْنَ بَاتَتْ يَدُهُ"',
            source: "صحيح البخاري 162",
          },
          {
            id: 3,
            title: 'عن عليٍّ بن أبي طالب رَضِيَ اللهُ عنه "أنه دعا بوَضوءٍ، فتمَضمَضَ واستنشَقَ، ونثَرَ بِيَدِه اليُسرى، ففعلَ هذا ثلاثًا، ثم قال: هذا طُهورُ نبيِّ اللهِ صلَّى الله عليه وسلَّم"',
            source: "صحيح النسائي 91",
          },
        ],
      },
      {
        id: 3,
        title: "المبالغة في المضمضة والاستنشاق لغير الصائم",
        desc: "من السنة المبالغة في المضمضة والاستنشاق لغير الصائم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن لقيط بن صبرة رضي الله عنه ، أن النبي صلى الله عليه وسلم قال له: "...أسبغِ الوضوءَ وخلِّل بينَ الأصابعِ وبالِغْ فى الاستنشاقِ إلَّا أن تَكونَ صائمًا"',
            source: "صحيح أبي داود 142",
          },
        ],
      },
      {
        id: 4,
        title: "المضمضة والاستنشاق من كف واحدة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عَنْ عبدِ اللهِ بنِ زَيْدِ بنِ عاصِمٍ الأنْصارِيِّ، وكانَتْ له صُحْبَةٌ، قالَ: قيلَ له: تَوَضَّأْ لنا وُضُوءَ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: "فَدَعا بإناءٍ فأكْفَأَ مِنْها علَى يَدَيْهِ فَغَسَلَهُما ثَلاثًا، ثُمَّ أدْخَلَ يَدَهُ فاسْتَخْرَجَها فَمَضْمَضَ، واسْتَنْشَقَ مِن كَفٍّ واحِدَةٍ فَفَعَلَ ذلكَ ثَلاثًا، ثُمَّ أدْخَلَ يَدَهُ فاسْتَخْرَجَها فَغَسَلَ وجْهَهُ ثَلاثًا، ثُمَّ أدْخَلَ يَدَهُ فاسْتَخْرَجَها فَغَسَلَ يَدَيْهِ إلى المِرْفَقَيْنِ مَرَّتَيْنِ مَرَّتَيْنِ، ثُمَّ أدْخَلَ يَدَهُ فاسْتَخْرَجَها فَمَسَحَ برَأْسِهِ فأقْبَلَ بيَدَيْهِ وأَدْبَرَ، ثُمَّ غَسَلَ رِجْلَيْهِ إلى الكَعْبَيْنِ، ثُمَّ قالَ هَكَذا كانَ وُضُوءُ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ." وفي رواية: ولَمْ يَذْكُرِ الكَعْبَيْنِ',
            source: "صحيح مسلم 235",
          },
        ],
      },
      {
        id: 5,
        title: "السواك",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أن رسول الله صلى الله عليه وسلم قال: "لَوْلَا أنْ أشُقَّ علَى أُمَّتي أوْ علَى النَّاسِ لَأَمَرْتُهُمْ بالسِّوَاكِ مع كُلِّ صَلَاةٍ"',
            source: "صحيح البخاري 887",
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها قالت: "كنَّا نعدُّ لَهُ سواكَهُ وطُهورَهُ فيبعثُهُ الله لما شاءَ أن يبعثَهُ منَ اللَّيلِ فيتسوَّكُ ويتوضَّأُ ويصلِّي ثماني رَكعاتٍ لاَ يجلسُ فيهنَّ إلاَّ عندَ الثَّامنةِ فيجلسُ فيذْكرُ اللَّهَ عزَّ وجلَّ ويدعو ثمَّ يسلِّمُ تسليمًا يسمعنا"',
            source: "صحيح النسائي 1314",
          },
        ],
      },
      {
        id: 6,
        title: "تخليل اللحية عند غسل الوجه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه قال: "أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يُخَلِّلُ لِحْيَتَهُ"',
            source: "سنن الترمذي 31",
          },
        ],
      },
      {
        id: 7,
        title: "في مسح الرأس تسن الصفة المسنونة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن زيد رضي الله عنه - في صفة وضوء النبي صلى الله عليه وسلم - "أنَّ رَجُلًا قَالَ لِعَبْدِ الله بنِ زَيْدٍ، وهو جَدُّ عَمْرِو بنِ يَحْيَى: أتَسْتَطِيعُ أنْ تُرِيَنِي، كيفَ كانَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ يَتَوَضَّأُ؟ فَقَالَ عبدُ الله بنُ زَيْدٍ: نَعَمْ، فَدَعَا بمَاءٍ، فأفْرَغَ علَى يَدَيْهِ فَغَسَلَ مَرَّتَيْنِ، ثُمَّ مَضْمَضَ واسْتَنْثَرَ ثَلَاثًا، ثُمَّ غَسَلَ وجْهَهُ ثَلَاثًا، ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ إلى المِرْفَقَيْنِ، ثُمَّ مَسَحَ رَأْسَهُ بيَدَيْهِ، فأقْبَلَ بهِما وأَدْبَرَ، بَدَأَ بمُقَدَّمِ رَأْسِهِ حتَّى ذَهَبَ بهِما إلى قَفَاهُ، ثُمَّ رَدَّهُما إلى المَكَانِ الذي بَدَأَ منه، ثُمَّ غَسَلَ رِجْلَيْهِ"',
            source: "صحيح البخاري 185",
          },
        ],
      },
      {
        id: 8,
        title: "التيامن في غسل اليدين والقدمين",
        isFavorite: false,
        desc: "من السنة التيامن في غسل اليدين والقدمين في الوضوء.",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"',
            source: "صحيح البخاري 168",
          },
          {
            id: 2,
            title: 'عن أبي هُريرةَ رضي الله عنه، قال: قال رَسولُ الله صلَّى اللهُ عليه وسلَّم: "إذا لَبِستُم وإذا توضَّأتُم، فابدَؤوا بأيامِنِكم"',
            source: "صحيح أبي داود 4141",
          },
        ],
      },
      {
        id: 9,
        title: "التثليث في غسل الأعضاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حُمرانَ مولى عثمان بن عفان أنَّهُ، "رَأَى عُثْمَانَ بنَ عَفَّانَ دَعَا بإنَاءٍ، فأفْرَغَ علَى كَفَّيْهِ ثَلَاثَ مِرَارٍ، فَغَسَلَهُمَا، ثُمَّ أدْخَلَ يَمِينَهُ في الإنَاءِ، فَمَضْمَضَ، واسْتَنْشَقَ، ثُمَّ غَسَلَ وجْهَهُ ثَلَاثًا، ويَدَيْهِ إلى المِرْفَقَيْنِ ثَلَاثَ مِرَارٍ، ثُمَّ مَسَحَ برَأْسِهِ، ثُمَّ غَسَلَ رِجْلَيْهِ ثَلَاثَ مِرَارٍ إلى الكَعْبَيْنِ، ثُمَّ قالَ: قالَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ مَن تَوَضَّأَ نَحْوَ وُضُوئِي هذا، ثُمَّ صَلَّى رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِما نَفْسَهُ، غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ"',
            source: "صحيح البخاري 159",
          },
        ],
      },
     
      {
        id: 11,
        title: "الوضوء في البيت",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن تَطَهَّرَ في بَيْتِهِ، ثُمَّ مَشَى إلى بَيْتٍ مَن بُيُوتِ اللهِ لِيَقْضِيَ فَرِيضَةً مِن فَرَائِضِ اللهِ، كَانَتْ خَطْوَتَاهُ إحْدَاهُما تَحُطُّ خَطِيئَةً، وَالأُخْرَى تَرْفَعُ دَرَجَةً"',
            source: "صحيح مسلم 666",
          },
        ],
      },    
      {
        id: 14,
        title: "مجاوزة محل الفرض في اليدين والرجلين",
        ahadith: [
          {
            id: 1,
            title: 'عن نُعَيْمٌ المُجْمِرُ رضي الله عنه قال: "رَأَيْتُ أبا هُرَيْرَةَ يَتَوَضَّأُ فَغَسَلَ وجْهَهُ فأسْبَغَ الوُضُوءَ، ثُمَّ غَسَلَ يَدَهُ اليُمْنَى حتَّى أشْرَعَ في العَضُدِ، ثُمَّ يَدَهُ اليُسْرَى حتَّى أشْرَعَ في العَضُدِ، ثُمَّ مَسَحَ رَأْسَهُ، ثُمَّ غَسَلَ رِجْلَهُ اليُمْنَى حتَّى أشْرَعَ في السَّاقِ، ثُمَّ غَسَلَ رِجْلَهُ اليُسْرَى حتَّى أشْرَعَ في السَّاقِ، ثُمَّ قالَ: هَكَذا رَأَيْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يَتَوَضَّأُ. وقالَ: قالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: أنْتُمُ الغُرُّ المُحَجَّلُونَ يَومَ القِيامَةِ مِن إسْباغِ الوُضُوءِ، فَمَنِ اسْتَطاعَ مِنْكمْ فَلْيُطِلْ غُرَّتَهُ وتَحْجِيلَهُ"',
            source: "صحيح مسلم 246",
          },
        ],
      },    
      {
        id: 17,
        title: "غسل الرجلين إلى الكوعين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: تَخَلَّفَ عَنَّا النبيُّ صَلَّى اللهُ عليه وسلَّمَ في سَفْرَةٍ سَافَرْنَاهَا فأدْرَكَنَا - وقدْ أرْهَقَتْنَا الصَّلَاةُ - ونَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ علَى أرْجُلِنَا، فَنَادَى بأَعْلَى صَوْتِهِ: "ويْلٌ لِلْأَعْقَابِ مِنَ النَّارِ مَرَّتَيْنِ أوْ ثَلَاثًا"',
            source: "صحيح البخاري 60",
          },
        ],
      },
      {
        id: 18,
        title: "تخليل أصابع اليدين والرجلين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن لقيط بن صبرة رضي الله عنه ، أن النبي صلى الله عليه وسلم قال له: "...أسبغِ الوضوءَ وخلِّل بينَ الأصابعِ وبالِغْ فى الاستنشاقِ إلَّا أن تَكونَ صائمًا"',
            source: "صحيح أبي داود 142",
          },
        ],
      },
      {
        id: 19,
        title: "إسباغ الوضوء",
        ahadith: [
          {
            id: 1,
            title: 'عن لقيط بن صبرة رضي الله عنه ، أن النبي صلى الله عليه وسلم قال له: "...أسبغِ الوضوءَ وخلِّل بينَ الأصابعِ وبالِغْ فى الاستنشاقِ إلَّا أن تَكونَ صائمًا"',
            source: "صحيح أبي داود 142",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَلا أدُلُّكُمْ علَى ما يَمْحُو الله به الخَطايا، ويَرْفَعُ به الدَّرَجاتِ؟" قالُوا بَلَى يا رَسولَ اللهِ، قالَ: "إسْباغُ الوُضُوءِ علَى المَكارِهِ، وكَثْرَةُ الخُطا إلى المَساجِدِ، وانْتِظارُ الصَّلاةِ بَعْدَ الصَّلاةِ، فَذَلِكُمُ الرِّباطُ." وليسَ في حَديثِ شُعْبَةَ ذِكْرُ الرِّباطِ. وفي حَديثِ مالِكٍ ثِنْتَيْنِ "فَذَلِكُمُ الرِّباطُ، فَذَلِكُمُ الرِّباطُ"',
            source: "صحيح مسلم 251"
          },
          {
            id: 3,
            title: 'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن تَوَضَّأَ فأحْسَنَ الوُضُوءَ خَرَجَتْ خَطَايَاهُ مِن جَسَدِهِ، حتَّى تَخْرُجَ مِن تَحْتِ أَظْفَارِهِ"',
            source: "صحيح مسلم 245",
          },
        ],
      },
      //others
      {
        id: 13,
        title: "الاقتصاد في الماء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَغْسِلُ، أوْ كانَ يَغْتَسِلُ، بالصَّاعِ إلى خَمْسَةِ أمْدَادٍ، ويَتَوَضَّأُ بالمُدِّ"',
            source: "صحيح البخاري 201",
          },
        ],
      },
      //after wudu
      {
        id: 16,
        title: "تجديد الوضوء لكل صلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَتَوَضَّأُ عِنْدَ كُلِّ صَلَاةٍ قُلتُ: كيفَ كُنْتُمْ تَصْنَعُونَ؟ قالَ: يُجْزِئُ أحَدَنَا الوُضُوءُ ما لَمْ يُحْدِثْ"',
            source: "صحيح البخاري 214",
          },
        ],
      },    
      {
        id: 20,
        title: "ما يقال بعد الوضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عقبة بن عامر رضي الله عنه قال: كانَتْ عليْنا رِعايَةُ الإبِلِ فَجاءَتْ نَوْبَتي فَرَوَّحْتُها بعَشِيٍّ فأدْرَكْتُ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ قائِمًا يُحَدِّثُ النَّاسَ فأدْرَكْتُ مِن قَوْلِهِ: "ما مِن مُسْلِمٍ يَتَوَضَّأُ فيُحْسِنُ وُضُوءَهُ، ثُمَّ يَقُومُ فيُصَلِّي رَكْعَتَيْنِ، مُقْبِلٌ عليهما بقَلْبِهِ ووَجْهِهِ، إلَّا وجَبَتْ له الجَنَّةُ" قالَ: فَقُلتُ: ما أجْوَدَ هذِه! فإذا قائِلٌ بيْنَ يَدَيَّ يقولُ: الَّتي قَبْلَها أجْوَدُ، فَنَظَرْتُ فإذا عُمَرُ، قالَ: إنِّي قدْ رَأَيْتُكَ جِئْتَ آنِفًا، قالَ: "ما مِنكُم مِن أحَدٍ يَتَوَضَّأُ فيُبْلِغُ، أوْ فيُسْبِغُ، الوَضُوءَ ثُمَّ يقولُ: أشْهَدُ أنْ لا إلَهَ إلَّا الله وأنَّ مُحَمَّدًا عبدُ اللهِ ورَسولُهُ؛ إلَّا فُتِحَتْ له أبْوابُ الجَنَّةِ الثَّمانِيَةُ يَدْخُلُ مِن أيِّها شاءَ." وفي رواية: فَذَكَرَ مِثْلَهُ غيرَ أنَّه قالَ: "مَن تَوَضَّأَ فقالَ أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ"',
            source: "صحيح مسلم 234",
          },
          {
            id: 2,
            title: 'عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من توضأ فأحسن الوضوءَ ثم قال : "أشهد أن لا إله الا اللهُ وحده لا شريك له، وأشهد أنَّ محمدًا عبدُه ورسولُه . اللهم اجعلني من التوابين، واجعلني من المتطهِّرين"، فُتحت له ثمانيةُ أبوابِ الجنةِ، يدخل من أيّها شاءَ',
            source: "صحيح الترمذي 55",
          },
        ],
      },
      {
        id: 21,
        title: "صلاة ركعتين بعد الوضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عَنْ حُمْرَانَ مَوْلَى عُثْمَانَ بنِ عَفَّانَ أنَّه رَأَى عُثْمَانَ بنَ عَفَّانَ دَعَا بوَضُوءٍ، فأفْرَغَ علَى يَدَيْهِ مِن إنَائِهِ، فَغَسَلَهُما ثَلَاثَ مَرَّاتٍ، ثُمَّ أدْخَلَ يَمِينَهُ في الوَضُوءِ، ثُمَّ تَمَضْمَضَ واسْتَنْشَقَ واسْتَنْثَرَ، ثُمَّ غَسَلَ وجْهَهُ ثَلَاثًا ويَدَيْهِ إلى المِرْفَقَيْنِ ثَلَاثًا، ثُمَّ مَسَحَ برَأْسِهِ، ثُمَّ غَسَلَ كُلَّ رِجْلٍ ثَلَاثًا، ثُمَّ قالَ: رَأَيْتُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ يَتَوَضَّأُ نَحْوَ وُضُوئِي هذا، وقالَ: "مَن تَوَضَّأَ نَحْوَ وُضُوئِي هذا، ثُمَّ صَلَّى رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِما نَفْسَهُ، غَفَرَ الله له ما تَقَدَّمَ مِن ذَنْبِهِ"',
            source: "صحيح البخاري 164",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 4,
    title: "سنن الأذان",
    sunan: [
      {
        id: 1,
        title: "متابعة المؤذن",
        isFavorite: false,
        desc: 'من السنة لمن سمع الأذان أن يقول مثل ما يقول المؤذن ، إلا في الحيعلتين ، فيقول "لا حول ولا قوة إلا بالله"',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
          {
            id: 2,
            title: 'عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا قالَ المُؤَذِّنُ: الله أكْبَرُ الله أكْبَرُ، فقالَ أحَدُكُمْ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، ثُمَّ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ، ثُمَّ قالَ: حَيَّ علَى الصَّلاةِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: حَيَّ علَى الفَلاحِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: الله أكْبَرُ الله أكْبَرُ، قالَ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: لا إلَهَ إلَّا الله، قالَ: لا إلَهَ إلَّا الله ، مِن قَلْبِهِ دَخَلَ الجَنَّةَ"',
            source: "صحيح مسلم 385",
          },
        ]
      },
      {
        id: 2,
        title: "الصلاة على النبي ﷺ بعد الأذان",
        desc: "من السنة الصلاة على النبي صلى الله عليه وسلم بعد الأذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
        ],
      },
      {
        id: 3,
        title: "سؤالُ الوسيلةِ والفَضيلةِ والمقامِ المحمودِ للنبيِّ صلَّى اللهُ عليه وسلَّم",
        desc: "من السنة سؤالُ الوسيلةِ والفَضيلةِ والمقامِ المحمودِ للنبيِّ صلَّى اللهُ عليه وسلَّم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قالَ حِينَ يَسْمَعُ النِّدَاءَ: "اللَّهُمَّ رَبَّ هذِه الدَّعْوَةِ التَّامَّةِ، والصَّلَاةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ والفَضِيلَةَ، وابْعَثْهُ مَقَامًا مَحْمُودًا الذي وعَدْتَهُ"، حَلَّتْ له شَفَاعَتي يَومَ القِيَامَةِ',
            source: "صحيح البخاري 614",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
            source: "صحيح مسلم 384",
          },
        ],
      },
      {
        id: 4,
        title: "قول الذكر المخصوص بعد الشهادتين",
        desc: "من السنة قول الذكر المخصوص بعد الشهادتين.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قالَ حِينَ يَسْمَعُ المُؤَذِّنَ أشْهَدُ أنْ لا إلَهَ إلَّا الله وحْدَهُ لا شَرِيكَ له، وأنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ، رَضِيتُ بالله رَبًّا وبِمُحَمَّدٍ رَسولًا، وبالإسْلَامِ دِينًا، غُفِرَ له ذَنْبُهُ"',
            source: "صحيح مسلم 386"
          },
        ],
      },
      {
        id: 5,
        title: "الدعاء بين الأذان والإقامة",
        desc: "من السنة الدعاء بين الأذان والإقامة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: أن رجلًا قال: يا رسولَ اللهِ، إن المؤذنين يَفْضِلوننا ؟ فقال رسولُ اللهِ صلى الله عليه وسلم: "قلْ كما يقولون، فإذا انتهيتَ فسلْ تُعْطَه"',
            source: "صحيح أبي داود 524",
          },
          {
            id: 2,
            title: 'عن أنسِ بنِ مالكٍ رَضِيَ اللهُ عَنْه قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "الدُّعاءُ لا يُرَدُّ بين الأذانِ والإقامةِ؛ فادْعوا"',
            source: "تخريج المسند لشعيب 13357",
          },
          {
            id: 3,
            title: 'عن سهلِ بنِ سعدٍ رَضِيَ اللهُ عَنْه أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "ثِنتانِ لا تُردَّانِ، أو قلَّما تُردَّانِ: الدُّعاءُ عند النِّداءِ، وعندَ البأسِ حين يُلحِمُ بعضُهم بعضًا"',
            source: "صحيح أبي داود 2540",
          },
        ],
      },
      {
        id: 6,
        title: "عدم الخروج من المسجد بعد الأذان",
        desc: "من السنة عدم الخروج من المسجد بعد الأذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عنِ أبي الشَّعثاءِ، قال: كنَّا قعودًا في المسجدِ مع أبي هُرَيرةَ، فأذَّنَ المُؤذِّنُ، فقام رجلٌ من المسجد يَمشي، فأتْبعَه أبو هريرةَ بصرَه حتى خرَجَ من المسجدِ، فقال أبو هريرةَ: "أمَّا هذا فقد عصَى أبا القاسمِ صلَّى اللهُ عليه وسلَّم"',
            source: "صحيح مسلم 655",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 5,
    title: "سنن النوم",
    sunan: [
      {
        id: 1,
        title: "النوم على وضوء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن جبل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما من مسلمٍ يَبِيتُ على ذِكْرٍ طاهرًا فيَتعارَّ من الليلِ فيسألُ اللهَ خيرًا من الدنيا والآخرةِ إلا أعطاه إياه"',
            source: "صحيح أبي داود 5042",
          },
          {
            id: 2,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا أتَيْتَ مَضْجَعَكَ، فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ علَى شِقِّكَ الأيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أسْلَمْتُ وجْهِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَأَ ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ، فإنْ مُتَّ مِن لَيْلَتِكَ، فأنْتَ علَى الفِطْرَةِ، واجْعَلْهُنَّ آخِرَ ما تَتَكَلَّمُ بهِ." قالَ: فَرَدَّدْتُهَا علَى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، قُلتُ: ورَسولِكَ، قالَ: "لَا، ونَبِيِّكَ الذي أرْسَلْتَ"',
            source: "صحيح البخاري 247",
          },
        ],
      },
      {
        id: 2,
        title: "نفض الفراش",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أوَى أحَدُكُمْ إلى فِراشِهِ، فَلْيَنْفُضْ فِراشَهُ بداخِلَةِ إزارِهِ؛ فإنَّه لا يَدْرِي ما خَلَفَهُ عليه، ثُمَّ يقولُ: باسْمِكَ رَبِّ، وضَعْتُ جَنْبِي، وبِكَ أرْفَعُهُ، إنْ أمْسَكْتَ نَفْسِي فارْحَمْها، وإنْ أرْسَلْتَها فاحْفَظْها بما تَحْفَظُ به عِبادَكَ الصَّالِحِينَ"',
            source: "صحيح البخاري 6320"
          },
        ],
      },
      {
        id: 3,
        title: "قراءة سورة الإخلاص والمعوذتين قبل النوم مع النفث في الكفين ومسح ما تقدم من جسده ثلاثا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم كانَ إذا أوَى إلى فِراشِهِ كُلَّ لَيْلَةٍ جَمَع كَفَّيْهِ، ثُمَّ نَفَثَ فِيهِما، فَقَرَأَ فِيهِما: {قُلْ هُوَ اللَّهُ أَحَدٌ}، و{قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ}، و{قُلْ أَعُوذُ بِرَبِّ النَّاسِ}، ثُمَّ يَمْسَحُ بهِما ما اسْتَطاعَ مِن جَسَدِهِ، يَبْدَأُ بهِما علَى رَأْسِهِ ووَجْهِهِ وما أقْبَلَ مِن جَسَدِهِ، يَفْعَلُ ذلكَ ثَلاثَ مَرَّاتٍ"',
            source: "صحيح البخاري 5017",
          },
        ],
      },
      {
        id: 4,
        title: "قراءة الآيتين الأخيرتين من سورة البقرة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مسعود عقبة بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الآيَتانِ مِن آخِرِ سُورَةِ البَقَرَةِ، مَن قَرَأَهُما في لَيْلَةٍ كَفَتاهُ"',
            source: "صحيح البخاري 4008",
          },
        ],
      },
      {
        id: 5,
        title: "قراءة سورة السجدة وسورة الملك قبل النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "كَانَ لا يَنامُ حتى يقرأَ {الم تَنْزِيلُ} السَّجْدَةُ ، و {تَبارَكَ الذي بيدِهِ الملكُ}"',
            source: "السلسلة الصحيحة 585",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: "سورةُ تبارك هي المانعةُ من عذابِ القبرِ"',
            source: "صحيح الجامع 3643",
          },
        ],
      },
      {
        id: 6,
        title: "قراءة سورة الكافرون",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن فروة بن نوفل رضي الله عنه أنَّهُ أتَى النَّبيَّ صلَّى الله علَيهِ وسلَّمَ فقالَ : يا رسولَ الله علِّمني شيئًا أقولُهُ إذا أوَيتُ إلى فِراشي ، فقالَ: "اقرأ: قُلْ يَا أَيُّهَا الْكَافِرُونَ فإنَّها براءةٌ منَ الشِّركِ"',
            source: "صحيح الترمذي 3403",
          },
        ],
      },
      {
        id: 7,
        title: "ما يقال قبل النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أوَى أحَدُكُمْ إلى فِراشِهِ، فَلْيَنْفُضْ فِراشَهُ بداخِلَةِ إزارِهِ؛ فإنَّه لا يَدْرِي ما خَلَفَهُ عليه، ثُمَّ يقولُ: باسْمِكَ رَبِّ، وضَعْتُ جَنْبِي، وبِكَ أرْفَعُهُ، إنْ أمْسَكْتَ نَفْسِي فارْحَمْها، وإنْ أرْسَلْتَها فاحْفَظْها بما تَحْفَظُ به عِبادَكَ الصَّالِحِينَ"',
            source: "صحيح البخاري 6320",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه أنَّهُ أَمَرَ رَجُلًا إذَا أَخَذَ مَضْجَعَهُ قالَ: "اللَّهُمَّ خَلَقْتَ نَفْسِي، وَأَنْتَ تَوَفَّاهَا، لكَ مَمَاتُهَا وَمَحْيَاهَا، إنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وإنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إنِّي أَسْأَلُكَ العَافِيَةَ." فَقالَ له رَجُلٌ: أَسَمِعْتَ هذا مِن عُمَرَ؟ فَقالَ: "مِن خَيْرٍ مِن عُمَرَ؛ مِن رَسولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ"',
            source: "صحيح مسلم 2712",
          },
          {
            id: 3,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، كانَ إذَا أَوَى إلى فِرَاشِهِ، قالَ: الحَمْدُ لِلَّهِ الذي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا وَآوَانَا، فَكَمْ مِمَّنْ لا كَافِيَ له وَلَا مُؤْوِيَ"',
            source: "صحيح مسلم 2715",
          },
          {
            id: 4,
            title: 'عن أبي هريرة رضي الله عنه قال: أن أبا بكرٍ الصديقَ رضي الله عنه قال يا رسولَ اللهِ مرني بكلماتٍ أقولُهُن إذا أصبحتُ وإذا أمسيتُ, "قال قل: اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه. قال: قلْها إذا أصبحتَ, وإذا أمسيتَ، وإذا أخذتَ مضجعَك"',
            source: "صحيح أبي داود 5067",
          },
          {
            id: 5,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا أتَيْتَ مَضْجَعَكَ، فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ علَى شِقِّكَ الأيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أسْلَمْتُ وجْهِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَأَ ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ، فإنْ مُتَّ مِن لَيْلَتِكَ، فأنْتَ علَى الفِطْرَةِ، واجْعَلْهُنَّ آخِرَ ما تَتَكَلَّمُ بهِ." قالَ: فَرَدَّدْتُهَا علَى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، قُلتُ: ورَسولِكَ، قالَ: "لَا، ونَبِيِّكَ الذي أرْسَلْتَ"',
            source: "صحيح البخاري 247",
          },
          {
            id: 6,
            title: 'عن أبي هريرة رضي الله عنه قال: أتت فاطمةُ النَّبيَّ صلَّى الله عليهِ وسلَّمَ تسألُهُ خادمًا فقالَ لَها: ما عندي ما أعطيكِ . فرجَعت فأتاها بعدَ ذلِكَ فقالَ: الَّذي سألتِ أحبُّ إليكِ أو ما هوَ خيرٌ منهُ ؟ فقالَ لَها عليٌّ: قولي لَا بل ما هوَ خيرٌ منهُ فقالَت: فقالَ: قولي: "اللَّهمَّ ربَّ السَّماواتِ السَّبعِ وربَّ العرشِ العظيمِ ربَّنا وربَّ كلِّ شيءٍ مُنْزِلَ التَّوراةِ والإنجيلِ والقرآنِ العظيمِ أنتَ الأوَّلُ فليسَ قبلَكَ شيءٌ وأنتَ الآخرُ فليسَ بعدَكَ شيءٌ وأنتَ الظَّاهرُ فليسَ فوقَكَ شيءٌ وأنتَ الباطنُ فليسَ دونَكَ شيءٌ اقضِ عنَّا الدَّينَ وأغنِنا منَ الفقرِ"',
            source: "صحيح ابن ماجه 3104",
          },
          {
            id: 7,
            title: 'عن حفصة أم المؤمنين رضي الله عنها قالت: "أن رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، كان إذا أراد أن يَرْقُدَ وضع يدَه اليمنى تحتَ خَدِّهِ ثم يقول : اللهم قِنِي عذابَك يوم تبعثُ عبادَك - ثلاثَ مِرارٍ"',
            source: "صحيح أبي داود 5045",
          },
          {
            id: 8,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: كانَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أرَادَ أنْ يَنَامَ قالَ: "باسْمِكَ اللَّهُمَّ أمُوتُ وأَحْيَا"، وإذَا اسْتَيْقَظَ مِن مَنَامِهِ قالَ: "الحَمْدُ لله الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ"',
            source: "صحيح البخاري 6324",
          },
        ],
      },    
      {
        id: 8,
        title: "التكبير 34 والتسبيح 33 والتحميد 33 عند المنام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن علي بن أبي طالب رضي الله عنه قال: "أنَّ فَاطِمَةَ عَلَيْهَا السَّلَامُ شَكَتْ ما تَلْقَى مِن أثَرِ الرَّحَا، فأتَى النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ سَبْيٌ، فَانْطَلَقَتْ فَلَمْ تَجِدْهُ، فَوَجَدَتْ عَائِشَةَ فأخْبَرَتْهَا، فَلَمَّا جَاءَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ أخْبَرَتْهُ عَائِشَةُ بمَجِيءِ فَاطِمَةَ، فَجَاءَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إلَيْنَا وقدْ أخَذْنَا مَضَاجِعَنَا، فَذَهَبْتُ لِأقُومَ، فَقَالَ: علَى مَكَانِكُمَا. فَقَعَدَ بيْنَنَا حتَّى وجَدْتُ بَرْدَ قَدَمَيْهِ علَى صَدْرِي، وقَالَ: ألَا أُعَلِّمُكُما خَيْرًا ممَّا سَأَلْتُمَانِي؟ إذَا أخَذْتُما مَضَاجِعَكُما تُكَبِّرَا أرْبَعًا وثَلَاثِينَ، وتُسَبِّحَا ثَلَاثًا وثَلَاثِينَ، وتَحْمَدَا ثَلَاثًا وثَلَاثِينَ؛ فَهو خَيْرٌ لَكُما مِن خَادِمٍ"',
            source: "صحيح البخاري 3705",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمرو رضي الله عنهما  قال: قال رسول الله صلى الله عليه وسلم: "خصلتان، أو خلتان لا يحافظُ عليهما عبدٌ مسلمٌ إلا دخل الجنةَ، هما يسيرٌ، ومن يعملُ بهما قليلٌ، يسبِّحً في دُبُرِ كلِّ صلاةٍ عشْرًا، ويحمَدَ عشْرًا ، ويكبِّرُ عشْرًا، فذلك خمسون ومائةٌ باللسانِ، وألفٌ وخمسمائةٍ في الميزانِ، ويكبِّرُ أربعًا وثلاثين إذا أخذ مضجعَه ، ويحمَدُ ثلاثًا وثلاثين ، ويسبِّحُ ثلاثًا وثلاثين ، فذلك مائةٌ باللسانِ ، وألفٌ في الميزانِ." فلقد رأيتُ رسولُ اللهِ صلى الله عليه وسلم يعقِدُها بيدِه ، قالوا: يا رسولَ اللهِ ، كيف هما يسيرٌ ومن يعملُ بهما قليلٌ؟ قال: "يأتي أحدَكم – يعني الشيطانَ – في منامِه فيُنَوِّمُه قبل أن يقولَه ، ويأتيه في صلاتِه فيُذَكِّرَه حاجةً قبلَ أن يقولَها"',
            source: "صحيح أبي داود 5065",
          },
        ],
      },
      {
        id: 9,
        title: "وضع اليد اليمنى تحت الخد الأيمن مع الدعاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حفصة أم المؤمنين رضي الله عنها قالت: "أن رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، كان إذا أراد أن يَرْقُدَ وضع يدَه اليمنى تحتَ خَدِّهِ ثم يقول : اللهم قِنِي عذابَك يوم تبعثُ عبادَك - ثلاثَ مِرارٍ"',
            source: "صحيح أبي داود 5045",
          },
        ],
      }, 
      {
        id: 11,
        title: "النوم على الشق الأيمن",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا أتَيْتَ مَضْجَعَكَ، فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ علَى شِقِّكَ الأيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أسْلَمْتُ وجْهِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَأَ ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ، فإنْ مُتَّ مِن لَيْلَتِكَ، فأنْتَ علَى الفِطْرَةِ، واجْعَلْهُنَّ آخِرَ ما تَتَكَلَّمُ بهِ." قالَ: فَرَدَّدْتُهَا علَى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، قُلتُ: ورَسولِكَ، قالَ: "لَا، ونَبِيِّكَ الذي أرْسَلْتَ"',
            source: "صحيح البخاري 247",
          },
        ],
      },
      {
        id: 12,
        title: "عدم النوم على البطن",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "رأى رسولُ الله صلَّى اللههُ عليهِ وسلَّمَ رجلًا مُضطجِعًا علَى بطنِهِ فقالَ إنَّ هذهِ ضِجعةٌ لا يحبُّها الله"',
            source: "صحيح الجامع 2270",
          },
        ],
      },
      {
        id: 13,
        title: "غسل اليدين من الطعام قبل النوم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من نام وفي يدهِ غمرٌ ولم يغسلْهُ فأصابه شيءٌ ، فلا يلومنَّ إلَّا نفسَه"',
            source: "صحيح أبي داود 3852",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 6,
    title: "سنن الاستيقاظ",
    sunan: [
      {
        id: 1,
        title: "السواك عند الإستيقاظ في الليل",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا قَامَ مِنَ اللَّيْلِ، يَشُوصُ فَاهُ بالسِّوَاكِ"',
            source: "صحيح البخاري 245",
          },
        ],
      },
      {
        id: 2,
        title: "مسح أثر النوم عن الوجه باليد",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن العباس رضي الله عنه قال: "أنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ وهي خَالَتُهُ فَاضْطَجَعْتُ في عَرْضِ الوِسَادَةِ واضْطَجَعَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ وأَهْلُهُ في طُولِهَا، فَنَامَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، حتَّى إذَا انْتَصَفَ اللَّيْلُ، أوْ قَبْلَهُ بقَلِيلٍ أوْ بَعْدَهُ بقَلِيلٍ، اسْتَيْقَظَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، فَجَلَسَ يَمْسَحُ النَّوْمَ عن وجْهِهِ بيَدِهِ، ثُمَّ قَرَأَ العَشْرَ الآيَاتِ الخَوَاتِمَ مِن سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إلى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ منها فأحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي. قَالَ ابنُ عَبَّاسٍ: فَقُمْتُ فَصَنَعْتُ مِثْلَ ما صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إلى جَنْبِهِ، فَوَضَعَ يَدَهُ اليُمْنَى علَى رَأْسِي، وأَخَذَ بأُذُنِي اليُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أوْتَرَ، ثُمَّ اضْطَجَعَ حتَّى أتَاهُ المُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ"',
            source: "صحيح البخاري 183",
          },
        ],
      },
      {
        id: 3,
        title: "دعاء الإستيقاظ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: كانَ النَّبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أرَادَ أنْ يَنَامَ قالَ: "باسْمِكَ اللَّهُمَّ أمُوتُ وأَحْيَا"، وإذَا اسْتَيْقَظَ مِن مَنَامِهِ قالَ: "الحَمْدُ لله الذي أحْيَانَا بَعْدَ ما أمَاتَنَا وإلَيْهِ النُّشُورُ"',
            source: "صحيح البخاري 6324",
          },
        ],
      },
      {
        id: 4,
        title: "الدعاء حين الإستيقاظ أثناء النوم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبادة بن الصامت رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من تعارَّ مِنَ اللَّيلِ فقال حينَ يَستيقِظُ: لا إلهَ إلَّا اللهُ وَحْدَه لا شريكَ له، له المُلْكُ وله الحمدُ وهو على كلِّ شَيءٍ قديرٌ، سبحان الله، والحمدُ لله، ولا إلهَ إلَّا اللهُ، والله أكبَرُ، ولا حولَ ولا قوَّةَ إلا بالله، ثمَّ دعا: ربِّ اغفِرْ لي؛ استُجيبَ له، فإن قام فتوضأ ثمَّ صلَّى قُبِلَت صلاتُه"',
            source: "صحيح البخاري 1154",
          },
        ],
      },
      {
        id: 5,
        title: "الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبادة بن الصامت رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من تعارَّ مِنَ اللَّيلِ فقال حينَ يَستيقِظُ: لا إلهَ إلَّا اللهُ وَحْدَه لا شريكَ له، له المُلْكُ وله الحمدُ وهو على كلِّ شَيءٍ قديرٌ، سبحان الله، والحمدُ لله، ولا إلهَ إلَّا اللهُ، والله أكبَرُ، ولا حولَ ولا قوَّةَ إلا بالله، ثمَّ دعا: ربِّ اغفِرْ لي؛ استُجيبَ له، فإن قام فتوضأ ثمَّ صلَّى قُبِلَت صلاتُه"',
            source: "صحيح البخاري 1154",
          },
          {
            id: 2,
            title: 'عن عبد الله بن العباس رضي الله عنه قال: "أنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ وهي خَالَتُهُ فَاضْطَجَعْتُ في عَرْضِ الوِسَادَةِ واضْطَجَعَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ وأَهْلُهُ في طُولِهَا، فَنَامَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، حتَّى إذَا انْتَصَفَ اللَّيْلُ، أوْ قَبْلَهُ بقَلِيلٍ أوْ بَعْدَهُ بقَلِيلٍ، اسْتَيْقَظَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، فَجَلَسَ يَمْسَحُ النَّوْمَ عن وجْهِهِ بيَدِهِ، ثُمَّ قَرَأَ العَشْرَ الآيَاتِ الخَوَاتِمَ مِن سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إلى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ منها فأحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي. قَالَ ابنُ عَبَّاسٍ: فَقُمْتُ فَصَنَعْتُ مِثْلَ ما صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إلى جَنْبِهِ، فَوَضَعَ يَدَهُ اليُمْنَى علَى رَأْسِي، وأَخَذَ بأُذُنِي اليُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أوْتَرَ، ثُمَّ اضْطَجَعَ حتَّى أتَاهُ المُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ"',
            source: "صحيح البخاري 183",
          },
        ],
      },
      {
        id: 6,
        title: "قراءة العشر آيات الخواتم من سورة آل عمران",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن العباس رضي الله عنه قال: "أنَّهُ بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ وهي خَالَتُهُ فَاضْطَجَعْتُ في عَرْضِ الوِسَادَةِ واضْطَجَعَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ وأَهْلُهُ في طُولِهَا، فَنَامَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، حتَّى إذَا انْتَصَفَ اللَّيْلُ، أوْ قَبْلَهُ بقَلِيلٍ أوْ بَعْدَهُ بقَلِيلٍ، اسْتَيْقَظَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، فَجَلَسَ يَمْسَحُ النَّوْمَ عن وجْهِهِ بيَدِهِ، ثُمَّ قَرَأَ العَشْرَ الآيَاتِ الخَوَاتِمَ مِن سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إلى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ منها فأحْسَنَ وُضُوءَهُ، ثُمَّ قَامَ يُصَلِّي. قَالَ ابنُ عَبَّاسٍ: فَقُمْتُ فَصَنَعْتُ مِثْلَ ما صَنَعَ، ثُمَّ ذَهَبْتُ فَقُمْتُ إلى جَنْبِهِ، فَوَضَعَ يَدَهُ اليُمْنَى علَى رَأْسِي، وأَخَذَ بأُذُنِي اليُمْنَى يَفْتِلُهَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أوْتَرَ، ثُمَّ اضْطَجَعَ حتَّى أتَاهُ المُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ"',
            source: "صحيح البخاري 183",
          },
        ],
      },
      {
        id: 7,
        title: "غسل اليدين عند الإستيقاظ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا تَوَضَّأَ أحَدُكُمْ فَلْيَجْعَلْ في أنْفِهِ، ثُمَّ لِيَنْثُرْ، ومَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وإذَا اسْتَيْقَظَ أحَدُكُمْ مِن نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أنْ يُدْخِلَهَا في وَضُوئِهِ؛ فإنَّ أحَدَكُمْ لا يَدْرِي أيْنَ بَاتَتْ يَدُهُ"',
            source: "صحيح البخاري 162",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 7,
    title: "سنن الطعام",
    sunan: [
      {
        id: 1,
        title: "التسمية قبل الأكل",
        isFavorite: false,
        desc: "من السنة تسمية الله قبل الأكل",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها ، أن رسول الله صلى الله عليه وسلم قال: "إذا أكَل أحَدُكم فَلْيذكُرِ اسمَ اللهِ تعالى، فإن نسِي أن يذكُرَ اسمَ اللهِ تعالى في أوَّلِهِ، فليقُلْ: بسمِ اللهِ أوَّلَهُ وآخِرَهُ"',
            source: "سنن أبي داود 3767",
          },
        ]
      },
      {
        id: 2,
        title: "الأكل باليمين",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
        ],
      },
      {
        id: 3,
        title: "الأكل مما يلي",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
        ],
      },
      {
        id: 30,
        title: "الأكل جالسا",
        isFavorite: false,
        desc: "من السنة الأكل جالسا",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: عَنِ النَّبيِّ صَلَّى الله عليه وَسَلَّمَ: "أنَّهُ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا". قالَ قَتَادَةُ: فَقُلْنَا: فَالأكْلُ، فَقالَ: ذَاكَ أَشَرُّ، أَوْ أَخْبَثُ',
            source: "صحيح مسلم 2024",
          },
        ],
      },
      {
        id: 4,
        title: "أخذ اللقمة الساقطة، وإماطة ما بها من أذى، وأكلها",
        isFavorite: false,
        desc: "من السنة أخذ اللقمة الساقطة وإماطة ما بها من أذى وأكلها",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
            source: "صحيح مسلم 2033",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ كانَ إذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ، قالَ: وَقالَ: إذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الأذَى وَلْيَأْكُلْهَا، وَلَا يَدَعْهَا لِلشَّيْطَانِ، وَأَمَرَنَا أَنْ نَسْلُتَ القَصْعَةَ، قالَ: فإنَّكُمْ لا تَدْرُونَ في أَيِّ طَعَامِكُمُ البَرَكَةُ"',
            source: "صحيح مسلم 2034",
          },
        ]
      },
      {
        id: 5,
        title: "لعق الأصابع",
        isFavorite: false,
        desc: "من السنة لعق الأصابع أو إلعاقها",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال: "إذا أكَلَ أحَدُكُمْ فلا يَمْسَحْ يَدَهُ حتَّى يَلْعَقَها أوْ يُلْعِقَها"',
            source: "صحيح البخاري 5456",
          },
          {
            id: 2,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',  
            source: "صحيح مسلم 2032",       
          },
          {
            id: 3,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
            source: "صحيح مسلم 2033",
          },
          {
            id: 4,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ كانَ إذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ، قالَ: وَقالَ: إذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الأذَى وَلْيَأْكُلْهَا، وَلَا يَدَعْهَا لِلشَّيْطَانِ، وَأَمَرَنَا أَنْ نَسْلُتَ القَصْعَةَ، قالَ: فإنَّكُمْ لا تَدْرُونَ في أَيِّ طَعَامِكُمُ البَرَكَةُ"',
            source: "صحيح مسلم 2034",
          },
        ]
      },
      {
        id: 6,
        title: "سلت القصعة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ كانَ إذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ، قالَ: وَقالَ: إذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الأذَى وَلْيَأْكُلْهَا، وَلَا يَدَعْهَا لِلشَّيْطَانِ، وَأَمَرَنَا أَنْ نَسْلُتَ القَصْعَةَ، قالَ: فإنَّكُمْ لا تَدْرُونَ في أَيِّ طَعَامِكُمُ البَرَكَةُ"',
            source: "صحيح مسلم 2034",
          },
        ]
      },
      {
        id: 7,
        title: "الأكل بثلاث أصابع",
        isFavorite: false,
        desc: "من السنة الأكل بثلاث أصابع",
        ahadith: [
          {
            id: 1,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',
            source: "صحيح مسلم 2032",                
          },
        ]
      },
      {
        id: 8,
        title: "حمد الله تعالى بعد الطعام",
        isFavorite: false,
        desc: "من السنة حمد الله تعالى بعد الطعام",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ لَيَرْضَى عَنِ العَبْدِ أَنْ يَأْكُلَ الأكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا"',
            source: "صحيح مسلم 2734",
          },
        ],
      },
      {
        id: 9,
        title: "الإجتماع على الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: "طَعامُ الرَّجُلِ يَكْفِي رَجُلَيْنِ، وطَعامُ رَجُلَيْنِ يَكْفِي أرْبَعَةً، وطَعامُ أرْبَعَةٍ يَكْفِي ثَمانِيَةً"',
            source: "صحيح مسلم 2059",
          },
        ]
      },
      {
        id: 10,
        title: "مدح الطعام إذا أعجبه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أنَّ النبيَّ صَلَّى الله عليه وَسَلَّمَ سَأَلَ أَهْلَهُ الأُدُمَ، فَقالوا: ما عِنْدَنَا إلَّا خَلٌّ، فَدَعَا به، فَجَعَلَ يَأْكُلُ به، ويقولُ: نِعْمَ الأُدُمُ الخَلُّ، نِعْمَ الأُدُمُ الخَلُّ"',
            source: "صحيح مسلم 2052",
          },
        ],
      },
      {
        id: 11,
        title: "الدعاء لصاحب الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بسر رضي الله عنه قال: نَزَلَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ علَى أَبِي، قالَ: فَقَرَّبْنَا إلَيْهِ طَعَامًا وَوَطْبَةً، فأكَلَ منها، ثُمَّ أُتِيَ بتَمْرٍ، فَكانَ يَأْكُلُهُ وَيُلْقِي النَّوَى بيْنَ إصْبَعَيْهِ، وَيَجْمَعُ السَّبَّابَةَ وَالْوُسْطَى، قالَ شُعْبَةُ: هو ظَنِّي، وَهو فيه -إنْ شَاءَ الله- إلْقَاءُ النَّوَى بيْنَ الإصْبَعَيْنِ، ثُمَّ أُتِيَ بشَرَابٍ فَشَرِبَهُ، ثُمَّ نَاوَلَهُ الَّذي عن يَمِينِهِ، قالَ: فَقالَ أَبِي وَأَخَذَ بلِجَامِ دَابَّتِهِ: ادْعُ اللَّهَ لَنَا، "فَقالَ: اللَّهُمَّ بَارِكْ لهمْ في ما رَزَقْتَهُمْ، وَاغْفِرْ لهمْ وَارْحَمْهُمْ"',
            source: "صحيح مسلم 2042",
          },
        ],
      },
      {
        id: 12,
        title: "تغطية الإناء وذكر اسم الله تعالى عند قدوم الليل",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "غَطُّوا الإناءَ، وأَوْكُوا السِّقاءَ؛ فإنَّ في السَّنَةِ لَيْلَةً يَنْزِلُ فيها وَباءٌ، لا يَمُرُّ بإناءٍ ليسَ عليه غِطاءٌ، أوْ سِقاءٍ ليسَ عليه وِكاءٌ؛ إلَّا نَزَلَ فيه مِن ذلكَ الوَباءِ. وفي رِوايةٍ: فإنَّ في السَّنَةِ يَوْمًا يَنْزِلُ فيه وَباءٌ"',
            source: "صحيح مسلم 2014",
          },
        ],
      },
      {
        id: 13,
        title: "عدم عيب الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "ما عَابَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ طَعَامًا قَطُّ؛ إنِ اشْتَهَاهُ أكَلَهُ، وإلَّا تَرَكَهُ"',
            source: "صحيح البخاري 3563",
          },
        ],
      },
      {
        id: 14,
        title: "تبادل الطعام بين الجيران",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يا أبا ذَرٍّ إذا طَبَخْتَ مَرَقَةً، فأكْثِرْ ماءَها، وتَعاهَدْ جِيرانَكَ"',
            source: "صحيح مسلم 2625",
          },
        ],
      },
      {
        id: 15,
        title: "الأكل باعتدال وعدم الإفراط في الأكل",
        ahadith: [
          {
            id: 1,
            title: 'عن المقدام بن معدي كرب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما ملأَ آدميٌّ وعاءً شرًّا مِن بطنٍ ، بحسبِ ابنِ آدمَ أُكُلاتٌ يُقمنَ صُلبَهُ ، فإن كانَ لا محالةَ فثُلثٌ لطعامِهِ وثُلثٌ لشرابِهِ وثُلثٌ لنفَسِهِ"',
            source: "صحيح الترمذي 2380",
          },
        ],
      },
      {
        id: 16,
        title: "الأكل قبل الصلاة إذا حضر الطعام",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "...إنِّي سَمِعْتُ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ يقولُ: لا صَلَاةَ بحَضْرَةِ الطَّعَامِ، ولَا هو يُدَافِعُهُ الأخْبَثَانِ"',
            source: "صحيح مسلم 560",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا قُدِّمَ العَشَاءُ، فَابْدَؤُوا به قَبْلَ أنْ تُصَلُّوا صَلَاةَ المَغْرِبِ، ولَا تَعْجَلُوا عن عَشَائِكُمْ"',
            source: "صحيح البخاري 672",
          },
          {
            id: 3,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا وُضِعَ عَشَاءُ أحَدِكُمْ وأُقِيمَتِ الصَّلَاةُ، فَابْدَؤُوا بالعَشَاءِ ولَا يَعْجَلْ حتَّى يَفْرُغَ منه" وكانَ ابنُ عُمَرَ: يُوضَعُ له الطَّعَامُ، وتُقَامُ الصَّلَاةُ، فلا يَأْتِيهَا حتَّى يَفْرُغَ، وإنَّه لَيَسْمَعُ قِرَاءَةَ الإمَامِ',
            source: "صحيح البخاري 673",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 8,
    title: "سنن الشراب والشرب",
    sunan: [
      {
        id: 1,
        title: "التسمية قبل الأكل والشرب",
        isFavorite: false,
        desc: "من السنة تسمية الله قبل الأكل والشرب",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها قالت: "كانَ رسولُ الله صلَّى الله عليْهِ وسلَّمَ يأكلُ طعامًا في ستَّةِ نفرٍ من أصحابِهِ فجاءَ أعرابيٌّ فأَكلَهُ بلُقمَتينِ فقالَ رسولُ الله صلَّى الله عليْهِ وسلَّمَ أما أنَّهُ لو كانَ قالَ بِسمِ الله لَكفاكُم فإذا أَكلَ أحدُكُم طعامًا فليقُل بِسمِ الله فإن نَسِيَ أن يقولَ بسمِ الله في أوَّلِهِ فليقُلْ بسمِ الله في أوَّلِهِ وآخرِهِ"',
            source: "صحيح ابن ماجه 2659",
          },
        ]
      },
      {
        id: 2,
        title: "الشرب جالسا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَشْرَبَنَّ أحَدٌ مِنكُم قائِمًا، فمَن نَسِيَ فَلْيَسْتَقِئْ"',
            source: "صحيح مسلم 2026",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه قال: عَنِ النَّبيِّ صَلَّى الله عليه وَسَلَّمَ: "أنَّهُ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا". قالَ قَتَادَةُ: فَقُلْنَا: فَالأكْلُ، فَقالَ: ذَاكَ أَشَرُّ، أَوْ أَخْبَثُ',
            source: "صحيح مسلم 2024",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لو يعْلَمُ الذي يشرَبُ وهوَ قائِمٌ ما في بَطْنِهِ لاستقاءَ"',
            source: "صحيح الجامع 5336",
          },
        ],
      },
      {
        id: 3,
        title: "الشرب باليمين",
        isFavorite: false,
        desc: "من السنة الشرب باليمين",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
            source: "صحيح البخاري 5376",
          },
        ],
      },
      {
        id: 4,
        title: "شرب الماء في ثلاثة أنفاس",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: كان النبي صلى الله عليه وسلم يتنفسُ في الشرابِ ثلاثا ويقول : "هو أَهنَأ ، وأبرَأ ، وأشفَى" . قال أنس : وأنا أتنفسُ في الشرابِ ثلاثا',
            source: "شرح السنة 6/131",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: "أن رسول الله صلى الله عليه وسلم كان يشربُ في ثلاثةِ أنفاسٍ ، إذا أدْنى الإناءَ إلى فيهِ سمّى اللهَ تعالى ، وإذا أخرّهُ حمدَ الله تعالى ، يفعلُ ذلكَ ثلاثَ مراتٍ"',
            source: "السلسلة الصحيحة 1277",
          },
          {
            id: 3,
            title: 'عن ثُمَامةُ بنُ عبدِ الله بنِ أنَسِ بنِ مالِكٍ رضي الله عنه قال: "كانَ أنَسٌ يَتَنَفَّسُ في الإنَاءِ مَرَّتَيْنِ أوْ ثَلَاثًا، وزَعَمَ أنَّ النَّبيَّ صلَّى اللهُ عليه وسلَّم كانَ يَتَنَفَّسُ ثَلَاثًا"',
            source: "صحيح البخاري 5631",
          },
        ],
      },
      {
        id: 5,
        title: "حمد الله تعالى بعد الأكل والشرب",
        isFavorite: false,
        desc: "من السنة حمد الله تعالى بعد الأكل والشرب",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ لَيَرْضَى عَنِ العَبْدِ أَنْ يَأْكُلَ الأكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا"',
            source: "صحيح مسلم 2734",
          },
        ],
      },
      {
        id: 6,
        title: "إستحباب أن يسقي الشارب من على يمينه قبل يساره",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أَتَانَا رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ في دَارِنَا، فَاسْتَسْقَى فَحَلَبْنَا له شَاةً، ثُمَّ شُبْتُهُ مِن مَاءِ بئْرِي هذِه، قالَ: فأعْطَيْتُ رَسولَ اللهِ صَلَّى الله عليه وَسَلَّمَ، فَشَرِبَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ وَأَبُو بَكْرٍ عن يَسَارِهِ، وَعُمَرُ وِجَاهَهُ، وَأَعْرَابِيٌّ عن يَمِينِهِ، فَلَمَّا فَرَغَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ مِن شُرْبِهِ، قالَ عُمَرُ: هذا أَبُو بَكْرٍ يا رَسولَ اللهِ، يُرِيهِ إيَّاهُ، فأعْطَى رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ الأعْرَابِيَّ، وَتَرَكَ أَبَا بَكْرٍ، وَعُمَرَ، وَقالَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ: "الأيْمَنُونَ، الأيْمَنُونَ، الأيْمَنُونَ." قالَ أَنَسٌ: فَهي سُنَّةٌ، فَهي سُنَّةٌ، فَهي سُنَّةٌ',
            source: "صحيح مسلم 2029",
          },
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أَتَانَا رَسولُ الله صلَّى اللهُ عليه وسلَّمَ في دَارِنَا هذِه فَاسْتَسْقَى، فَحَلَبْنَا له شَاةً لَنَا، ثُمَّ شُبْتُهُ مِن مَاءِ بئْرِنَا هذِه، فأعْطَيْتُهُ، وأَبُو بَكْرٍ عن يَسَارِهِ، وعُمَرُ تُجَاهَهُ، وأَعْرَابِيٌّ عن يَمِينِهِ، فَلَمَّا فَرَغَ قَالَ عُمَرُ: هذا أبو بَكْرٍ، فأعْطَى الأعْرَابِيَّ فَضْلَهُ، ثُمَّ قَالَ: الأيْمَنُونَ الأيْمَنُونَ، ألَا فَيَمِّنُوا. قَالَ أنَسٌ: فَهي سُنَّةٌ، فَهي سُنَّةٌ. ثَلَاثَ مَرَّاتٍ"',
            source: "صحيح البخاري 2571",
          },
        ],
      },
      {
        id: 7,
        title: "ساقي القوم آخرهم شربا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة رضي الله عنه قال: قال رسول االه صلى الله عليه وسلم: "ساقي القومِ آخرُهم شربًا"',
            source: "صحيح الترمذي 1894",
          },
        ],
      },
      {
        id: 8,
        title: "عدم الشرب من مكان الكسر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نهى رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّمَ ، عَنِ الشُّرْبِ من ثُلْمَةِ القَدَحِ ، وأنْ يُنْفَخَ في الشَّرَابِ"',
            source: "صحيح أبي داود 3722",
          },
        ],
      },
      {
        id: 9,
        title: "عدم النفخ في الشراب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نهى رسولُ اللهِ صلَّى اللهُ عليهِ وسلَّمَ ، عَنِ الشُّرْبِ من ثُلْمَةِ القَدَحِ ، وأنْ يُنْفَخَ في الشَّرَابِ"',
            source: "صحيح أبي داود 3722",
          },
        ],
      },
      {
        id: 10,
        title: "الشرب والاستشفاء من ماء زمزم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال رسول الله صلى الله عليه وسلم: "خَيرُ ماءٍ على وجْهِ الأرضِ ماءُ زَمْزَمَ ، فِيه طعامٌ من الطُّعْمِ ، و شِفاءٌ من السُّقْمِ ، و شَرُّ ماءٍ على وجهِ الأرضِ ماءُ بِوَادِي بَرَهُوتَ بِقُبَّةٍ بِحَضْرَمَوْتَ كَرِجْلِ الجَرادِ من الهَوامِّ ، تُصبِحُ تَتَدَفَّقُ و تُمسِي لا بِلالَ لَهَا"',
            source: "صحيح الجامع 3322",
          },
        ],
      },
      {
        id: 11,
        title: "المضمضة بعد شرب اللبن",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: "أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم شَرِبَ لَبَنًا فَمَضْمَضَ، وقالَ: إنَّ له دَسَمًا."',
            source: "صحيح البخاري 5609",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 9,
    title: "سنن التثاؤب",
    sunan: [
      {
        id: 1,
        title: "كظم الفم عند التثاؤب أو رده باليد",
        desc: "من السنة كظم الفم عند التثاؤب أو رده باليد.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
            source: "صحيح البخاري 6223",
          },
          {
            id: 2,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا تَثاءَبَ أحَدُكُمْ، فَلْيُمْسِكْ بيَدِهِ علَى فِيهِ، فإنَّ الشَّيْطانَ يَدْخُلُ"',
            source: "صحيح مسلم 2995",
          },
        ]
      },
      {
        id: 2,
        title: "عدم رفع الصوت في التثائب",
        desc: "من السنة عدم رفع الصوت في التثاؤب.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
            source: "صحيح البخاري 6223",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 10,
    title: "سنن العطاس",
    sunan: [
      {
        id: 1,
        title: 'يسن للعاطس أن يقول: "الحمد لله"',
        isFavorite: false,
        desc: "من السنة أن يقول العاطس الحمد لله.",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا عَطَسَ أحَدُكُمْ فَلْيَقُلِ: الحَمْدُ لِلَّهِ، ولْيَقُلْ له أخُوهُ -أوْ صاحِبُهُ-: يَرْحَمُكَ اللَّهُ، فإذا قالَ له: يَرْحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ ويُصْلِحُ بالَكُمْ"',
            source: "صحيح البخاري 6224",
          },
        ]
      },
      {
        id: 2,
        title: "تشميت العاطس إذا حمد الله",
        isFavorite: false,
        desc: "من السنة تشميت العاطس إذا حمد الله",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "عطَس رجلانِ عند النَّبيِّ صلَّى اللهُ عليه وسلَّم، فشَمَّت أحدَهما وتَرك الآخَرَ، قال: فقيل: يا رسولَ اللهِ، رجلان عَطَسا فشَمَّتَّ أحدَهما وتركتَ الآخَرَ؟ فقال: إنَّ هذا حَمِدَ الله، وإنَّ هذا لم يحمَدِ اللهَ"',
            source: "صحيح البخاري 6221",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
            source: "صحيح البخاري 6223",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا عَطَسَ أحَدُكُمْ فَلْيَقُلِ: الحَمْدُ لِلَّهِ، ولْيَقُلْ له أخُوهُ -أوْ صاحِبُهُ-: يَرْحَمُكَ اللَّهُ، فإذا قالَ له: يَرْحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ ويُصْلِحُ بالَكُمْ"',
            source: "صحيح البخاري 6224",
          },
          {
            id: 4,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "إذا عطَسَ أحدُكُم فحمِدَ اللهَ فشمِّتُوهُ ، وإذا لَم يحمَدِ اللهَ فلا تُشمِّتُوهُ"',
            source: "صحيح الجامع 683",
          },
        ]
      },
      {
        id: 3,
        title: "لا يشمت العاطس إذا لم يحمد الله تعالى",
        isFavorite: false,
        desc: "من السنة عدم تشميت العاطس إذا لم يقل الحمد لله",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "عطَس رجلانِ عند النَّبيِّ صلَّى اللهُ عليه وسلَّم، فشَمَّت أحدَهما وتَرك الآخَرَ، قال: فقيل: يا رسولَ اللهِ، رجلان عَطَسا فشَمَّتَّ أحدَهما وتركتَ الآخَرَ؟ فقال: إنَّ هذا حَمِدَ الله، وإنَّ هذا لم يحمَدِ اللهَ"',
            source: "صحيح البخاري 6221",
          },
          {
            id: 2,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "إذا عطَسَ أحدُكُم فحمِدَ اللهَ فشمِّتُوهُ ، وإذا لَم يحمَدِ اللهَ فلا تُشمِّتُوهُ"',
            source: "صحيح الجامع 683",
          },
        ]
      },
      {
        id: 4,
        title: "لا يشمت العاطس إذا زاد على ثلاث مرات لأنه مزكوم",
        isFavorite: false,
        desc: "من السنة عدم تشميت العاطس إذا زاد على ثلاث مرات لأنه مزكوم  ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "شَمِّتْ أخاك ثلاثًا ، فما زاد فهو زُكامٌ"',
            source: "صحيح أبي داود 5034",
          },
          {
            id: 2,
            title: 'عن سلمة بن الأكوع رضي الله عنه أنَّهُ سَمِعَ النَّبيَّ صَلَّى الله عليه وسلَّمَ وَعَطَسَ رَجُلٌ عِنْدَهُ، فَقالَ له: "يَرْحَمُكَ الله"، ثُمَّ عَطَسَ أُخْرَى، فَقالَ له رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "الرَّجُلُ مَزْكُومٌ"',
            source: "صحيح مسلم 2993",
          },
        ]
      },
      {
        id: 5,
        title: "تغطية الفم باليد أو الثوب عند العطاس",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "كان رسولُ اللهِ صلى الله عليه وسلم إذا عَطَسَ وضَعَ يدَه ، أو ثوبَه على فيه ، وخَفَضَ ، أو غَضَّ بها صوتَه"',
            source: "صحيح أبي داود 5029",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ ؛ كان إذا عطِس ، غطَّى وجهَهُ بيدِهِ ، أوْ بثوبِهِ ، وغضَّ بها صوتَهُ"',
            source: "سنن الترمذي 2745",
          },
        ],
      },
      {
        id: 6,
        title: "خفض الصوت عند العطاس",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "كان رسولُ اللهِ صلى الله عليه وسلم إذا عَطَسَ وضَعَ يدَه ، أو ثوبَه على فيه ، وخَفَضَ ، أو غَضَّ بها صوتَه"',
            source: "صحيح أبي داود 5029",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ ؛ كان إذا عطِس ، غطَّى وجهَهُ بيدِهِ ، أوْ بثوبِهِ ، وغضَّ بها صوتَهُ"',
            source: "سنن الترمذي 2745",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 11,
    title: "سنن السلام واللقاء والمجالسة",
    sunan: [
      {
        id: 1,
        title: "إلقاء السلام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أن النبي صلى الله عليه وسلم "أنَّهُ كانَ إذَا تَكَلَّمَ بكَلِمَةٍ أعَادَهَا ثَلَاثًا، حتَّى تُفْهَمَ عنْه، وإذَا أتَى علَى قَوْمٍ فَسَلَّمَ عليهم، سَلَّمَ عليهم ثَلَاثًا"',
            source: "صحيح البخاري 95",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: أنَّ رَجُلًا سَأَلَ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: أيُّ الإسْلَامِ خَيْرٌ؟ قالَ: "تُطْعِمُ الطَّعَامَ، وتَقْرَأُ السَّلَامَ علَى مَن عَرَفْتَ ومَن لَمْ تَعْرِفْ"',
            source: "صحيح البخاري 12",
          },
        ],
      },
      {
        id: 2,
        title: "تكرار السلام ثلاثا، إن دعت الحاجة لذلك",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أن النبي صلى الله عليه وسلم "أنَّهُ كانَ إذَا تَكَلَّمَ بكَلِمَةٍ أعَادَهَا ثَلَاثًا، حتَّى تُفْهَمَ عنْه، وإذَا أتَى علَى قَوْمٍ فَسَلَّمَ عليهم، سَلَّمَ عليهم ثَلَاثًا"',
            source: "صحيح البخاري 95",
          },
        ],
      },
      {
        id: 3,
        title: "تعميم السلام على من تعرف وعلى من لا تعرف",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: أنَّ رَجُلًا سَأَلَ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: أيُّ الإسْلَامِ خَيْرٌ؟ قالَ: "تُطْعِمُ الطَّعَامَ، وتَقْرَأُ السَّلَامَ علَى مَن عَرَفْتَ ومَن لَمْ تَعْرِفْ"',
            source: "صحيح البخاري 12",
          },
        ],
      },
      {
        id: 4,
        title: "إبتداء السلام ممن جاءت السنة بابتدائه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يُسَلِّمُ الصَّغِيرُ علَى الكَبِيرِ، والمارُّ علَى القاعِدِ، والقَلِيلُ علَى الكَثِيرِ"',
            source: "صحيح البخاري 6231",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يُسَلِّمُ الرَّاكِبُ علَى الماشِي، والماشِي علَى القاعِدِ، والقَلِيلُ علَى الكَثِيرِ"',
            source: "صحيح البخاري 6233",
          },
        ],
      },
      {
        id: 5,
        title: "السلام على الصبيان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أن النبي صلى الله عليه وسلم "أنَّهُ مَرَّ علَى صِبْيَانٍ فَسَلَّمَ عليهم" وقالَ: كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَفْعَلُهُ',
            source: "صحيح البخاري 6247",
          },
        ],
      },
      {
        id: 6,
        title: "السلام عند دخول البيت",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ، فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ، قالَ الشَّيْطَانُ: لا مَبِيتَ لَكُمْ، وَلَا عَشَاءَ، وإذَا دَخَلَ، فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ، قالَ الشَّيْطَانُ: أَدْرَكْتُمُ المَبِيتَ، وإذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ، قالَ: أَدْرَكْتُمُ المَبِيتَ وَالْعَشَاءَ. وفي روايةٍ : وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ طَعَامِهِ، وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ دُخُولِهِ"',
            source: "صحيح مسلم 2018",
          },
        ],
      },
      {
        id: 7,
        title: "خفض الصوت بالسلام عند الدخول إلى قوم وفيهم نائمون",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن المقداد بن عمرو بن الأسود رضي الله عنه قال: "...وَنَرْفَعُ للنَّبيِّ صَلَّى الله عليه وَسَلَّمَ نَصِيبَهُ، قالَ: فَيَجِيءُ مِنَ اللَّيْلِ فيُسَلِّمُ تَسْلِيمًا لا يُوقِظُ نَائِمًا وَيُسْمِعُ اليَقْظَانَ..."',
            source: "صحيح مسلم 2055",
          },
        ],
      },
      {
        id: 8,
        title: "تبليغ السلام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ، قالَ لَهَا: "يا عَائِشَةُ هذا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلَامَ، فَقالَتْ: وعليه السَّلَامُ ورَحْمَةُ اللَّهِ وبَرَكَاتُهُ، تَرَى ما لا أرَى، تُرِيدُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ"',
            source: "صحيح البخاري 3217",
          },
        ],
      },
      {
        id: 9,
        title: "السلام عند دخول المجلس وعند مفارقته",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال:  قال رسول الله صلى الله عليه وسلم: "إذا انتهَى أحدُكم إلى مجلِسٍ فليسلِّم، فإنَّ بَدا له أن يجلِسَ فليجلِس، ثمَّ إذا قامَ فليسلِّم فلَيسَتِ الأولَى بأحقَّ من الآخرةِ"',
            source: "سنن الترمذي 2706",
          },
        ],
      },
      {
        id: 10,
        title: "المصافحة مع السلام عند اللقيا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما من مسلمين يلتقيان فيتصافحان إلا غُفِرَ لهما قبلَ أن يفترقا"',
            source: "صحيح أبي داود 5212",
          },
        ],
      },
      {
        id: 11,
        title: "التبسم وطلاقة الوجه عند اللقاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَحْقِرَنَّ مِنَ المَعروفِ شيئًا، ولو أنْ تَلْقَى أخاكَ بوَجْهٍ طَلْقٍ."',
            source: "صحيح مسلم 2626",
          },
        ],
      },
      {
        id: 12,
        title: "الكلمة الطيبة فهي صدقة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كُلُّ سُلامَى مِنَ النَّاسِ عليه صَدَقَةٌ، كُلَّ يَومٍ تَطْلُعُ فيه الشَّمْسُ، يَعْدِلُ بيْنَ الِاثْنَيْنِ صَدَقَةٌ، ويُعِينُ الرَّجُلَ علَى دابَّتِهِ فَيَحْمِلُ عليها، أوْ يَرْفَعُ عليها مَتاعَهُ صَدَقَةٌ، والكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وكُلُّ خُطْوَةٍ يَخْطُوها إلى الصَّلاةِ صَدَقَةٌ، ويُمِيطُ الأذَى عَنِ الطَّرِيقِ صَدَقَةٌ"',
            source: "صحيح البخاري 2989",
          },
        ],
      },
      {
        id: 13,
        title: "ذكر الله تعالى في المجلس",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما جَلَس قومٌ مجلسًا لم يذكروا اللهَ فيه ولم يُصلُّوا على نبيِّهم إلَّا كان عليهم تِرةٌ فإن شاءَ عذَّبَهم وإن شاءَ غفَر لهم"',
            source: "صحيح الترمذي 3380",
          },
        ],
      },
      {
        id: 14,
        title: "ختم المجلس بكفارة المجلس",
        isFavorite: false,
      },
      {
        id: 15,
        title: "عدم نزع اليد عند المصافحة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "ما رأيتُ رجلًا التَقَمَ أُذُنَ رسولِ اللهِ صلى الله عليه وسلم ، فيُنَحِّي رأسَه ، حتى يكونَ الرجلُ هو الذي يُنَحِّي رأسَه ، وما رأيتُ رجلًا أخَذَ بيدِه فتَرَكَ يدَه ، حتى يكونَ الرجلُ هو الذي يَدَعُ يدَه"',
            source: "صحيح أبي داود 4794",
          },
        ],
      },
      {
        id: 16,
        title: "رد السلام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
        ],
      },
      {
        id: 17,
        title: "عدم مصافحة الرجال للنساء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أميمة بنت رقيقة رضي الله عنها قالت: أتيتُ النبيَّ صلى الله عليه وسلم في نسوةٍ مِن الأنصارِ نبايعُه ، فقلنا : يا رسولَ اللهِ ، نبايعُك على أن لا نشركَ باللهِ شيئًا ، ولا نسرقَ ، ولا نزنيَ ، ولا نأتيَ ببهتانٍ نفتريه بين أيدينا ، وأرجلِنا ، ولا نعصيَك في معروفٍ . قال : "فيما استطعتُنَّ وأطقْتُنَّ." قالت : قلنا : اللهُ ورسولُه أرحمُ بنا . هلمَّ نبايعْك يا رسولَ اللهِ ، فقال رسولُ اللهِ -صلى الله عليه وسلم- : "إني لا أصافحُ النساءَ! إنما قولي لمائةِ امرأةٍ ، كقولي لامرأةٍ واحدةٍ _ أو مثل قولي _ لامرأةٍ واحدةٍ."',
            source: "صحيح النسائي 4192",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كَانَتِ المُؤْمِنَاتُ إذَا هَاجَرْنَ إلى رَسولِ اللهِ صَلَّى الله عليه وَسَلَّمَ يُمْتَحَنَّ بقَوْلِ اللهِ عَزَّ وَجَلَّ: {يَا أَيُّهَا النبيُّ إذَا جَاءَكَ المُؤْمِنَاتُ يُبَايِعْنَكَ علَى أَنْ لا يُشْرِكْنَ باللَّهِ شيئًا وَلَا يَسْرِقْنَ وَلَا يَزْنِينَ} [الممتحنة: 12] إلى آخِرِ الآيَةِ. قالَتْ عَائِشَةُ: فمَن أَقَرَّ بهذا مِنَ المُؤْمِنَاتِ، فقَدْ أَقَرَّ بالمِحْنَةِ. وَكانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ إذَا أَقْرَرْنَ بذلكَ مِن قَوْلِهِنَّ، قالَ لهنَّ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ: انْطَلِقْنَ، فقَدْ بَايَعْتُكُنَّ وَلَا والله ما مَسَّتْ يَدُ رَسولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ يَدَ امْرَأَةٍ قَطُّ، غيرَ أنَّهُ يُبَايِعُهُنَّ بالكَلَامِ. قالَتْ عَائِشَةُ: وَاللَّهِ، ما أَخَذَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ علَى النِّسَاءِ قَطُّ إلَّا بما أَمَرَهُ اللَّهُ تَعَالَى، وَما مَسَّتْ كَفُّ رَسولِ اللهِ صَلَّى الله عليه وَسَلَّمَ كَفَّ امْرَأَةٍ قَطُّ، وَكانَ يقولُ لهنَّ إذَا أَخَذَ عليهنَّ: قدْ بَايَعْتُكُنَّ كَلَامًا"',
            source: "صحيح مسلم 1866",
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّم كانَ يَمْتَحِنُ مَن هَاجَرَ إلَيْهِ مِنَ المُؤْمِنَاتِ بهذِه الآيَةِ؛ بقَوْلِ الله: {يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ} إلى قَوْلِهِ: {غَفُورٌ رَحِيمٌ} [الممتحنة: 12]". قالَ عُرْوَةُ: قالَتْ عَائِشَةُ: "فمَن أقَرَّ بهذا الشَّرْطِ مِنَ المُؤْمِنَاتِ، قالَ لَهَا رَسولُ الله صلَّى اللهُ عليه وسلَّم: قدْ بَايَعْتُكِ، كَلَامًا، ولَا والله ما مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ في المُبَايَعَةِ، ما يُبَايِعُهُنَّ إلَّا بقَوْلِهِ: قدْ بَايَعْتُكِ علَى ذَلِكِ"',
            source: "صحيح البخاري 4891",
          },
          {
            id: 4,
            title: 'عن معقل بن يسار رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَأنْ يُطعَنَ في رأسِ رجلٍ بِمِخْيَطٍ من حديدٍ خيرٌ من أن يمَسَّ امرأةً لا تَحِلُّ له"',
            source: "السلسلة الصحيحة 226",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 12,
    title: "سنن الذهاب إلى المسجد",
    sunan: [
      {
        id: 1,
        title: "التبكير بالذهاب إلى المسجد",
        desc: "من السنة التبكير إلى المسجد.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
            source: "صحيح البخاري 2689",
          },
        ]
      },
      {
        id: 2,
        title: "الخروج من البيت متطهرا لتكتب خطاه",
        desc: "من السنة أن يخرج من بيته متطهرا لتكتب خطاه.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صَلَاةُ الرَّجُلِ في جَمَاعَةٍ تَزِيدُ علَى صَلَاتِهِ في بَيْتِهِ، وَصَلَاتِهِ في سُوقِهِ، بضْعًا وَعِشْرِينَ دَرَجَةً، وَذلكَ أنَّ أَحَدَهُمْ إذَا تَوَضَّأَ فأحْسَنَ الوُضُوءَ، ثُمَّ أَتَى المَسْجِدَ لا يَنْهَزُهُ إلَّا الصَّلَاةُ، لا يُرِيدُ إلَّا الصَّلَاةَ، فَلَمْ يَخْطُ خَطْوَةً إلَّا رُفِعَ له بهَا دَرَجَةٌ، وَحُطَّ عنْه بهَا خَطِيئَةٌ، حتَّى يَدْخُلَ المَسْجِدَ، فَإِذَا دَخَلَ المَسْجِدَ كانَ في الصَّلَاةِ ما كَانَتِ الصَّلَاةُ هي تَحْبِسُهُ، وَالْمَلَائِكَةُ يُصَلُّونَ علَى أَحَدِكُمْ ما دَامَ في مَجْلِسِهِ الذي صَلَّى فيه يقولونَ: اللَّهُمَّ ارْحَمْهُ، اللَّهُمَّ اغْفِرْ له، اللَّهُمَّ تُبْ عليه، ما لَمْ يُؤْذِ فِيهِ، ما لَمْ يُحْدِثْ فِيهِ"',
            source: "صحيح مسلم 649",
          },
        ]
      },
      {
        id: 3,
        title: "الخروج للصلاة بسكينة ووقار",
        desc: "من السنة الخروج للصلاة بسكينة ووقار.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: بيْنَما نَحْنُ نُصَلِّي مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ إذْ سَمِعَ جَلَبَةَ رِجَالٍ، فَلَمَّا صَلَّى قَالَ: "ما شَأْنُكُمْ؟" قالوا: اسْتَعْجَلْنَا إلى الصَّلَاةِ؟ قَالَ: "فلا تَفْعَلُوا إذَا أتَيْتُمُ الصَّلَاةَ فَعلَيْكُم بالسَّكِينَةِ، فَما أدْرَكْتُمْ فَصَلُّوا وما فَاتَكُمْ فأتِمُّوا"',
            source: "صحيح البخاري 635",
          },
        ],
      },
      {
        id: 4,
        title: "تقديم الرجل اليمنى عند الدخول إلى المسجد وتقديم اليسرى عند الخروج منه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"',
            source: "صحيح البخاري 168",
          },
        ],
      },
      {
        id: 5,
        title: "قول الذكر عند دخول المسجد وعند الخروج منه",
        desc: "من السنة قول الذكر الوارد عند دخول المسجد وعند الخروج منه.",
        isFavorite: false,
        ahadith: [
          { 
            id: 1,
            title: 'عن أبي حميد أو أبي أسيد الساعدي رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا دَخَلَ أحَدُكُمُ المَسْجِدَ، فَلْيَقُلِ: اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِكَ، وإذا خَرَجَ، فَلْيَقُلِ: اللَّهُمَّ إنِّي أسْأَلُكَ مِن فَضْلِكَ"',
            source: "صحيح مسلم 713",
          },
        ],
      },
      {
        id: 6,
        title: "صلاة ركعتين تحية للمسجد",
        desc: "من السنة صلاة ركعتين تحية للمسجد.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا دَخَلَ أحَدُكُمُ المَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أنْ يَجْلِسَ"',
            source: "صحيح البخاري 444",
          },
        ],
      },
      {
        id: 7,
        title: "مبادرة الرجال إلى الصف الأول",
        desc: "من السنة مبادرة الرجال إلى الصف الأول.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خَيْرُ صُفُوفِ الرِّجالِ أوَّلُها، وشَرُّها آخِرُها، وخَيْرُ صُفُوفِ النِّساءِ آخِرُها، وشَرُّها أوَّلُها"',
            source: "صحيح مسلم 440",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
            source: "صحيح البخاري 2689",
          },
        ],
      },
      {
        id: 8,
        title: "أن يكون المأموم قريبا من إمامه",
        isFavorite: false,
        desc: "من السنة أن يكون المأموم قريبا من إمامه.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليلينِّي منكم أولو الأحلامِ والنُّهى ثمَّ الَّذينَ يلونَهُم ثمَّ الَّذينَ يلونَهُم ولا تختلِفوا فتختلفَ قلوبُكُم وإيَّاكم وَهَيشاتِ الأسواقِ"',
            source: "صحيح الجامع 5476",
          },
        ],
      },
      {
        id: 9,
        title: "الذهاب إلى المسجد ماشيا",
        desc: "من السنة الذهاب إلى المسجد ماشيا.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَلا أدُلُّكُمْ علَى ما يَمْحُو الله به الخَطايا، ويَرْفَعُ به الدَّرَجاتِ؟" قالُوا بَلَى يا رَسولَ اللهِ، قالَ: "إسْباغُ الوُضُوءِ علَى المَكارِهِ، وكَثْرَةُ الخُطا إلى المَساجِدِ، وانْتِظارُ الصَّلاةِ بَعْدَ الصَّلاةِ، فَذَلِكُمُ الرِّباطُ." وليسَ في حَديثِ شُعْبَةَ ذِكْرُ الرِّباطِ. وفي حَديثِ مالِكٍ ثِنْتَيْنِ "فَذَلِكُمُ الرِّباطُ، فَذَلِكُمُ الرِّباطُ"',
            source: "صحيح مسلم 251"
          },
        ],
      },
      {
        id: 10,
        title: "تسوية الصفوف",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أقيموا الصُّفوفَ وحاذُوا بينَ المناكبِ وسُدُّوا الخللَ ولينوا بأيدي إخوانِكم ولا تذَروا فرُجاتٍ للشَّيطانِ ومَن وصَلَ صفًّا وصَلَه الله ومن قطعَ صفًّا قطعَه الله"',
            source: "صحيح ابي داود 666",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 13,
    title: "سنن الصيام",
    sunan: [
      {
        id: 1,
        title: "إجتناب المحرمات",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُرَيرةَ رَضِيَ اللهُ عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن لَمْ يَدَعْ قَوْلَ الزُّورِ والعَمَلَ به، فليسَ لِلَّهِ حَاجَةٌ في أنْ يَدَعَ طَعَامَهُ وشَرَابَهُ"',
            source: "صحيح البخاري 1903",
          },
        ],
      },
      {
        id: 2,
        title: "إجتناب الرفث والصخب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: قالَ الله: "كُلُّ عَمَلِ ابْنِ آدَمَ له، إلَّا الصِّيَامَ؛ فإنَّه لي، وأَنَا أجْزِي به، والصِّيَامُ جُنَّةٌ، وإذَا كانَ يَوْمُ صَوْمِ أحَدِكُمْ فلا يَرْفُثْ ولَا يَصْخَبْ، فإنْ سَابَّهُ أحَدٌ أوْ قَاتَلَهُ، فَلْيَقُلْ: إنِّي امْرُؤٌ صَائِمٌ. والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لَخُلُوفُ فَمِ الصَّائِمِ أطْيَبُ عِنْدَ الله مِن رِيحِ المِسْكِ. لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا: إذَا أفْطَرَ فَرِحَ، وإذَا لَقِيَ رَبَّهُ فَرِحَ بصَوْمِهِ"',
            source: "صحيح البخاري 1904",
          },
        ],
      },
      {
        id: 3,
        title: "دعاء الإفطار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن مروانُ بن سالِم رضي الله عنه قال: رأيتُ ابنَ عمرَ يقبِضُ علَى لحيتِهِ فيقطعُ ما زادَ علَى الكَفِّ وقالَ كانَ رسولُ الله صلَّى الله عليهِ وسلَّمَ إذا أفطرَ قالَ: "ذَهَبَ الظَّمأُ وابتلَّتِ العُروقُ وثبَتَ الأجرُ إن شاءَ الله"',
            source: "صحيح أبي داود 2357",
          },
        ],
      },
      {
        id: 4,
        title: "تعجيل الفطور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُريرةَ رَضِيَ اللهُ عنه قال: قال رشول الله صلَّى اللهُ عليه وسلَّم: "لا يزالُ الدِّينُ ظاهرًا ما عجَّلَ النَّاسُ الفِطرَ لأنَّ اليَهودَ والنَّصارى يؤخِّرونَ"',
            source: "صحيح أبي داود 2353",
          },
          {
            id: 2,
            title: 'عن سهل بن سعد الساعدي رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "لا يَزَالُ النَّاسُ بخَيْرٍ ما عَجَّلُوا الفِطْرَ"',
            source: "صحيح البخاري 1957",
          },
        ],
      },
      {
        id: 5,
        title: "السحور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنسِ بنِ مالكٍ رَضِيَ اللهُ عنه قال: قال النبيُّ صلَّى اللهُ عليه وسلَّم: "تسَحَّرُوا؛ فإنَّ في السَّحورِ بَرَكةً"',
            source: "صحيح البخاري 1923",
          },
        ],
      },
      {
        id: 6,
        title: "السحور بالتمر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نِعمَ سحورُ المؤمنِ التَّمرُ"',
            source: "صحيح أبي داود 2345",
          },
        ],
      },
      {
        id: 7,
        title: "تأخير السحور",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ نَبِيَّ الله صَلَّى اللهُ عليه وسلَّمَ وزَيْدَ بنَ ثَابِتٍ: تَسَحَّرَا فَلَمَّا فَرَغَا مِن سَحُورِهِمَا، قَامَ نَبِيُّ الله صَلَّى اللهُ عليه وسلَّمَ إلى الصَّلَاةِ، فَصَلَّى"، قُلْنَا لأنَسٍ: كَمْ كانَ بيْنَ فَرَاغِهِما مِن سَحُورِهِما ودُخُولِهِما في الصَّلَاةِ؟ قالَ: "قَدْرُ ما يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً"',
            source: "صحيح البخاري 576",
          },
        ],
      },
      {
        id: 8,
        title: "تفطير الصائمين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن زيد بن خالد الجهني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن فطَّرَ صائمًا كانَ لَهُ مثلُ أجرِهِ ، غيرَ أنَّهُ لا ينقُصُ من أجرِ الصَّائمِ شيئًا"',
            source: "صحيح الترمذي 807",
          },
        ],
      },
      {
        id: 9,
        title: "الفطر على تمر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أنسِ بنِ مالِكٍ رضي الله عنه قالَ : "كانَ رسولُ الله صلَّى الله عليهِ وسلَّمَ يُفطِرُ علَى رُطَباتٍ قبلَ أن يصلِّيَ فإن لم تكن رُطَباتٌ فعلى تَمراتٍ فإن لم تَكُن حَسا حَسَواتٍ مِن ماءٍ"',
            source: "صحيح أبي داود 2356",
          },
        ],
      },
      {
        id: 10,
        title: "قيام رمضان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن صامَ رَمَضانَ إيمانًا واحْتِسابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ، ومَن قامَ لَيْلَةَ القَدْرِ إيمانًا واحْتِسابًا غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ"',
            source: "صحيح البخاري 2014",
          },
        ],
      },
      {
        id: 11,
        title: "الإكثار من قراءة القرآن",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
            source: "صحيح البخاري 2024",
          },
        ],
      },
      {
        id: 12,
        title: "الإعتكاف في مسجد في العشر الأواخر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ يَعْتَكِفُ العَشْرَ الأوَاخِرَ مِن رَمَضَانَ حتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ اعْتَكَفَ أزْوَاجُهُ مِن بَعْدِهِ"',
            source: "صحيح البخاري 2026",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ النبيَّ صَلَّى الله عليه وسلَّمَ كانَ يَعْتَكِفُ العَشْرَ الأوَاخِرَ مِن رَمَضَانَ، حتَّى تَوَفَّاهُ الله عَزَّ وَجَلَّ، ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِن بَعْدِهِ"',
            source: "صحيح مسلم 1172",
          },
        ],
      },
      {
        id: 13,
        title: "الإكثار من الدعاء خصوصا في العشر الأواخر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
            source: "صحيح البخاري 2024",
          },
        ],
      },
      {
        id: 14,
        title: "الإجتهاد في جميع أنواع العبادات",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
            source: "صحيح البخاري 2024",
          },
        ],
      },
      {
        id: 15,
        title: "عدم السب والقتال",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: قالَ الله: "كُلُّ عَمَلِ ابْنِ آدَمَ له، إلَّا الصِّيَامَ؛ فإنَّه لي، وأَنَا أجْزِي به، والصِّيَامُ جُنَّةٌ، وإذَا كانَ يَوْمُ صَوْمِ أحَدِكُمْ فلا يَرْفُثْ ولَا يَصْخَبْ، فإنْ سَابَّهُ أحَدٌ أوْ قَاتَلَهُ، فَلْيَقُلْ: إنِّي امْرُؤٌ صَائِمٌ. والذي نَفْسُ مُحَمَّدٍ بيَدِهِ، لَخُلُوفُ فَمِ الصَّائِمِ أطْيَبُ عِنْدَ الله مِن رِيحِ المِسْكِ. لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا: إذَا أفْطَرَ فَرِحَ، وإذَا لَقِيَ رَبَّهُ فَرِحَ بصَوْمِهِ"',
            source: "صحيح البخاري 1904",
          },
        ],
      },
      {
        id: 16,
        title: "الغمرة في رمضان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: لَمَّا رَجَعَ النبيُّ صلَّى اللهُ عليه وسلَّمَ مِن حَجَّتِهِ قالَ لِأُمِّ سِنَانٍ الأنْصَارِيَّةِ: "ما مَنَعَكِ مِنَ الحَجِّ؟" قالَتْ: أبو فُلَانٍ -تَعْنِي زَوْجَهَا- كانَ له نَاضِحَانِ، حَجَّ علَى أحَدِهِمَا، والآخَرُ يَسْقِي أرْضًا لَنَا. قالَ: "فإنَّ عُمْرَةً في رَمَضَانَ تَقْضِي حَجَّةً -أوْ حَجَّةً مَعِي-"',
            source: "صحيح البخاري 1863",
          },
        ],
      },
      {
        id: 17,
        title: "صوم ثلاثة أيام من كل شهر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "أَوْصَانِي خَلِيلِي بثَلَاثٍ لا أدَعُهُنَّ حتَّى أمُوتَ: صَوْمِ ثَلَاثَةِ أيَّامٍ مِن كُلِّ شَهْرٍ، وصَلَاةِ الضُّحَى، ونَوْمٍ علَى وِتْرٍ"',
            source: "صحيح البخاري 1178",
          },
          {
            id: 2,
            title: 'عن جرير بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صيامُ ثلاثةِ أيَّامٍ من كلِّ شَهرٍ صيامُ الدَّهرِ ، وأيَّامُ البيضِ صبيحةَ ثلاثَ عشرةَ وأربعَ عشرةَ وخمسَ عشرة."',
            source: "صحيح النسائي 2419",
          },
          {
            id: 3,
            title: 'عن ملحان القيسي وقيل المنهال رضي الله عنهما قال: أن النبي صلى الله عليه وسلم "أنه كان يأمرُ بصيامِ البِيضِ : ثلاثَ عشرةَ ، وأربعَ عشرةَ ، وخمسَ عشرةَ ، ويقولُ : هو كصومُ الدهرِ ، أو كهيئةِ صومِ الدهرِ"',
            source: "صحيح ابن ماجه 2/75",
          },
        ],
      },
      {
        id: 18,
        title: "صيام ستة أيام من شوال",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن صامَ رَمَضانَ ثُمَّ أتْبَعَهُ سِتًّا مِن شَوَّالٍ، كانَ كَصِيامِ الدَّهْرِ"',
            source: "صحيح مسلم 1164",
          },
        ],
      },
      {
        id: 19,
        title: "صوم يوم في سبيل الله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخدري رَضِيَ الله عنه قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "مَن صامَ يَوْمًا في سَبيلِ الله، بَعَّدَ الله وجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا"',
            source: "صحيح البخاري 2840",
          },
          {
            id: 2,
            title: 'عن سَهلٍ بن سعد الساعدي رَضِيَ الله عنه قال: قال رسول الله صلَّى اللهُ عليه وسلَّم: "إنَّ في الجَنَّةِ بَابًا يُقَالُ له: الرَّيَّانُ، يَدْخُلُ منه الصَّائِمُونَ يَومَ القِيَامَةِ، لا يَدْخُلُ منه أحَدٌ غَيْرُهُمْ، يُقَالُ: أيْنَ الصَّائِمُونَ؟ فَيَقُومُونَ، لا يَدْخُلُ منه أحَدٌ غَيْرُهُمْ، فَإِذَا دَخَلُوا أُغْلِقَ فَلَمْ يَدْخُلْ منه أحَدٌ"',
            source: "صحيح البخاري 1896",
          },
        ],
      },
      {
        id: 20,
        title: "صيام يوم عرفة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صِيامُ يومِ عَرَفَةَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التي قَبلَهُ، والسنَةَ التي بَعدَهُ، وصِيامُ يومِ عاشُوراءَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التِي قَبْلَهُ"',
            source: "الجامع الصغير 5101",
          },
          {
            id: 2,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ سُئِلَ عن صَوْمِهِ، قالَ: فَغَضِبَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ، فَقالَ عُمَرُ رَضِيَ الله عنْه: رَضِينَا بالله رَبًّا، وَبالإسْلَامِ دِينًا، وَبِمُحَمَّدٍ رَسولًا، وَبِبَيْعَتِنَا بَيْعَةً. قالَ: فَسُئِلَ عن صِيَامِ الدَّهْرِ، فَقالَ: "لا صَامَ وَلَا أَفْطَرَ، أَوْ ما صَامَ وَما أَفْطَرَ". قالَ: فَسُئِلَ عن صَوْمِ يَومَيْنِ وإفْطَارِ يَومٍ، قالَ: "وَمَن يُطِيقُ ذلكَ؟!" قالَ: وَسُئِلَ عن صَوْمِ يَومٍ وإفْطَارِ يَومَيْنِ، قالَ: "لَيْتَ أنَّ اللَّهَ قَوَّانَا لِذلكَ". قالَ: وَسُئِلَ عن صَوْمِ يَومٍ وإفْطَارِ يَومٍ، قالَ: "ذَاكَ صَوْمُ أَخِي دَاوُدَ عليه السَّلَام". قالَ: وَسُئِلَ عن صَوْمِ يَومِ الاثْنَيْنِ، قالَ: "ذَاكَ يَوْمٌ وُلِدْتُ فِيهِ، وَيَوْمٌ بُعِثْتُ، أَوْ أُنْزِلَ عَلَيَّ فِيهِ". قالَ: فَقالَ: "صَوْمُ ثَلَاثَةٍ مِن كُلِّ شَهْرٍ، وَرَمَضَانَ إلى رَمَضَانَ؛ صَوْمُ الدَّهْرِ". قالَ: وَسُئِلَ عن صَوْمِ يَومِ عَرَفَةَ، فَقالَ: "يُكَفِّرُ السَّنَةَ المَاضِيَةَ وَالْبَاقِيَةَ". قالَ: وَسُئِلَ عن صَوْمِ يَومِ عَاشُورَاءَ، فَقالَ: "يُكَفِّرُ السَّنَةَ المَاضِيَةَ"',
            source: "صحيح مسلم 1162",
          },
        ],
      },
      {
        id: 21,
        title: "صيام يوم عاشوراء",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صِيامُ يومِ عَرَفَةَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التي قَبلَهُ، والسنَةَ التي بَعدَهُ، وصِيامُ يومِ عاشُوراءَ، إِنِّي أحْتَسِبُ على اللهِ أنْ يُكَفِّرَ السنَةَ التِي قَبْلَهُ"',
            source: "الجامع الصغير 5101",
          },
          {
            id: 2,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ سُئِلَ عن صَوْمِهِ، قالَ: فَغَضِبَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ، فَقالَ عُمَرُ رَضِيَ الله عنْه: رَضِينَا بالله رَبًّا، وَبالإسْلَامِ دِينًا، وَبِمُحَمَّدٍ رَسولًا، وَبِبَيْعَتِنَا بَيْعَةً. قالَ: فَسُئِلَ عن صِيَامِ الدَّهْرِ، فَقالَ: "لا صَامَ وَلَا أَفْطَرَ، أَوْ ما صَامَ وَما أَفْطَرَ". قالَ: فَسُئِلَ عن صَوْمِ يَومَيْنِ وإفْطَارِ يَومٍ، قالَ: "وَمَن يُطِيقُ ذلكَ؟!" قالَ: وَسُئِلَ عن صَوْمِ يَومٍ وإفْطَارِ يَومَيْنِ، قالَ: "لَيْتَ أنَّ اللَّهَ قَوَّانَا لِذلكَ". قالَ: وَسُئِلَ عن صَوْمِ يَومٍ وإفْطَارِ يَومٍ، قالَ: "ذَاكَ صَوْمُ أَخِي دَاوُدَ عليه السَّلَام". قالَ: وَسُئِلَ عن صَوْمِ يَومِ الاثْنَيْنِ، قالَ: "ذَاكَ يَوْمٌ وُلِدْتُ فِيهِ، وَيَوْمٌ بُعِثْتُ، أَوْ أُنْزِلَ عَلَيَّ فِيهِ". قالَ: فَقالَ: "صَوْمُ ثَلَاثَةٍ مِن كُلِّ شَهْرٍ، وَرَمَضَانَ إلى رَمَضَانَ؛ صَوْمُ الدَّهْرِ". قالَ: وَسُئِلَ عن صَوْمِ يَومِ عَرَفَةَ، فَقالَ: "يُكَفِّرُ السَّنَةَ المَاضِيَةَ وَالْبَاقِيَةَ". قالَ: وَسُئِلَ عن صَوْمِ يَومِ عَاشُورَاءَ، فَقالَ: "يُكَفِّرُ السَّنَةَ المَاضِيَةَ"',
            source: "صحيح مسلم 1162",
          },
        ],
      },
      {
        id: 22,
        title: "النهي عن صيام يوم الفطر ويوم النحر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: "أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ نَهَى عن صِيَامِ يَومَيْنِ، يَومِ الفِطْرِ، وَيَومِ النَّحْرِ"',
            source: "صحيح مسلم 1138",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 14,
    title: "سنن يوم الجمعة",
    sunan: [
      {
        id: 1,
        title: "التطيب",
        desc: "من السنة التطيب ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الغُسْلُ يَومَ الجُمُعَةِ واجِبٌ علَى كُلِّ مُحْتَلِمٍ، وأَنْ يَسْتَنَّ، وأَنْ يَمَسَّ طِيبًا إنْ وجَدَ". قالَ عَمْرٌو: أمَّا الغُسْلُ، فأشْهَدُ أنَّه واجِبٌ، وأَمَّا الِاسْتِنَانُ والطِّيبُ، فَاللَّهُ أعْلَمُ أوَاجِبٌ هو أمْ لَا، ولَكِنْ هَكَذَا في الحَديثِ',
            source: "صحيح البخاري 880",
          },
          {
            id: 2,
            title: 'عن أبي سعيدٍ الخدري وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "من اغتَسلَ يومَ الجمُعةِ ولبسَ مِن أحسَنِ ثيابِهِ ، ومَسَّ مِن طيبٍ إن كانَ عندَهُ ، ثمَّ أتى الجمُعةَ فلم يتخطَّ أعناقَ النَّاسِ ، ثمَّ صلَّى ما كَتبَ اللَّهُ لَهُ ، ثمَّ أنصَتَ إذا خرجَ إمامُهُ حتَّى يفرُغَ مِن صلاتِهِ كانَت كفَّارةً لما بينَها وبينَ جمعتِهِ الَّتي قبلَها" ويقولُ أبو هُرَيْرةِ : وزِيادةٌ ثلاثةُ أيَّامٍ إنَّ الحسَنةَ بعشرِ أمثالِها',
            source: "تحفة المحتاج 1/520"
          },
        ],
      },
      {
        id: 2,
        title: "الإغتسال",
        desc: "من السنة الإغتسال ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أوس بن أبي أوس وقيل أوس بن أوس والد عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "من غسَّلَ يومَ الجمعةِ واغتسلَ ثمَّ بَكَّرَ وابتَكرَ ومشى ولم يرْكب ودنا منَ الإمامِ فاستمعَ ولم يلغُ كانَ لَهُ بِكلِّ خطوةٍ عملُ سنةٍ أجرُ صيامِها وقيامِها"',
            source: "صحيح أبي داود 345",
          },
          {
            id: 2,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الغُسْلُ يَومَ الجُمُعَةِ واجِبٌ علَى كُلِّ مُحْتَلِمٍ، وأَنْ يَسْتَنَّ، وأَنْ يَمَسَّ طِيبًا إنْ وجَدَ". قالَ عَمْرٌو: أمَّا الغُسْلُ، فأشْهَدُ أنَّه واجِبٌ، وأَمَّا الِاسْتِنَانُ والطِّيبُ، فَاللَّهُ أعْلَمُ أوَاجِبٌ هو أمْ لَا، ولَكِنْ هَكَذَا في الحَديثِ',
            source: "صحيح البخاري 880",
          },
          {
            id: 3,
            title: 'عن أبي سعيدٍ الخدري وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "من اغتَسلَ يومَ الجمُعةِ ولبسَ مِن أحسَنِ ثيابِهِ ، ومَسَّ مِن طيبٍ إن كانَ عندَهُ ، ثمَّ أتى الجمُعةَ فلم يتخطَّ أعناقَ النَّاسِ ، ثمَّ صلَّى ما كَتبَ اللَّهُ لَهُ ، ثمَّ أنصَتَ إذا خرجَ إمامُهُ حتَّى يفرُغَ مِن صلاتِهِ كانَت كفَّارةً لما بينَها وبينَ جمعتِهِ الَّتي قبلَها" ويقولُ أبو هُرَيْرةِ : وزِيادةٌ ثلاثةُ أيَّامٍ إنَّ الحسَنةَ بعشرِ أمثالِها',
            source: "تحفة المحتاج 1/520",
          },
          {
            id: 4,
            title: 'عن عبدالله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا جَاءَ أحَدُكُمُ الجُمُعَةَ، فَلْيَغْتَسِلْ"',
            source: "صحيح البخاري 877",
          },
        ],
      },
      {
        id: 3,
        title: "لبس الجميل",
        desc: "من السنة لبس الجميل ليوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 2,
            title: 'عن أبي سعيدٍ الخدري وأبي هُرَيرَة رَضِيَ اللهُ عنهما، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "من اغتَسلَ يومَ الجمُعةِ ولبسَ مِن أحسَنِ ثيابِهِ ، ومَسَّ مِن طيبٍ إن كانَ عندَهُ ، ثمَّ أتى الجمُعةَ فلم يتخطَّ أعناقَ النَّاسِ ، ثمَّ صلَّى ما كَتبَ اللَّهُ لَهُ ، ثمَّ أنصَتَ إذا خرجَ إمامُهُ حتَّى يفرُغَ مِن صلاتِهِ كانَت كفَّارةً لما بينَها وبينَ جمعتِهِ الَّتي قبلَها" ويقولُ أبو هُرَيْرةِ : وزِيادةٌ ثلاثةُ أيَّامٍ إنَّ الحسَنةَ بعشرِ أمثالِها',
            source: "تحفة المحتاج 1/520"
          },
        ],
      },
      {
        id: 4,
        title: "الإنصات إلى الخطبة",
        desc: "من السنة الإنصات للخطبة يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هُرَيرَة رَضِيَ اللهُ عنه، أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم قال: "إذا قُلتَ لصاحبِكَ يومَ الجُمُعةِ: أنصِتْ والإمامُ يَخطُبُ، فقد لغوتَ"',
            source: "صحيح البخاري 934",
          },
          {
            id: 2, 
            title: 'عن أوس بن أبي أوس وقيل أوس بن أوس والد عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "من غسَّلَ يومَ الجمعةِ واغتسلَ ثمَّ بَكَّرَ وابتَكرَ ومشى ولم يرْكب ودنا منَ الإمامِ فاستمعَ ولم يلغُ كانَ لَهُ بِكلِّ خطوةٍ عملُ سنةٍ أجرُ صيامِها وقيامِها"',
            source: "صحيح أبي داود 345",
          },
        ]
      },
      {
        id: 5,
        title: "كثرة الصلاة على الرسول ﷺ",
        desc: "من السنة كثرة الصلاة على النبي صلى الله عليه وسلم يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَكثِروا الصَّلاةَ عليَّ يومَ الجمعةِ وليلةَ الجمعةِ فمن صلَّى عليَّ صلاةً صلَّى اللَّهُ عليْهِ عشرًا"',
            source: "المهذب في اختصار السنن 3/1181",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن صَلَّى عَلَيَّ واحِدَةً صَلَّى الله عليه عَشْرًا"',
            source: "صحيح مسلم 408",
          },
        ],
      },
      {
        id: 6,
        title: "التبكير إلى المسجد",
        desc: "من السنة التبكير للمسجد يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنِ اغْتَسَلَ يَومَ الجُمُعَةِ غُسْلَ الجَنَابَةِ ثُمَّ رَاحَ، فَكَأنَّما قَرَّبَ بَدَنَةً، ومَن رَاحَ في السَّاعَةِ الثَّانِيَةِ، فَكَأنَّما قَرَّبَ بَقَرَةً، ومَن رَاحَ في السَّاعَةِ الثَّالِثَةِ، فَكَأنَّما قَرَّبَ كَبْشًا أقْرَنَ، ومَن رَاحَ في السَّاعَةِ الرَّابِعَةِ، فَكَأنَّما قَرَّبَ دَجَاجَةً، ومَن رَاحَ في السَّاعَةِ الخَامِسَةِ، فَكَأنَّما قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإمَامُ حَضَرَتِ المَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ"',
            source: "صحيح البخاري 881",
          },
          {
            id: 2, 
            title: 'عن أوس بن أبي أوس وقيل أوس بن أوس والد عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "من غسَّلَ يومَ الجمعةِ واغتسلَ ثمَّ بَكَّرَ وابتَكرَ ومشى ولم يرْكب ودنا منَ الإمامِ فاستمعَ ولم يلغُ كانَ لَهُ بِكلِّ خطوةٍ عملُ سنةٍ أجرُ صيامِها وقيامِها"',
            source: "صحيح أبي داود 345",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا كانَ يَوْمُ الجُمُعَةِ وقَفَتِ المَلَائِكَةُ علَى بَابِ المَسْجِدِ يَكْتُبُونَ الأوَّلَ فَالأوَّلَ، ومَثَلُ المُهَجِّرِ كَمَثَلِ الذي يُهْدِي بَدَنَةً، ثُمَّ كَالَّذِي يُهْدِي بَقَرَةً، ثُمَّ كَبْشًا، ثُمَّ دَجَاجَةً، ثُمَّ بَيْضَةً، فَإِذَا خَرَجَ الإمَامُ طَوَوْا صُحُفَهُمْ، ويَسْتَمِعُونَ الذِّكْرَ"',
            source: "صحيح البخاري 929",
          },
        ],
      },
      {
        id: 7,
        title: "السواك",
        desc: "من السنة السواك يوم الجمعة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أن رسول الله صلى الله عليه وسلم قال: "لَوْلَا أنْ أشُقَّ علَى أُمَّتي أوْ علَى النَّاسِ لَأَمَرْتُهُمْ بالسِّوَاكِ مع كُلِّ صَلَاةٍ"',
            source: "صحيح البخاري 887",
          },
        ],
      },
      {
        id: 8,
        title: "قراءة سورة الكهف",
        desc: "من السنة قراءة سورة الكهف يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أبي سَعيدٍ الخُدريِّ عنِ النبيِّ صلَّى اللهُ عليه وسلَّم أنَّه قال: "مَن قَرَأَ سورةَ الكَهفِ يومَ الجُمُعةِ أضاءَ له من النورِ ما بَينَ الجُمُعتينِ"',
            source: "صحيح الجامع 6470",
          },
          {
            id: 2,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ"',
            source: "صحيح مسلم 809",
          },
        ],
      },
      {
        id: 9,
        title: "تحري ساعة الإجابة",
        desc: "من السنة الدعاء ساعة الإجابة يوم الجمعة.",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ ذَكَرَ يَومَ الجُمُعَةِ، فَقالَ: فيه سَاعَةٌ، لا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ، وهو قَائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ تَعَالَى شيئًا، إلَّا أعْطَاهُ إيَّاهُ وأَشَارَ بيَدِهِ يُقَلِّلُهَا"',
            source: "صحيح البخاري 935",
          },
        ],
      },
      {
        id: 10,
        title: "الذهاب إلى صلاة الجمعة ماشيا",
        desc: "من السنة الذهاب إلى صلاة الجمعة ماشيا.",
        isFavorite: false,
        ahadith: [
          {
            id: 1, 
            title: 'عن أوس بن أبي أوس وقيل أوس بن أوس والد عمرو رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "من غسَّلَ يومَ الجمعةِ واغتسلَ ثمَّ بَكَّرَ وابتَكرَ ومشى ولم يرْكب ودنا منَ الإمامِ فاستمعَ ولم يلغُ كانَ لَهُ بِكلِّ خطوةٍ عملُ سنةٍ أجرُ صيامِها وقيامِها"',
            source: "صحيح أبي داود 345",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَلا أدُلُّكُمْ علَى ما يَمْحُو الله به الخَطايا، ويَرْفَعُ به الدَّرَجاتِ؟" قالُوا بَلَى يا رَسولَ اللهِ، قالَ: "إسْباغُ الوُضُوءِ علَى المَكارِهِ، وكَثْرَةُ الخُطا إلى المَساجِدِ، وانْتِظارُ الصَّلاةِ بَعْدَ الصَّلاةِ، فَذَلِكُمُ الرِّباطُ." وليسَ في حَديثِ شُعْبَةَ ذِكْرُ الرِّباطِ. وفي حَديثِ مالِكٍ ثِنْتَيْنِ "فَذَلِكُمُ الرِّباطُ، فَذَلِكُمُ الرِّباطُ"',
            source: "صحيح مسلم 251",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أقيمَتِ الصَّلاةُ ، فلا تَأتوها وأنتُمْ تَسعونَ ، ولَكِن ائتوها وأنتُمْ تمشونَ ، وعليكُمُ السَّكينةَ فما أدرَكْتُمْ فصلُّوا ، وما فاتَكُم فأتمُّوا"',
            source: "صحيح الترمذي 327",
          },
          {
            id: 4,
            title: 'عن أبي هريرة رضي الله عنه قال: بيْنَما نَحْنُ نُصَلِّي مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ إذْ سَمِعَ جَلَبَةَ رِجَالٍ، فَلَمَّا صَلَّى قَالَ: "ما شَأْنُكُمْ؟" قالوا: اسْتَعْجَلْنَا إلى الصَّلَاةِ؟ قَالَ: "فلا تَفْعَلُوا إذَا أتَيْتُمُ الصَّلَاةَ فَعلَيْكُم بالسَّكِينَةِ، فَما أدْرَكْتُمْ فَصَلُّوا وما فَاتَكُمْ فأتِمُّوا"',
            source: "صحيح البخاري 635",
          },
        ],
      },
      {
        id: 11,
        title: "عدم الحبوة يوم الجمعة",
        desc: "من السنة عدم الحبوة يوم الجمعة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن أنس رضي الله عنه قال: "أنَّ رسولَ الله صلَّى اللهُ عليْهِ وسلَّمَ نَهى عنِ الحبوَةِ يومَ الجمعةِ والإمامُ يخطُب"',
            source: "صحيح أبي داود 1110",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 15,
    title: "سنن الصلاة",
    sunan: [
      //sitra
      {
        id: 1,
        title: "وضع السترة في الصلاة إذا كان إماما أو منفردا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخُدريِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "إذا صلَّى أحَدُكم فليُصَلِّ إلى سُترةٍ ولْيَدْنُ منها"',
            source: "الجامع الصغير 713",
          },
          {
            id: 2,
            title: 'عن أبي ذَرٍّ الغِفاريِّ رضيَ اللهُ عنه، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "إذا قام أحَدُكم يُصلِّي، فإنَّه يستُرُه إذا كان بين يديه مِثلُ آخِرَةِ الرَّحْلِ، فإذا لم يكُنْ بين يديه مِثلُ آخِرَةِ الرَّحْلِ، فإنَّه يقطَعُ صلاتَه الحِمارُ والمرأةُ والكلبُ الأسودُ"',
            source: "صحيح مسلم 510",
          },
          {
            id: 3,
            title: 'عن أبي سعيدٍ الخُدريِّ رضيَ اللهُ عنه، قال: "سمِعْتُ النبيَّ صلَّى اللهُ عليه وسلَّم يقولُ: إذا صلَّى أحَدُكم إلى شيءٍ يستُرُه مِن النَّاسِ فأراد أحدٌ أنْ يجتازَ بين يديه فليدفَعْه، فإن أبى فليُقاتِلْه؛ فإنَّما هو شيطانٌ"',
            source: "صحيح البخاري 509",
          },
        ],
      },
      {
        id: 2,
        title: "رد المار بين يدي المصلي",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيدٍ الخُدريِّ رضيَ اللهُ عنه، قال: "سمِعْتُ النبيَّ صلَّى اللهُ عليه وسلَّم يقولُ: إذا صلَّى أحَدُكم إلى شيءٍ يستُرُه مِن النَّاسِ فأراد أحدٌ أنْ يجتازَ بين يديه فليدفَعْه، فإن أبى فليُقاتِلْه؛ فإنَّما هو شيطانٌ"',
            source: "صحيح البخاري 509",
          },
        ]
      },

      //others
      {
        id: 3,
        title: "الصلاة بالنعل",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خالِفوا اليَهودَ فإنَّهم لا يصلُّونَ في نعالِهِم ولا خفافِهِم"',
            source: "صحيح أبي داود 652",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه أن سُئِلَ: "أكانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يُصَلِّي في نَعْلَيْهِ؟" قالَ: "نَعَمْ"',
            source: "صحيح البخاري 386",
          },
        ],
      },
      {
        id: 4,
        title: "التفل على اليسار ثلاثا عند الوسوسة في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عُثْمَانَ بنَ أَبِي العَاصِ الثقفي رضي الله عنه أنه أَتَى النَّبيَّ صَلَّى الله عليه وسلَّمَ، فَقالَ: يا رَسولَ اللهِ، إنَّ الشَّيْطَانَ قدْ حَالَ بَيْنِي وبيْنَ صَلَاتي وَقِرَاءَتي؛ يَلْبِسُهَا عَلَيَّ، فَقالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "ذَاكَ شيطَانٌ يُقَالُ له: خَنْزَبٌ، فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ باللَّهِ منه، وَاتْفِلْ علَى يَسَارِكَ ثَلَاثًا". قالَ: فَفَعَلْتُ ذلكَ، فأذْهَبَهُ الله عَنِّي',
            source: "صحيح مسلم 2203",
          },
        ],
      },
      {
        id: 5,
        title: "الصلاة في وقتها",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قَالَ: "الذي تَفُوتُهُ صَلَاةُ العَصْرِ، كَأنَّما وُتِرَ أهْلَهُ ومَالَهُ"',
            source: "صحيح البخاري 552",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: سَأَلْتُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ: أيُّ العَمَلِ أحَبُّ إلى الله؟ قالَ: "الصَّلاةُ علَى وقْتِها"، قالَ: ثُمَّ أيٌّ؟ قالَ: "ثُمَّ برُّ الوالِدَيْنِ"، قالَ: ثُمَّ أيٌّ؟ قالَ: "الجِهادُ في سَبيلِ الله"، قالَ: حدَّثَني بهِنَّ، ولَوِ اسْتَزَدْتُهُ لَزادَنِي',
            source: "صحيح البخاري 527",
          },
          {
            id: 3,
            title: 'عن أبي المَليحِ بنُ أُسامةَ الهُذَليُّ رضي الله عنه قال: كُنَّا مع بُرَيْدَةَ في غَزْوَةٍ في يَومٍ ذِي غَيْمٍ، فَقَالَ: بَكِّرُوا بصَلَاةِ العَصْرِ؛ فإنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ قَالَ: "مَن تَرَكَ صَلَاةَ العَصْرِ فقَدْ حَبِطَ عَمَلُهُ"',
            source: "صحيح البخاري 553",
          },
          {
            id: 4,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ بيْنَ الرَّجُلِ وبيْنَ الشِّرْكِ والْكُفْرِ تَرْكَ الصَّلاةِ"',
            source: "صحيح مسلم 82",
          },
        ],
      },
      {
        id: 6,
        title: "الصلاة في جماعة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صَلَاةُ الجَمَاعَةِ تَفْضُلُ صَلَاةَ الفَذِّ بسَبْعٍ وعِشْرِينَ دَرَجَةً"',
            source: "صحيح البخاري 645",
          },
          {
            id: 2,
            title: 'عن عبدُ الرَّحْمنِ بنُ أَبي عَمْرةَ رضي الله عنه قال: دَخَلَ عُثْمَانُ بنُ عَفَّانَ -رضي الله عنه- المَسْجِدَ بَعْدَ صَلَاةِ المَغْرِبِ، فَقَعَدَ وَحْدَهُ، فَقَعَدْتُ إلَيْهِ فَقالَ: يا ابْنَ أَخِي، سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ: "مَن صَلَّى العِشَاءَ في جَمَاعَةٍ فَكَأنَّما قَامَ نِصْفَ اللَّيْلِ، وَمَن صَلَّى الصُّبْحَ في جَمَاعَةٍ فَكَأنَّما صَلَّى اللَّيْلَ كُلَّهُ."',
            source: "صحيح مسلم 656",
          },
        ],
      },
      {
        id: 7,
        title: "عدم ضم الثياب فوق بعضها البعض في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
            source: "صحيح البخاري 812",
          },
        ],
      },
      {
        id: 8,
        title: "عدم ربط الشعر في الصلاة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
            source: "صحيح البخاري 812",
          },
        ],
      },
      {
        id: 9,
        title: "الصلاة في مسجد قباء",
        ahadith: [
          {
            id: 1,
            title: 'عن سهل بن حنيف رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من تطَهَّرَ في بيتِهِ , ثمَّ أتى مسجدَ قباءٍ ، فصلَّى فيهِ صلاةً ، كانَ لَهُ كأجرِ عمرةٍ."',
            source: "صحيح ابن ماجه 1168",
          },
        ],
      },
     
  
      //roko3
      {
        id: 10,
        title: "وضع اليدين على الركبتين وتفريج الأصابع",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي حميد الساعدي رضي الله عنه قال: أنَّهُ كانَ جَالِسًا مع نَفَرٍ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَذَكَرْنَا صَلَاةَ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَقَالَ أبو حُمَيْدٍ السَّاعِدِيُّ: "أنَا كُنْتُ أحْفَظَكُمْ لِصَلَاةِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ رَأَيْتُهُ إذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ، وإذَا رَكَعَ أمْكَنَ يَدَيْهِ مِن رُكْبَتَيْهِ، ثُمَّ هَصَرَ ظَهْرَهُ، فَإِذَا رَفَعَ رَأْسَهُ اسْتَوَى حتَّى يَعُودَ كُلُّ فَقَارٍ مَكَانَهُ، فَإِذَا سَجَدَ وضَعَ يَدَيْهِ غيرَ مُفْتَرِشٍ ولَا قَابِضِهِمَا، واسْتَقْبَلَ بأَطْرَافِ أصَابِعِ رِجْلَيْهِ القِبْلَةَ، فَإِذَا جَلَسَ في الرَّكْعَتَيْنِ جَلَسَ علَى رِجْلِهِ اليُسْرَى، ونَصَبَ اليُمْنَى، وإذَا جَلَسَ في الرَّكْعَةِ الآخِرَةِ قَدَّمَ رِجْلَهُ اليُسْرَى، ونَصَبَ الأُخْرَى وقَعَدَ علَى مَقْعَدَتِهِ"',
            source: "صحيح البخاري 828",
          },
        ],
      },
      {
        id: 11,
        title: "مد الظهر مستويا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي حميد الساعدي رضي الله عنه قال: أنَّهُ كانَ جَالِسًا مع نَفَرٍ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَذَكَرْنَا صَلَاةَ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَقَالَ أبو حُمَيْدٍ السَّاعِدِيُّ: "أنَا كُنْتُ أحْفَظَكُمْ لِصَلَاةِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ رَأَيْتُهُ إذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ، وإذَا رَكَعَ أمْكَنَ يَدَيْهِ مِن رُكْبَتَيْهِ، ثُمَّ هَصَرَ ظَهْرَهُ، فَإِذَا رَفَعَ رَأْسَهُ اسْتَوَى حتَّى يَعُودَ كُلُّ فَقَارٍ مَكَانَهُ، فَإِذَا سَجَدَ وضَعَ يَدَيْهِ غيرَ مُفْتَرِشٍ ولَا قَابِضِهِمَا، واسْتَقْبَلَ بأَطْرَافِ أصَابِعِ رِجْلَيْهِ القِبْلَةَ، فَإِذَا جَلَسَ في الرَّكْعَتَيْنِ جَلَسَ علَى رِجْلِهِ اليُسْرَى، ونَصَبَ اليُمْنَى، وإذَا جَلَسَ في الرَّكْعَةِ الآخِرَةِ قَدَّمَ رِجْلَهُ اليُسْرَى، ونَصَبَ الأُخْرَى وقَعَدَ علَى مَقْعَدَتِهِ"',
            source: "صحيح البخاري 828",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ يَسْتَفْتِحُ الصَّلَاةَ بالتَّكْبِيرِ. والْقِرَاءَةِ، بـ {الْحَمْدُ لِلَّهِ رَبِّ العَالَمِينَ} [الفاتحة:2]، وكانَ إذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ، ولَمْ يُصَوِّبْهُ ولَكِنْ بيْنَ ذلكَ، وكانَ إذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ لَمْ يَسْجُدْ، حتَّى يَسْتَوِيَ قَائِمًا، وكانَ إذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ، لَمْ يَسْجُدْ حتَّى يَسْتَوِيَ جَالِسًا، وكانَ يقولُ في كُلِّ رَكْعَتَيْنِ التَّحِيَّةَ، وكانَ يَفْرِشُ رِجْلَهُ اليُسْرَى ويَنْصِبُ رِجْلَهُ اليُمْنَى، وكانَ يَنْهَى عن عُقْبَةِ الشَّيْطَانِ. ويَنْهَى أنْ يَفْتَرِشَ الرَّجُلُ ذِرَاعَيْهِ افْتِرَاشَ السَّبُعِ، وكانَ يَخْتِمُ الصَّلَاةَ بالتَّسْلِيمِ. وفي رِوَايَةِ ابْنِ نُمَيْرٍ، عن أبِي خَالِدٍ، وكانَ يَنْهَى عن عَقِبِ الشَّيْطَانِ"',
            source: "صحيح مسلم 498",
          },
        ],
      },
      {
        id: 12,
        title: "مجافات المرفقين عن الجنبين في الركوع",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي حميد الساعدي رضي الله عنه قال: أنَّهُ كانَ جَالِسًا مع نَفَرٍ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَذَكَرْنَا صَلَاةَ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَقَالَ أبو حُمَيْدٍ السَّاعِدِيُّ: "أنَا كُنْتُ أحْفَظَكُمْ لِصَلَاةِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ رَأَيْتُهُ إذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ، وإذَا رَكَعَ أمْكَنَ يَدَيْهِ مِن رُكْبَتَيْهِ، ثُمَّ هَصَرَ ظَهْرَهُ، فَإِذَا رَفَعَ رَأْسَهُ اسْتَوَى حتَّى يَعُودَ كُلُّ فَقَارٍ مَكَانَهُ، فَإِذَا سَجَدَ وضَعَ يَدَيْهِ غيرَ مُفْتَرِشٍ ولَا قَابِضِهِمَا، واسْتَقْبَلَ بأَطْرَافِ أصَابِعِ رِجْلَيْهِ القِبْلَةَ، فَإِذَا جَلَسَ في الرَّكْعَتَيْنِ جَلَسَ علَى رِجْلِهِ اليُسْرَى، ونَصَبَ اليُمْنَى، وإذَا جَلَسَ في الرَّكْعَةِ الآخِرَةِ قَدَّمَ رِجْلَهُ اليُسْرَى، ونَصَبَ الأُخْرَى وقَعَدَ علَى مَقْعَدَتِهِ"',
            source: "صحيح البخاري 828",
          },
        ],
      },
      {
        id: 13,
        title: "تعظيم الله في الركوع",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: كَشَفَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ السِّتَارَةَ والنَّاسُ صُفُوفٌ خَلْفَ أبِي بَكْرٍ، فَقالَ: "أيُّها النَّاسُ، إنَّه لَمْ يَبْقَ مِن مُبَشِّرَاتِ النُّبُوَّةِ إلَّا الرُّؤْيَا الصَّالِحَةُ، يَرَاهَا المُسْلِمُ، أوْ تُرَى له، ألَا وإنِّي نُهِيتُ أنْ أقْرَأَ القُرْآنَ رَاكِعًا، أوْ سَاجِدًا، فأمَّا الرُّكُوعُ فَعَظِّمُوا فيه الرَّبَّ عزَّ وجلَّ، وأَمَّا السُّجُودُ فَاجْتَهِدُوا في الدُّعَاءِ، فَقَمِنٌ أنْ يُسْتَجَابَ لَكُمْ." قالَ أبو بَكْرٍ، حَدَّثَنَا سُفْيَانُ، عن سُلَيْمَانَ',
            source: "صحيح مسلم 479",
          },
        ],
      },
      {
        id: 14,
        title: "ما يقال في الركوع",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: صَلَّيْتُ مع النبيِّ صَلَّى الله عليه وسلَّمَ ذَاتَ لَيْلَةٍ، فَافْتَتَحَ البَقَرَةَ، فَقُلتُ: يَرْكَعُ عِنْدَ المِائَةِ، ثُمَّ مَضَى، فَقُلتُ: يُصَلِّي بهَا في رَكْعَةٍ، فَمَضَى، فَقُلتُ: يَرْكَعُ بهَا، ثُمَّ افْتَتَحَ النِّسَاءَ، فَقَرَأَهَا، ثُمَّ افْتَتَحَ آلَ عِمْرَانَ، فَقَرَأَهَا، يَقْرَأُ مُتَرَسِّلًا؛ إذَا مَرَّ بآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ، وإذَا مَرَّ بسُؤَالٍ سَأَلَ، وإذَا مَرَّ بتَعَوُّذٍ تَعَوَّذَ، ثُمَّ رَكَعَ، فَجَعَلَ يقولُ: "سُبْحَانَ رَبِّيَ العَظِيمِ"، فَكانَ رُكُوعُهُ نَحْوًا مِن قِيَامِهِ، ثُمَّ قالَ: سَمِعَ الله لِمَن حَمِدَهُ، ثُمَّ قَامَ طَوِيلًا قَرِيبًا ممَّا رَكَعَ، ثُمَّ سَجَدَ، فَقالَ: سُبْحَانَ رَبِّيَ الأعْلَى، فَكانَ سُجُودُهُ قَرِيبًا مِن قِيَامِهِ. وفي رواية زيادة: سَمِعَ الله لِمَن حَمِدَهُ، رَبَّنَا لكَ الحَمْدُ',
            source: "صحيح مسلم 772",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ كانَ يقولُ: في رُكُوعِهِ وسُجُودِهِ "سُبُّوحٌ قُدُّوسٌ، رَبُّ المَلَائِكَةِ والرُّوحِ"',
            source: "صحيح مسلم 487",
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّم يُكْثِرُ أنْ يَقُولَ في رُكُوعِهِ وسُجُودِهِ: "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي." يَتَأَوَّلُ القُرْآنَ',
            source: "صحيح البخاري 4968",
          },
          {
            id: 4,
            title: 'عن علي بن أبي طالب رضي الله عنه، عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، أنَّهُ كانَ إذَا قَامَ إلى الصَّلَاةِ، قالَ: "وَجَّهْتُ وَجْهي لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأرْضَ حَنِيفًا، وَما أَنَا مِنَ المُشْرِكِينَ، إنَّ صَلَاتِي وَنُسُكِي، وَمَحْيَايَ وَمَمَاتي لِلَّهِ رَبِّ العَالَمِينَ، لا شَرِيكَ له، وَبِذلكَ أُمِرْتُ وَأَنَا مِنَ المُسْلِمِينَ، اللَّهُمَّ أَنْتَ المَلِكُ لا إلَهَ إلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بذَنْبِي، فَاغْفِرْ لي ذُنُوبِي جَمِيعًا، إنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأخْلَاقِ، لا يَهْدِي لأَحْسَنِهَا إلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لا يَصْرِفُ عَنِّي سَيِّئَهَا إلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ في يَدَيْكَ، وَالشَّرُّ ليسَ إلَيْكَ، أَنَا بكَ وإلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إلَيْكَ." وإذَا رَكَعَ قالَ: "اللَّهُمَّ لكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لكَ سَمْعِي وَبَصَرِي، وَمُخِّي، وَعَظْمِي وَعَصَبِي." وإذَا رَفَعَ قالَ: "اللَّهُمَّ رَبَّنَا لكَ الحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الأرْضِ، وَمِلْءَ ما بيْنَهُمَا وَمِلْءَ ما شِئْتَ مِن شَيءٍ بَعْدُ." وإذَا سَجَدَ قالَ: "اللَّهُمَّ لكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ." ثُمَّ يَكونُ مِن آخِرِ ما يقولُ بيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ: "اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَسْرَفْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، لا إلَهَ إلَّا أَنْتَ"',
            source: "صحيح مسلم 771"
          },
          {
            id: 5,
            title: 'عن عوف بن مالك الأشجعي رضي الله عنه قال: قُمتُ معَ رسولِ الله صلَّى الله عليهِ وسلَّمَ ليلةً ، فقامَ فقرأَ سورةَ البقرةِ ، لا يمرُّ بآيةِ رحمةٍ إلَّا وقفَ فَسألَ ، ولا يمرُّ بآيةِ عَذابٍ إلَّا وقَفَ فتعوَّذَ ، قالَ: ثمَّ رَكَعَ بقَدرِ قيامِهِ ، يقولُ في رُكوعِهِ: "سُبحانَ ذي الجبَروتِ والملَكوتِ والكِبرياءِ والعَظَمةِ" ، ثمَّ سجدَ بقدرِ قيامِهِ ، ثمَّ قالَ في سُجودِهِ مثلَ ذلِكَ ، ثمَّ قامَ فقرأَ بآلِ عمرانَ ، ثمَّ قرأَ سورةً سورةً',
            source: "صحيح أبي داود 873",
          },
        ],
      },

      //9iyam
      {
        id: 15,
        title: "رفع اليدين عند تكبيرة الإحرام والركوع والرفع من الركوع وبعد القيام من التشهد الأول",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ كانَ يَرْفَعُ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ إذَا افْتَتَحَ الصَّلَاةَ، وإذَا كَبَّرَ لِلرُّكُوعِ، وإذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ، رَفَعَهُما كَذلكَ أَيْضًا، وقالَ: سَمِعَ الله لِمَن حَمِدَهُ، رَبَّنَا ولَكَ الحَمْدُ، وكانَ لا يَفْعَلُ ذلكَ في السُّجُودِ."',
            source: "صحيح البخاري 735",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ ابْنَ عُمَرَ، كانَ إذَا دَخَلَ في الصَّلَاةِ كَبَّرَ ورَفَعَ يَدَيْهِ، وإذَا رَكَعَ رَفَعَ يَدَيْهِ، وإذَا قَالَ: سَمِعَ الله لِمَن حَمِدَهُ، رَفَعَ يَدَيْهِ، وإذَا قَامَ مِنَ الرَّكْعَتَيْنِ رَفَعَ يَدَيْهِ، ورَفَعَ ذلكَ ابنُ عُمَرَ إلى نَبِيِّ الله صَلَّى اللهُ عليه وسلَّمَ"',
            source: "صحيح البخاري 739",
          },
        ],
      },
      {
        id: 16,
        title: "مد الأصابع عند رفع اليدين",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: "كانَ رسولُ الله صلَّى الله عليهِ وسلَّمَ إذا دَخلَ في الصَّلاةِ رفعَ يَديهِ مَدًّا"',
            source: "صحيح أبي داود 753",
          },
        ],
      },
      {
        id: 17,
        title: "رفع اليدين إلى الموضع المسنون",
        ahadith: [
          {
            id: 1,
            title: 'عن مالك بن الحويرث رضي الله عنه قال: "أنَّهُ رأى النَّبيَّ صلَّى الله عليهِ وسلَّمَ رفعَ يدَيهِ في صلاتِهِ ، وإذا رَكَعَ وإذا رفعَ رأسَهُ منَ الرُّكوعِ وإذا سجدَ ، وإذا رفعَ رأسَهُ منَ السُّجودِ حتَّى يحاذِيَ بِهِما فروعَ أذُنَيْهِ"',
            source: "صحيح النسائي 1084",
          },
        ],
      },
      {
        id: 18,
        title: "وضع اليد اليمنى على اليسرى",
        ahadith: [
          {
            id: 1,
            title: 'عن وائل بن حجر رضي الله عنه قال: "أنَّهُ رَأَى النبيَّ صَلَّى الله عليه وسلَّمَ رَفَعَ يَدَيْهِ حِينَ دَخَلَ في الصَّلَاةِ كَبَّرَ، وصَفَ هَمَّامٌ حِيَالَ أُذُنَيْهِ، ثُمَّ التَحَفَ بثَوْبِهِ، ثُمَّ وضَعَ يَدَهُ اليُمْنَى علَى اليُسْرَى، فَلَمَّا أرَادَ أنْ يَرْكَعَ أخْرَجَ يَدَيْهِ مِنَ الثَّوْبِ، ثُمَّ رَفَعَهُمَا، ثُمَّ كَبَّرَ فَرَكَعَ، فَلَمَّا قالَ: سَمِعَ اللَّهُ لِمَن حَمِدَهُ رَفَعَ يَدَيْهِ فَلَمَّا، سَجَدَ سَجَدَ بيْنَ كَفَّيْهِ."',
            source: "صحيح مسلم 401",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عباس وعبد الله بن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إِنَّا معشرَ الأنبياءِ ، أُمِرْنَا أنْ نُّعجِلَ إفطارَنا ، ونؤخِرَ سحورَنا ، ونَضَعَ أيمانَنَا عَلَى شمائِلِنا في الصلاةِ"',
            source: "صحيح الجامع 2286",
          },
          {
            id: 3,
            title: 'عن عبد الله بن مسعود رضي الله عنه، "أنَّهُ كانَ يصلِّي فوَضعَ يدَهُ اليُسرى على اليُمنى، فرآهُ النَّبيُّ صلَّى الله عليهِ وسلَّمَ فوضعَ يدَهُ اليُمنَى على اليُسرَى"',
            source: "صحيح أبي داود 755",
          },
        ],
      },

      //sojod
      {
        id: 19,
        title: "الدعاء في السجود",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: كَشَفَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ السِّتَارَةَ والنَّاسُ صُفُوفٌ خَلْفَ أبِي بَكْرٍ، فَقالَ: "أيُّها النَّاسُ، إنَّه لَمْ يَبْقَ مِن مُبَشِّرَاتِ النُّبُوَّةِ إلَّا الرُّؤْيَا الصَّالِحَةُ، يَرَاهَا المُسْلِمُ، أوْ تُرَى له، ألَا وإنِّي نُهِيتُ أنْ أقْرَأَ القُرْآنَ رَاكِعًا، أوْ سَاجِدًا، فأمَّا الرُّكُوعُ فَعَظِّمُوا فيه الرَّبَّ عزَّ وجلَّ، وأَمَّا السُّجُودُ فَاجْتَهِدُوا في الدُّعَاءِ، فَقَمِنٌ أنْ يُسْتَجَابَ لَكُمْ." قالَ أبو بَكْرٍ، حَدَّثَنَا سُفْيَانُ، عن سُلَيْمَانَ',
            source: "صحيح مسلم 479",
          },
        ],
      },
      {
        id: 20,
        title: "ما يقال في السجود",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: صَلَّيْتُ مع النبيِّ صَلَّى الله عليه وسلَّمَ ذَاتَ لَيْلَةٍ، فَافْتَتَحَ البَقَرَةَ، فَقُلتُ: يَرْكَعُ عِنْدَ المِائَةِ، ثُمَّ مَضَى، فَقُلتُ: يُصَلِّي بهَا في رَكْعَةٍ، فَمَضَى، فَقُلتُ: يَرْكَعُ بهَا، ثُمَّ افْتَتَحَ النِّسَاءَ، فَقَرَأَهَا، ثُمَّ افْتَتَحَ آلَ عِمْرَانَ، فَقَرَأَهَا، يَقْرَأُ مُتَرَسِّلًا؛ إذَا مَرَّ بآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ، وإذَا مَرَّ بسُؤَالٍ سَأَلَ، وإذَا مَرَّ بتَعَوُّذٍ تَعَوَّذَ، ثُمَّ رَكَعَ، فَجَعَلَ يقولُ: سُبْحَانَ رَبِّيَ العَظِيمِ، فَكانَ رُكُوعُهُ نَحْوًا مِن قِيَامِهِ، ثُمَّ قالَ: سَمِعَ الله لِمَن حَمِدَهُ، ثُمَّ قَامَ طَوِيلًا قَرِيبًا ممَّا رَكَعَ، ثُمَّ سَجَدَ، فَقالَ: "سُبْحَانَ رَبِّيَ الأعْلَى"، فَكانَ سُجُودُهُ قَرِيبًا مِن قِيَامِهِ. وفي رواية زيادة: سَمِعَ الله لِمَن حَمِدَهُ، رَبَّنَا لكَ الحَمْدُ',
            source: "صحيح مسلم 772",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ كانَ يقولُ: في رُكُوعِهِ وسُجُودِهِ "سُبُّوحٌ قُدُّوسٌ، رَبُّ المَلَائِكَةِ والرُّوحِ"',
            source: "صحيح مسلم 487",
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّم يُكْثِرُ أنْ يَقُولَ في رُكُوعِهِ وسُجُودِهِ: "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي." يَتَأَوَّلُ القُرْآنَ',
            source: "صحيح البخاري 4968",
          },
          {
            id: 4,
            title: 'عن علي بن أبي طالب رضي الله عنه، عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، أنَّهُ كانَ إذَا قَامَ إلى الصَّلَاةِ، قالَ: "وَجَّهْتُ وَجْهي لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأرْضَ حَنِيفًا، وَما أَنَا مِنَ المُشْرِكِينَ، إنَّ صَلَاتِي وَنُسُكِي، وَمَحْيَايَ وَمَمَاتي لِلَّهِ رَبِّ العَالَمِينَ، لا شَرِيكَ له، وَبِذلكَ أُمِرْتُ وَأَنَا مِنَ المُسْلِمِينَ، اللَّهُمَّ أَنْتَ المَلِكُ لا إلَهَ إلَّا أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بذَنْبِي، فَاغْفِرْ لي ذُنُوبِي جَمِيعًا، إنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأخْلَاقِ، لا يَهْدِي لأَحْسَنِهَا إلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لا يَصْرِفُ عَنِّي سَيِّئَهَا إلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ في يَدَيْكَ، وَالشَّرُّ ليسَ إلَيْكَ، أَنَا بكَ وإلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إلَيْكَ." وإذَا رَكَعَ قالَ: "اللَّهُمَّ لكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لكَ سَمْعِي وَبَصَرِي، وَمُخِّي، وَعَظْمِي وَعَصَبِي." وإذَا رَفَعَ قالَ: "اللَّهُمَّ رَبَّنَا لكَ الحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الأرْضِ، وَمِلْءَ ما بيْنَهُمَا وَمِلْءَ ما شِئْتَ مِن شَيءٍ بَعْدُ." وإذَا سَجَدَ قالَ: "اللَّهُمَّ لكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ." ثُمَّ يَكونُ مِن آخِرِ ما يقولُ بيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ: "اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَسْرَفْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، لا إلَهَ إلَّا أَنْتَ"',
            source: "صحيح مسلم 771"
          },
          {
            id: 5,
            title: 'عن عوف بن مالك الأشجعي رضي الله عنه قال: قُمتُ معَ رسولِ الله صلَّى الله عليهِ وسلَّمَ ليلةً ، فقامَ فقرأَ سورةَ البقرةِ ، لا يمرُّ بآيةِ رحمةٍ إلَّا وقفَ فَسألَ ، ولا يمرُّ بآيةِ عَذابٍ إلَّا وقَفَ فتعوَّذَ ، قالَ: ثمَّ رَكَعَ بقَدرِ قيامِهِ ، يقولُ في رُكوعِهِ: "سُبحانَ ذي الجبَروتِ والملَكوتِ والكِبرياءِ والعَظَمةِ" ، ثمَّ سجدَ بقدرِ قيامِهِ ، ثمَّ قالَ في سُجودِهِ مثلَ ذلِكَ ، ثمَّ قامَ فقرأَ بآلِ عمرانَ ، ثمَّ قرأَ سورةً سورةً',
            source: "صحيح أبي داود 873",
          },
          {
            id: 6,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ كانَ يقولُ: في سُجُودِهِ "اللَّهُمَّ اغْفِرْ لي ذَنْبِي كُلَّهُ دِقَّهُ، وجِلَّهُ، وأَوَّلَهُ وآخِرَهُ وعَلانِيَتَهُ وسِرَّهُ"',
            source: "صحيح مسلم 483",
          },
          {
            id: 7,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: فقدتُ رسولَ الله صلَّى الله عليْهِ وسلَّمَ من مضجعِهِ فجعلتُ ألتمسُهُ وظننتُ أنَّهُ أتى بعضَ جواريهِ فوقعَت يدي عليْهِ وَهوَ ساجدٌ وَهوَ يقولُ "اللَّهمَّ اغفر لي ما أسررتُ وما أعلنتُ"',
            source: "صحيح النسائي 1123",
          },
          {
            id: 8,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: بِتُّ في بَيْتِ خَالَتي مَيْمُونَةَ، فَبَقَيْتُ كيفَ يُصَلِّي رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ، قالَ: فَقَامَ فَبَالَ، ثُمَّ غَسَلَ وَجْهَهُ وَكَفَّيْهِ، ثُمَّ نَامَ، ثُمَّ قَامَ إلى القِرْبَةِ فأطْلَقَ شِنَاقَهَا، ثُمَّ صَبَّ في الجَفْنَةِ -أَوِ القَصْعَةِ- فأكَبَّهُ بيَدِهِ عَلَيْهَا، ثُمَّ تَوَضَّأَ وُضُوءًا حَسَنًا بيْنَ الوُضُوءَيْنِ، ثُمَّ قَامَ يُصَلِّي، فَجِئْتُ فَقُمْتُ إلى جَنْبِهِ، فَقُمْتُ عن يَسَارِهِ، قالَ: فأخَذَنِي فأقَامَنِي عن يَمِينِهِ، فَتَكَامَلَتْ صَلَاةُ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ ثَلَاثَ عَشْرَةَ رَكْعَةً، ثُمَّ نَامَ حتَّى نَفَخَ، وَكُنَّا نَعْرِفُهُ إذَا نَامَ بنَفْخِهِ، ثُمَّ خَرَجَ إلى الصَّلَاةِ فَصَلَّى، فَجَعَلَ يقولُ في صَلَاتِهِ -أَوْ في سُجُودِهِ-: "اللَّهُمَّ اجْعَلْ في قَلْبِي نُورًا، وفي سَمْعِي نُورًا، وفي بَصَرِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتي نُورًا، وَاجْعَلْ لي نُورًا"، أَوْ قالَ: "وَاجْعَلْنِي نُورًا". [وفي رواية]: فَلَقِيتُ كُرَيْبًا، فَقالَ: قالَ ابنُ عَبَّاسٍ: كُنْتُ عِنْدَ خَالَتي مَيْمُونَةَ، فَجَاءَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ...، ثُمَّ ذَكَرَ بمِثْلِ حَديثِ غُنْدَرٍ، بِمِثْلِهِ وَقالَ: وَاجْعَلْنِي نُورًا، وَلَمْ يَشُكَّ',
            source: "صحيح مسلم 6316",
          },
          {
            id: 9,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: فقَدْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ لَيْلَةً مِنَ الفِرَاشِ فَالْتَمَسْتُهُ فَوَقَعَتْ يَدِي علَى بَطْنِ قَدَمَيْهِ وهو في المَسْجِدِ وهُما مَنْصُوبَتَانِ وهو يقولُ: "اللَّهُمَّ أعُوذُ برِضَاكَ مِن سَخَطِكَ، وبِمُعَافَاتِكَ مِن عُقُوبَتِكَ، وأَعُوذُ بكَ مِنْكَ لا أُحْصِي ثَنَاءً عَلَيْكَ أنْتَ كما أثْنَيْتَ علَى نَفْسِكَ"',
            source: "صحيح مسلم 486",
          },
        ],
      },
      {
        id: 200,
        title: "إستقبال القبلة بأطراف أصابع الرجلين",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي حميد الساعدي رضي الله عنه أنَّهُ كانَ جَالِسًا مع نَفَرٍ مِن أصْحَابِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَذَكَرْنَا صَلَاةَ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَقَالَ أبو حُمَيْدٍ السَّاعِدِيُّ: "أنَا كُنْتُ أحْفَظَكُمْ لِصَلَاةِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ رَأَيْتُهُ إذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ، وإذَا رَكَعَ أمْكَنَ يَدَيْهِ مِن رُكْبَتَيْهِ، ثُمَّ هَصَرَ ظَهْرَهُ، فَإِذَا رَفَعَ رَأْسَهُ اسْتَوَى حتَّى يَعُودَ كُلُّ فَقَارٍ مَكَانَهُ، فَإِذَا سَجَدَ وضَعَ يَدَيْهِ غيرَ مُفْتَرِشٍ ولَا قَابِضِهِمَا، واسْتَقْبَلَ بأَطْرَافِ أصَابِعِ رِجْلَيْهِ القِبْلَةَ، فَإِذَا جَلَسَ في الرَّكْعَتَيْنِ جَلَسَ علَى رِجْلِهِ اليُسْرَى، ونَصَبَ اليُمْنَى، وإذَا جَلَسَ في الرَّكْعَةِ الآخِرَةِ قَدَّمَ رِجْلَهُ اليُسْرَى، ونَصَبَ الأُخْرَى وقَعَدَ علَى مَقْعَدَتِهِ"',
            source: "صحيح البخاري 828",
          },
        ],
      },
      {
        id: 21,
        title: "السجود على سبع أعظم",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أُمِرْتُ أنْ أسْجُدَ علَى سَبْعَةِ أعْظُمٍ علَى الجَبْهَةِ، وأَشَارَ بيَدِهِ علَى أنْفِهِ واليَدَيْنِ والرُّكْبَتَيْنِ، وأَطْرَافِ القَدَمَيْنِ ولَا نَكْفِتَ الثِّيَابَ والشَّعَرَ"',
            source: "صحيح البخاري 812",
          },
        ],
      },
      {
        id: 22,
        title: "مجافاة العضدين عن الجنب والبطن عن الفخذين",
        ahadith: [
          {
            id: 1,
            title: 'عن ميمونة بنت الحارث أم المؤمنين رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللَّهُ عليه وسلَّمَ إذَا سَجَدَ لو شَاءَتْ بَهْمَةٌ أنْ تَمُرَّ بيْنَ يَدَيْهِ لَمَرَّتْ"',
            source: "صحيح مسلم 496",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مالك بن بحينة رضي الله عنه قال: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ إذَا صَلَّى فَرَّجَ بيْنَ يَدَيْهِ حتَّى يَبْدُوَ بَيَاضُ إبْطَيْهِ"',
            source: "صحيح البخاري 390",
          },
        ],
      },

      //after sojod
      {
        id: 23,
        title: "الدعاء بعد التشهد الأخير قبل التسليم من الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: كُنَّا لا نَدْري ما نقولُ في كلِّ ركعتَيْنِ، غيرَ أنْ نُسبِّحَ ونُكبِّرَ ونَحمَدَ ربَّنا، وإنَّ مُحمَّدًا صلَّى اللهُ عليه وسلَّمَ عَلَّمَ فواتِحَ الخيرِ وخواتمَهِ، فقال: "إذا قعَدْتُمْ في كلِّ ركعتَيْنِ، فقولوا: التَّحيَّاتُ للهِ، والصَّلواتُ، والطَّيِّباتُ، السَّلامُ عليكَ أيُّها النبيُّ ورحمةُ اللهِ وبركاتُهُ، السَّلامَ علينا وعلى عبادِ اللهِ الصالحينَ، أشهَدُ أنْ لا إلهَ إلَّا اللهُ، وأشهَدُ أنَّ مُحمَّدًا عبدُهُ ورسولُهُ، وَلْيتخيَّرْ أحدُكم مِنَ الدُّعاءِ أَعْجَبَهَ إليه، فَلْيَدْعُ اللهَ عزَّ وجلَّ"',
            source: "صحيح النسائي 1162",
          },
        ],
      },


      //after praying
      {
        id: 24,
        title: "الإستغفار ثلاثا بعد الصلاة والدعاء",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن ثوبان مولى رسول الله صلى الله عليه وسلم قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ، إذَا انْصَرَفَ مِن صَلَاتِهِ اسْتَغْفَرَ ثَلَاثًا وَقالَ: اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ." قالَ الوَلِيدُ: فَقُلتُ لِلأَوْزَاعِيِّ: كيفَ الاسْتِغْفَارُ؟ قالَ: تَقُولُ: أَسْتَغْفِرُ اللَّهَ، أَسْتَغْفِرُ اللَّهَ.',
            source: "صحيح مسلم 591",
          },
        ],
      },
      {
        id: 25,
        title: "قراءة آية الكرسي بعد كل صلاة مَكْتوبةٍ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أمامة البهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قرأَ آيةَ الكرسيِّ دبُرَ كلِّ صلاةٍ مَكْتوبةٍ ، لم يمنَعهُ مِن دخولِ الجنَّةِ ، إلَّا الموتُ"',
            source: "بلوغ المرام 97",
          },
        ],
      },
      {
        id: 26,
        title: "قراءة المعوذات (الإخلاص والفلق والناس) بعد الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عُقبةَ بنِ عامرٍ رضي الله عنه قالَ: "أمرَني رسولُ الله صلَّى الله علَيهِ وسلَّمَ أن أقرأَ بالمعوِّذاتِ دُبُرَ كلِّ صلاةٍ"',
            source: "صحيح أبي داود 1523",
          },
        ],
      },
      {
        id: 27,
        title: "التسبيح والتحميد والتكبير بعد الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنهما  قال: قال رسول الله صلى الله عليه وسلم: "خصلتان، أو خلتان لا يحافظُ عليهما عبدٌ مسلمٌ إلا دخل الجنةَ، هما يسيرٌ، ومن يعملُ بهما قليلٌ، يسبِّحً في دُبُرِ كلِّ صلاةٍ عشْرًا، ويحمَدَ عشْرًا ، ويكبِّرُ عشْرًا، فذلك خمسون ومائةٌ باللسانِ، وألفٌ وخمسمائةٍ في الميزانِ، ويكبِّرُ أربعًا وثلاثين إذا أخذ مضجعَه ، ويحمَدُ ثلاثًا وثلاثين ، ويسبِّحُ ثلاثًا وثلاثين ، فذلك مائةٌ باللسانِ ، وألفٌ في الميزانِ." فلقد رأيتُ رسولُ اللهِ صلى الله عليه وسلم يعقِدُها بيدِه ، قالوا: يا رسولَ اللهِ ، كيف هما يسيرٌ ومن يعملُ بهما قليلٌ؟ قال: "يأتي أحدَكم – يعني الشيطانَ – في منامِه فيُنَوِّمُه قبل أن يقولَه ، ويأتيه في صلاتِه فيُذَكِّرَه حاجةً قبلَ أن يقولَها"',
            source: "صحيح أبي داود 5065",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: جاءَ الفُقَراءُ إلى النبيِّ صَلَّى اللهُ عليه وسلَّمَ، فقالوا: ذَهَبَ أهْلُ الدُّثُورِ مِنَ الأمْوالِ بالدَّرَجاتِ العُلا، والنَّعِيمِ المُقِيمِ يُصَلُّونَ كما نُصَلِّي، ويَصُومُونَ كما نَصُومُ، ولَهُمْ فَضْلٌ مِن أمْوالٍ يَحُجُّونَ بها، ويَعْتَمِرُونَ، ويُجاهِدُونَ، ويَتَصَدَّقُونَ، قالَ: "ألا أُحَدِّثُكُمْ إنْ أخَذْتُمْ أدْرَكْتُمْ مَن سَبَقَكُمْ ولَمْ يُدْرِكْكُمْ أحَدٌ بَعْدَكُمْ، وكُنْتُمْ خَيْرَ مَن أنتُمْ بيْنَ ظَهْرانَيْهِ إلَّا مَن عَمِلَ مِثْلَهُ تُسَبِّحُونَ وتَحْمَدُونَ وتُكَبِّرُونَ خَلْفَ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ"، فاخْتَلَفْنا بيْنَنا، فقالَ بَعْضُنا: نُسَبِّحُ ثَلاثًا وثَلاثِينَ، ونَحْمَدُ ثَلاثًا وثَلاثِينَ، ونُكَبِّرُ أرْبَعًا وثَلاثِينَ، فَرَجَعْتُ إلَيْهِ، فقالَ: تَقُولُ: "سُبْحانَ الله، والحَمْدُ لله، والله أكْبَرُ، حتَّى يَكونَ منهنَّ كُلِّهِنَّ ثَلاثًا وثَلاثِينَ"',
            source: "صحيح البخاري 843",
          },
          {
            id: 3,
            title: 'عن زيد بن ثابت رضي الله عنه قال: أُمِرنَا أن نسبّحَ دبرَ كل صلاةٍ ثلاثا وثلاثينَ ، ونحمدهُ ثلاثا وثلاثينَ ، ونكبرهُ أربعا وثلاثينَ ، قال : فرأى رجلٌ من الأنصارِ في المَنامِ ، فقال : أَمركُم رسولُ اللهِ صلى الله عليه وسلم أن تسبّحوا في دبرِ كل صلاةٍ ثلاثا وثلاثينَ ، وتحْمدوا اللهَ ثلاثا وثلاثينِ ؟ وتكبّروا أربعا وثلاثينَ ، قال : نعم ، قال : "فاجعلُوا خمسا وعشرينَ واجْعلوا التهليلَ معهنَّ" ، فغدا على النبي صلى الله عليه وسلم ، فحدّثهُ ، فقال : "افْعلوا"',
            source: "سنن الترمذي 3413",
          },
          {
            id: 4,
            title: 'عن كعب بن عجرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مُعَقِّباتٌ لا يَخِيبُ قائِلُهُنَّ، أوْ فاعِلُهُنَّ، دُبُرَ كُلِّ صَلاةٍ مَكْتُوبَةٍ، ثَلاثٌ وثَلاثُونَ تَسْبِيحَةً، وثَلاثٌ وثَلاثُونَ تَحْمِيدَةً، وأَرْبَعٌ وثَلاثُونَ تَكْبِيرَةً."',
            source: "صحيح مسلم 596",
          },
          {
            id: 5,
            title: 'عن أبي هريرة رضي الله عنه، عَنْ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ "مَن سَبَّحَ اللَّهَ في دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ، وحَمِدَ اللَّهَ ثَلاثًا وثَلاثِينَ، وكَبَّرَ اللَّهَ ثَلاثًا وثَلاثِينَ، فَتْلِكَ تِسْعَةٌ وتِسْعُونَ، وقالَ: تَمامَ المِئَةِ: لا إلَهَ إلَّا الله وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ وهو علَى كُلِّ شيءٍ قَدِيرٌ غُفِرَتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ."',
            source: "صحيح مسلم 597",
          },
        ],
      },
      {
        id: 28,
        title: "ما يقال بعد الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن جبل رضي الله عنه قال: أنَّ رسولَ الله صلَّى الله علَيهِ وسلَّمَ أخذَ بيدِهِ، وقالَ: "يا مُعاذُ، والله إنِّي لأحبُّكَ، والله إنِّي لأحبُّك"، فقالَ: "أوصيكَ يا معاذُ لا تدَعنَّ في دُبُرَ كلِّ صلاةٍ تقولُ: اللَّهمَّ أعنِّي على ذِكْرِكَ، وشُكْرِكَ، وحُسنِ عبادتِكَ"',
            source: "صحيح أبي داود 1522",
          },
          {
            id: 2,
            title: 'عن المغيرة بن شعبة رضي الله عنه قال: إنَّ نَبِيَّ الله صَلَّى اللهُ عليه وسلَّمَ كانَ يقولُ في دُبُرِ كُلِّ صَلَاةٍ: "لا إلَهَ إلَّا الله وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ" وكَتَبَ إلَيْهِ إنَّه كانَ يَنْهَى عن قيلَ وقالَ، وكَثْرَةِ السُّؤَالِ، وإضَاعَةِ المَالِ، وكانَ يَنْهَى عن عُقُوقِ الأُمَّهَاتِ، ووَأْدِ البَنَاتِ، ومَنْعٍ وهَاتِ.',
            source: "صحيح البخاري 7292",
          },
          {
            id: 3,
            title: 'عن عبد الله بن الزبير رضي الله عنه أنه كانَ يقولُ: في دُبُرِ كُلِّ صَلَاةٍ حِينَ يُسَلِّمُ "لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، لا حَوْلَ وَلَا قُوَّةَ إلَّا بالله، لا إلَهَ إلَّا الله، وَلَا نَعْبُدُ إلَّا إيَّاهُ، له النِّعْمَةُ وَلَهُ الفَضْلُ، وَلَهُ الثَّنَاءُ الحَسَنُ، لا إلَهَ إلَّا الله مُخْلِصِينَ له الدِّينَ ولو كَرِهَ الكَافِرُونَ" وَقالَ: "كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ يُهَلِّلُ بهِنَّ دُبُرَ كُلِّ صَلَاةٍ". [وفي رواية]:أنَّ عَبْدَ اللهِ بنَ الزُّبَيْرِ كانَ يُهَلِّلُ دُبُرَ كُلِّ صَلَاةٍ... بمِثْلِ حَديثِ ابْنِ نُمَيْرٍ وَقالَ في آخِرِهِ: ثُمَّ يقولُ ابنُ الزُّبَيْرِ: كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ يُهَلِّلُ بهِنَّ دُبُرَ كُلِّ صَلَاةٍ. وفي روايةٍ : سَمِعْتُ عَبْدَ اللهِ بنَ الزُّبَيْرِ، يَخْطُبُ علَى هذا المِنْبَرِ وَهو يقولُ: كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ إذَا سَلَّمَ في دُبُرِ الصَّلَاةِ أَوِ الصَّلَوَاتِ، فَذَكَرَ بمِثْلِ حَديثِ هِشَامِ بنِ عُرْوَةَ. وفي رواية : أنَّهُ سَمِعَ عَبْدَ اللهِ بنَ الزُّبَيْرِ، وَهو يقولُ: في إثْرِ الصَّلَاةِ إذَا سَلَّمَ، بمِثْلِ حَديثِهِمَا، وَقالَ في آخِرِهِ: وَكانَ يَذْكُرُ ذلكَ عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ',
            source: "صحيح مسلم 594",
          },
          {
            id: 4,
            title: 'عن البراء بن عازب رضي الله عنه قال: كُنَّا إذَا صَلَّيْنَا خَلْفَ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، أَحْبَبْنَا أَنْ نَكُونَ عن يَمِينِهِ، يُقْبِلُ عَلَيْنَا بوَجْهِهِ، قالَ: فَسَمِعْتُهُ يقولُ: "رَبِّ قِنِي عَذَابَكَ يَومَ تَبْعَثُ -أَوْ تَجْمَعُ- عِبَادَكَ."',
            source: "صحيح مسلم 709",
          },
          {
            id: 5,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: إنَّ رسولَ اللهِ صلَّى اللهُ عليْهِ وسلَّمَ كان يتعوَّذُ بهنَّ في دُبُرِ كلِّ صلاةٍ "اللَّهمَّ إني أعوذُ بك من البخلِ ، وأعوذُ بك من الجبنِ ، وأعوذُ بك من أن أُرَدَّ إلى أرذلِ العمرِ ، وأعوذُ بك من فتنةِ الدنيا وعذابِ القبرِ"',
            source: "صحيح النسائي 5494"
          }
        ],
      },
    ],
  },
  //done sourced
  {
    id: 16,
    title: "سنن الخلاء",
    sunan: [
      {
        id: 1,
        title: "قول باسم الله قبل دخول الخلاء",
        ahadith: [
          {
            id: 1,
            title: 'عن علي بن أبي طالب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "سَتْرُ ما بينَ أَعْيُنِ الجِنِّ و عَوْرَاتِ بَنِي آدمَ إذا دخلَ أحدُهُمْ الخلاء أنْ يقولَ : بسمِ اللهِ"',
            source: "صحيح الجامع 3611",
          },
        ],
      },
      {
        id: 2,
        title: 'قول "اللهم إني أعوذ بك من الخبث والخبائث" عند دخول الخلاء',
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ الخَلَاءَ قالَ: اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الخُبُثِ والخَبَائِثِ"',
            source: "صحيح البخاري 142",
          },
        ]
      },
      {
        id: 3,
        title: 'قول "غفرانك" عند الخروج من الخلاء',
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها، قالت: "أنَّ النَّبيَّ صلَّى اللهُ علَيهِ وسلَّمَ كان إذا خرجَ من الغائطِ قال غُفرانَكَ"',
            source: "صحيح أبي داود 30",
          },
        ],
      },
      {
        id: 4,
        title: "الدخول بالرجل اليسرى",
        ahadith: [
          {
            id: 1,
            title: 'عن حارثةَ بنِ وَهبٍ الخُزاعيِّ، قال: "حَدَّثَتْني حَفصةُ زَوجُ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يَجعَلُ يَمينَه لطعامِه وشَرابِه وثِيابِه، ويجعَلُ شِمالَه لِما سِوى ذلك"',
            source: "صحيح أبي داود 32",
          },
        ],
      },
      {
        id: 5,
        title: "ستر الجسد والثياب من مماسة البول",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: مَرَّ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَائِطٍ مِن حِيطَانِ المَدِينَةِ، أوْ مَكَّةَ، فَسَمِعَ صَوْتَ إنْسَانَيْنِ يُعَذَّبَانِ في قُبُورِهِمَا، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: "يُعَذَّبَانِ، وما يُعَذَّبَانِ في كَبِيرٍ ثُمَّ قالَ: بَلَى، كانَ أحَدُهُما لا يَسْتَتِرُ مِن بَوْلِهِ، وكانَ الآخَرُ يَمْشِي بالنَّمِيمَةِ. ثُمَّ دَعَا بجَرِيدَةٍ، فَكَسَرَهَا كِسْرَتَيْنِ، فَوَضَعَ علَى كُلِّ قَبْرٍ منهما كِسْرَةً، فقِيلَ له: يا رَسولَ اللَّهِ، لِمَ فَعَلْتَ هذا؟ قالَ: لَعَلَّهُ أنْ يُخَفَّفَ عنْهما ما لَمْ تَيْبَسَا أوْ: إلى أنْ يَيْبَسَا"',
            source: "صحيح البخاري 216",
          },
        ],
      },
      {
        id: 6,
        title: "ترك التكلم بذكر أو بغيره",
        ahadith: [
          {
            id: 1,
            title: 'عن المهاجر بن قنفذ رضي الله عنه أنَّهُ أتى النَّبيَّ صلَّى الله عليهِ وسلَّمَ وَهوَ يبولُ فسلَّمَ عليهِ فلم يردَّ عليهِ حتَّى تَوضَّأ ثمَّ اعتذرَ إليهِ فقالَ "إنِّي كَرِهْتُ أن أذكرَ اللَّهَ عزَّ وجلَّ إلَّا علَى طُهْرٍ أو قالَ علَى طَهارةٍ"',
            source: "صحيح أبي داود 17",
          },
        ],
      },
      {
        id: 7,
        title: "تكريم اليد اليمنى عن مس الفرج",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا شَرِبَ أحَدُكُمْ فلا يَتَنَفَّسْ في الإناءِ، وإذا بالَ أحَدُكُمْ فلا يَمْسَحْ ذَكَرَهُ بيَمِينِهِ، وإذا تَمَسَّحَ أحَدُكُمْ فلا يَتَمَسَّحْ بيَمِينِهِ"',
            source: "صحيح البخاري 153",
          },
        ],
      },
      {
        id: 8,
        title: "عدم الاستنجاء باليمين",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا شَرِبَ أحَدُكُمْ فلا يَتَنَفَّسْ في الإناءِ، وإذا بالَ أحَدُكُمْ فلا يَمْسَحْ ذَكَرَهُ بيَمِينِهِ، وإذا تَمَسَّحَ أحَدُكُمْ فلا يَتَمَسَّحْ بيَمِينِهِ"',
            source: "صحيح البخاري 153",
          },
          {
            id: 2,
            title: 'عن حفصة أم المؤمنين رضي الله عنها قالت: "أنَّ النَّبيَّ صلَّى الله عليهِ وسلَّمَ كانَ يجعلُ يمينَهُ لطعامِهِ وشرابِهِ وثيابِهِ ، ويجعلُ شمالَهُ لما سوى ذلِكَ"',
            source: "صحيح أبي داود 32",
          },
          {
            id: 3,
            title: 'عن سلمان الفارسي رضي الله عنه قال: قالَ لنا المُشْرِكُونَ إنِّي أرَى صاحِبَكُمْ يُعَلِّمُكُمْ حتَّى يُعَلِّمَكُمُ الخِراءَةَ، فقالَ: "أجَلْ إنَّه نَهانا أنْ يَسْتَنْجِيَ أحَدُنا بيَمِينِهِ، أوْ يَسْتَقْبِلَ القِبْلَةَ، ونَهَى عَنِ الرَّوْثِ والْعِظامِ وقالَ: لا يَسْتَنْجِي أحَدُكُمْ بدُونِ ثَلاثَةِ أحْجارٍ"',
            source: "صحيح مسلم 262",
          },
        ],
      },
      {
        id: 9,
        title: "عدم قضاء الحاجة في طريق مسلوك وظل نافع ومورد ماء",
        ahadith: [
          {
            id: 1,
            title: 'عن معاذ بن جبل رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اتَّقوا الملاعنَ الثَّلاثَ البَرازَ في المواردِ وقارعةِ الطَّريقِ والظِّلِّ"',
            source: "صحيح أبي داود 26",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسُولَ اللهِ صَلَّى الله عليه وَسَلَّمَ قالَ: "اتَّقُوا اللَّعَّانَيْنِ" قالوا: وَما اللَّعَّانَانِ يا رَسُولَ اللهِ؟ قالَ: "الذي يَتَخَلَّى في طَرِيقِ النَّاسِ، أَوْ في ظِلِّهِمْ"',
            source: "صحيح مسلم 269",
          },
        ],
      },
      {
        id: 10,
        title: "عدم قضاء الحاجة في الماء",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "عَنْ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ أنَّه نَهَى أنْ يُبالَ في الماءِ الرَّاكِدِ"',
            source: "صحيح مسلم 281",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَبُولَنَّ أحَدُكُمْ في المَاءِ الدَّائِمِ الذي لا يَجْرِي، ثُمَّ يَغْتَسِلُ فِيهِ"',
            source: "صحيح البخاري 239",
          },
        ],
      },
      {
        id: 11,
        title: "عدم التبول في مكان الوضوء ومكان الاستحمام",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مُغفَّل رضي الله عنه عن النبي صلى الله عليه وسلم قال: "لا يبولَنَّ أحدُكم في مُستحَمِّه، فإنَّ عامَّةَ الوَسْواسِ منه"',
            source: "شرح ابن ماجه لمغلطاي 1/105",
          },
          {
            id: 2,
            title: 'عَن حُمَيْدِ بنِ عبدِ الرَّحمنِ الحِميريِّ قالَ: "لقيتُ رجلًا صَحِبَ النَّبيَّ صلَّى الله عليهِ وسلَّمَ كما صحبَهُ أبو هُرَيْرةَ رضيَ اللَّهُ عنهُ قالَ: نَهَى رَسولُ الله صلَّى الله عليهِ وسلَّمَ أن يمتَشِطَ أحدُنا كلَّ يومٍ ، أو يَبولَ في مغتَسلِهِ ، أو يغتسِلَ الرَّجلُ بفضلِ المرأةِ ، والمرأةُ بفضلِ الرَّجلِ ، وليغتَرِفا جميعًا"',
            source: "صحيح النسائي 238",
          },
        ],
      },
      {
        id: 12,
        title: "اجتناب قضاء الحاجة في المساجد",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "بيْنَما نَحْنُ في المَسْجِدِ مع رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ. إذْ جاءَ أعْرابِيٌّ فَقامَ يَبُولُ في المَسْجِدِ، فقالَ أصْحابُ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: مَهْ مَهْ، قالَ: قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: لا تُزْرِمُوهُ دَعُوهُ فَتَرَكُوهُ حتَّى بالَ، ثُمَّ إنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ دَعاهُ فقالَ له: إنَّ هذِه المَساجِدَ لا تَصْلُحُ لِشيءٍ مِن هذا البَوْلِ، ولا القَذَرِ إنَّما هي لِذِكْرِ اللهِ عزَّ وجلَّ، والصَّلاةِ وقِراءَةِ القُرْآنِ، أوْ كما قالَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ قالَ: فأمَرَ رَجُلًا مِنَ القَوْمِ فَجاءَ بدَلْوٍ مِن ماءٍ فَشَنَّهُ عليه"',
            source: "صحيح مسلم 285",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ أعْرَابِيًّا بَالَ في المَسْجِدِ، فَثَارَ إلَيْهِ النَّاسُ ليَقَعُوا به، فَقالَ لهمْ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: "دَعُوهُ، وأَهْرِيقُوا علَى بَوْلِهِ ذَنُوبًا مِن مَاءٍ -أوْ سَجْلًا مِن مَاءٍ- فإنَّما بُعِثْتُمْ مُيَسِّرِينَ ولَمْ تُبْعَثُوا مُعَسِّرِينَ"',
            source: "صحيح البخاري 6128",
          },
        ],
      },
      {
        id: 13,
        title: "الاستتار من الناس",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبي قُراد رضي الله عنه قال: "خرَجتُ معَ رسولِ الله إلى الخَلاءِ ، وَكانَ إذا أرادَ الحاجةَ أبعَدَ"',
            source: "صحيح النسائي 16",
          },
          {
            id: 2,
            title: 'عن المغيرة بن شعبة رضي الله عنه قال: ،"كُنْتُ مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ في سَفَرٍ، فَقالَ: يا مُغِيرَةُ خُذِ الإدَاوَةَ، فأخَذْتُهَا، فَانْطَلَقَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ حتَّى تَوَارَى عَنِّي، فَقَضَى حَاجَتَهُ، وعليه جُبَّةٌ شَأْمِيَّةٌ، فَذَهَبَ لِيُخْرِجَ يَدَهُ مِن كُمِّهَا فَضَاقَتْ، فأخْرَجَ يَدَهُ مِن أسْفَلِهَا، فَصَبَبْتُ عليه، فَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ، ومَسَحَ علَى خُفَّيْهِ، ثُمَّ صَلَّى"',
            source: "صحيح البخاري 363",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنِ اكتحل فلْيوتر منْ فعَل فقد أحسن ومنْ لا فلا حرَجَ ، ومنِ استَجمر فلْيوتر منْ فعَل فقد أحسن ومنْ لا فلا حرَجَ ، ومنْ أكَل فما تَخلَّل فليَلْفِظْ وما لاك بلسانِه فلْيَبتلِعْ مَنْ فعَل فقدْ أحسن ومَنْ لا فلا حرَجَ ، ومن أتى الغائطَ فليَستتر فإنْ لم يَجِدْ إلا أنْ يَجمعَ كثِيبًا منْ رملٍ فليَستدْبِره فإنَّ الشيطانَ يلعبُ بمقاعدِ بني آدمَ ، منْ فعَل فقد أحسَن ومَنْ لا فَلا حرَج"',
            source: "البدر المنير 2/300",
          },
        ],
      },
      {
        id: 14,
        title: "يستحب لمن استجمر بالحجارة أن يوتر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا تَوَضَّأَ أحَدُكُمْ فَلْيَجْعَلْ في أنْفِهِ، ثُمَّ لِيَنْثُرْ، ومَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وإذَا اسْتَيْقَظَ أحَدُكُمْ مِن نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أنْ يُدْخِلَهَا في وَضُوئِهِ؛ فإنَّ أحَدَكُمْ لا يَدْرِي أيْنَ بَاتَتْ يَدُهُ"',
            source: "صحيح البخاري 162",
          },
        ],
      },
      {
        id: 15,
        title: "عدم الاستجمار بروث أو عظم أو طعام",
        ahadith: [
          {
            id: 1,
            title: 'عن سلمان الفارسي رضي الله عنه قال: قالَ لنا المُشْرِكُونَ إنِّي أرَى صاحِبَكُمْ يُعَلِّمُكُمْ حتَّى يُعَلِّمَكُمُ الخِراءَةَ، فقالَ: "أجَلْ إنَّه نَهانا أنْ يَسْتَنْجِيَ أحَدُنا بيَمِينِهِ، أوْ يَسْتَقْبِلَ القِبْلَةَ، ونَهَى عَنِ الرَّوْثِ والْعِظامِ وقالَ: لا يَسْتَنْجِي أحَدُكُمْ بدُونِ ثَلاثَةِ أحْجارٍ"',
            source: "صحيح مسلم 262",
          },
        ],
      },
      {
        id: 16,
        title: "غسل اليد بالصابون ونحوه بعد الخروج من الخلاء",
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين ميمونة بنت الحارث رضي الله عنها قالت: "صَبَبْتُ للنبيِّ صَلَّى اللهُ عليه وسلَّمَ غُسْلًا، فأفْرَغَ بيَمِينِهِ علَى يَسَارِهِ فَغَسَلَهُمَا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ قالَ بيَدِهِ الأرْضَ فَمَسَحَهَا بالتُّرَابِ، ثُمَّ غَسَلَهَا، ثُمَّ تَمَضْمَضَ واسْتَنْشَقَ، ثُمَّ غَسَلَ وجْهَهُ، وأَفَاضَ علَى رَأْسِهِ، ثُمَّ تَنَحَّى، فَغَسَلَ قَدَمَيْهِ، ثُمَّ أُتِيَ بمِنْدِيلٍ فَلَمْ يَنْفُضْ بهَا"',
            source: "صحيح البخاري 259",
          },
        ],
      },
      {
        id: 17,
        title: "عدم استقبال القبلة واستدبارها في الخلاء دون البنيان",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا جَلَسَ أَحَدُكُمْ علَى حَاجَتِهِ، فلا يَسْتَقْبِلِ القِبْلَةَ، وَلَا يَسْتَدْبِرْهَا"',
            source: "صحيح مسلم 265",
          },
          {
            id: 2,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ قالَ: "إذَا أتَيْتُمُ الغَائِطَ فلا تَسْتَقْبِلُوا القِبْلَةَ، ولَا تَسْتَدْبِرُوهَا ولَكِنْ شَرِّقُوا أوْ غَرِّبُوا" قالَ أبو أيُّوبَ: فَقَدِمْنَا الشَّأْمَ فَوَجَدْنَا مَرَاحِيضَ بُنِيَتْ قِبَلَ القِبْلَةِ فَنَنْحَرِفُ، ونَسْتَغْفِرُ اللَّهَ تَعَالَى',
            source: "صحيح البخاري 394",
          },
          {
            id: 3,
            title: 'عن سلمان الفارسي رضي الله عنه قال: قالَ لنا المُشْرِكُونَ إنِّي أرَى صاحِبَكُمْ يُعَلِّمُكُمْ حتَّى يُعَلِّمَكُمُ الخِراءَةَ، فقالَ: "أجَلْ إنَّه نَهانا أنْ يَسْتَنْجِيَ أحَدُنا بيَمِينِهِ، أوْ يَسْتَقْبِلَ القِبْلَةَ، ونَهَى عَنِ الرَّوْثِ والْعِظامِ وقالَ: لا يَسْتَنْجِي أحَدُكُمْ بدُونِ ثَلاثَةِ أحْجارٍ"',
            source: "صحيح مسلم 262",
          },
        ],
      },
      {
        id: 18,
        title: "التنزه من البول والغائط",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ عَامَّةَ عذابِ القبرِ مِنَ البولِ فَتَنَزَّهوا مِنَ البولِ"',
            source: "شرح مشكل الآثار 13/189",
          },
        ],
      },
      {
        id: 19,
        title: "الخروج بالرجل اليمنى",
        ahadith: [
          {
            id: 1,
            title: 'عن حارثةَ بنِ وَهبٍ الخُزاعيِّ، قال: "حَدَّثَتْني حَفصةُ زَوجُ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يَجعَلُ يَمينَه لطعامِه وشَرابِه وثِيابِه، ويجعَلُ شِمالَه لِما سِوى ذلك"',
            source: "صحيح أبي داود 32",
          },
        ],
      },
    ],
  },
  //need 2
  {
    id: 17,
    title: "سنن الدعاء",
    sunan: [
      {
        id: 1,
        title: "الدعاء على طهارة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: لَمَّا فَرَغَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ مِن حُنَيْنٍ، بَعَثَ أبَا عَامِرٍ علَى جَيْشٍ إلى أوْطَاسٍ، فَلَقِيَ دُرَيْدَ بنَ الصِّمَّةِ، فَقُتِلَ دُرَيْدٌ، وهَزَمَ الله أصْحَابَهُ. قالَ أبو مُوسَى: وبَعَثَنِي مع أبِي عَامِرٍ، فَرُمِيَ أبو عَامِرٍ في رُكْبَتِهِ؛ رَمَاهُ جُشَمِيٌّ بسَهْمٍ فأثْبَتَهُ في رُكْبَتِهِ، فَانْتَهَيْتُ إلَيْهِ، فَقُلتُ: يا عَمِّ، مَن رَمَاكَ؟ فأشَارَ إلى أبِي مُوسَى فَقالَ: ذَاكَ قَاتِلِي الذي رَمَانِي، فَقَصَدْتُ له فَلَحِقْتُهُ، فَلَمَّا رَآنِي ولَّى، فَاتَّبَعْتُهُ وجَعَلْتُ أقُولُ له: ألَا تَسْتَحْيِي! ألَا تَثْبُتُ! فَكَفَّ، فَاخْتَلَفْنَا ضَرْبَتَيْنِ بالسَّيْفِ فَقَتَلْتُهُ، ثُمَّ قُلتُ لأبِي عَامِرٍ: قَتَلَ الله صَاحِبَكَ، قالَ: فَانْزِعْ هذا السَّهْمَ، فَنَزَعْتُهُ فَنَزَا منه المَاءُ، قالَ: يا ابْنَ أخِي، أقْرِئِ النَّبيَّ صلَّى اللهُ عليه وسلَّمَ السَّلَامَ، وقُلْ له: اسْتَغْفِرْ لِي. واسْتَخْلَفَنِي أبو عَامِرٍ علَى النَّاسِ، فَمَكُثَ يَسِيرًا ثُمَّ مَاتَ، فَرَجَعْتُ فَدَخَلْتُ علَى النَّبيِّ صلَّى اللهُ عليه وسلَّمَ في بَيْتِهِ علَى سَرِيرٍ مُرْمَلٍ وعليه فِرَاشٌ، قدْ أثَّرَ رِمَالُ السَّرِيرِ بظَهْرِهِ وجَنْبَيْهِ، فأخْبَرْتُهُ بخَبَرِنَا وخَبَرِ أبِي عَامِرٍ، وقالَ: قُلْ له: اسْتَغْفِرْ لِي، "فَدَعَا بمَاءٍ فَتَوَضَّأَ، ثُمَّ رَفَعَ يَدَيْهِ فَقالَ: اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أبِي عَامِرٍ." ورَأَيْتُ بَيَاضَ إبْطَيْهِ، ثُمَّ قالَ: "اللَّهُمَّ اجْعَلْهُ يَومَ القِيَامَةِ فَوْقَ كَثِيرٍ مِن خَلْقِكَ مِنَ النَّاسِ". فَقُلتُ: ولِي فَاسْتَغْفِرْ، فَقالَ: "اللَّهُمَّ اغْفِرْ لِعَبْدِ الله بنِ قَيْسٍ ذَنْبَهُ، وأَدْخِلْهُ يَومَ القِيَامَةِ مُدْخَلًا كَرِيمًا". قالَ أبو بُرْدَةَ: إحْدَاهُما لأبِي عَامِرٍ، والأُخْرَى لأبِي مُوسَى.',
            source: "صحيح البخاري 4323",
          },
        ],
      },
      {
        id: 2,
        title: "إستقبال القبلة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس وعمر بن الخطاب رضي الله عنهما قال: "لَمَّا كانَ يَوْمُ بَدْرٍ نَظَرَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ إلى المُشْرِكِينَ وَهُمْ أَلْفٌ، وَأَصْحَابُهُ ثَلَاثُ مِائَةٍ وَتِسْعَةَ عَشَرَ رَجُلًا، فَاسْتَقْبَلَ نَبِيُّ اللهِ صَلَّى الله عليه وَسَلَّمَ القِبْلَةَ، ثُمَّ مَدَّ يَدَيْهِ، فَجَعَلَ يَهْتِفُ برَبِّهِ: اللَّهُمَّ أَنْجِزْ لي ما وَعَدْتَنِي، اللَّهُمَّ آتِ ما وَعَدْتَنِي، اللَّهُمَّ إنْ تُهْلِكْ هذِه العِصَابَةَ مِن أَهْلِ الإسْلَامِ لا تُعْبَدْ في الأرْضِ، فَما زَالَ يَهْتِفُ برَبِّهِ، مَادًّا يَدَيْهِ مُسْتَقْبِلَ القِبْلَةِ، حتَّى سَقَطَ رِدَاؤُهُ عن مَنْكِبَيْهِ، فأتَاهُ أَبُو بَكْرٍ فأخَذَ رِدَاءَهُ، فألْقَاهُ علَى مَنْكِبَيْهِ، ثُمَّ التَزَمَهُ مِن وَرَائِهِ، وَقالَ: يا نَبِيَّ اللهِ، كَفَاكَ مُنَاشَدَتُكَ رَبَّكَ؛ فإنَّه سَيُنْجِزُ لكَ ما وَعَدَكَ..."',
            source: "صحيح مسلم 1763",
          },
        ],
      },
      {
        id: 3,
        title: "رفع اليدين",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس وعمر بن الخطاب رضي الله عنهما قال: "لَمَّا كانَ يَوْمُ بَدْرٍ نَظَرَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ إلى المُشْرِكِينَ وَهُمْ أَلْفٌ، وَأَصْحَابُهُ ثَلَاثُ مِائَةٍ وَتِسْعَةَ عَشَرَ رَجُلًا، فَاسْتَقْبَلَ نَبِيُّ اللهِ صَلَّى الله عليه وَسَلَّمَ القِبْلَةَ، ثُمَّ مَدَّ يَدَيْهِ، فَجَعَلَ يَهْتِفُ برَبِّهِ: اللَّهُمَّ أَنْجِزْ لي ما وَعَدْتَنِي، اللَّهُمَّ آتِ ما وَعَدْتَنِي، اللَّهُمَّ إنْ تُهْلِكْ هذِه العِصَابَةَ مِن أَهْلِ الإسْلَامِ لا تُعْبَدْ في الأرْضِ، فَما زَالَ يَهْتِفُ برَبِّهِ، مَادًّا يَدَيْهِ مُسْتَقْبِلَ القِبْلَةِ، حتَّى سَقَطَ رِدَاؤُهُ عن مَنْكِبَيْهِ، فأتَاهُ أَبُو بَكْرٍ فأخَذَ رِدَاءَهُ، فألْقَاهُ علَى مَنْكِبَيْهِ، ثُمَّ التَزَمَهُ مِن وَرَائِهِ، وَقالَ: يا نَبِيَّ اللهِ، كَفَاكَ مُنَاشَدَتُكَ رَبَّكَ؛ فإنَّه سَيُنْجِزُ لكَ ما وَعَدَكَ..."',
            source: "صحيح مسلم 1763",
          },
        ],
      },
      {
        id: 4,
        title: "البدء بالثناء على الله عز وجل والصلاة على رسوله ﷺ",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن فضالة بن عبيد رضي الله عنه قال: بينا رسولُ الله صلَّى الله عليْهِ وسلَّمَ قاعدٌ إذ دخلَ رجلٌ فصلَّى فقال: اللَّهمَّ اغفر لي وارحمني، فقالَ رسولُ الله صلَّى الله عليْهِ وسلَّم: "عجِلتَ أيُّها المصلِّي، إذا صلَّيتَ فقعدتَ فاحمَدِ اللَّهَ بما هوَ أَهلُه، وصلِّ عليَّ ثمَّ ادعُه". قال: ثمَّ صلَّى رجلٌ آخرُ بعدَ ذلِكَ فحمدَ اللَّهَ وصلَّى على النَّبيِّ صلَّى الله عليْهِ وسلَّمَ فقالَ لَهُ النَّبيُّ صلَّى الله عليْهِ وسلَّم: "أيُّها المصلِّي ادعُ تُجَب"',
            source: "صحيح الترمذي 3476",
          },
        ],
      },
      {
        id: 5,
        title: "دعاء الله تعالى بأسمائه الحسنى",
        isFavorite: false,
        // ahadith: [
        //   {
        //     id: 1,
        //     title: "",
        //     source: "",
        //   },
        // ],
      },
      {
        id: 6,
        title: "تكرار الدعاء والإلحاح فيه",
        isFavorite: false,
      },
      {
        id: 7,
        title: "إخفاء الدعاء",
        isFavorite: false,
      },
      {
        id: 8,
        title: "ماذا أقول في الدعاء ؟",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن طارق بنُ أَشْيَمَ الأشجعيُّ رضي الله عنه قال: أنَّهُ سَمِعَ النَّبيَّ صَلَّى الله عليه وسلَّمَ وَأَتَاهُ رَجُلٌ، فَقالَ: يا رَسولَ اللهِ، كيفَ أَقُولُ حِينَ أَسْأَلُ رَبِّي؟ قالَ: قُلِ: "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَعَافِنِي، وَارْزُقْنِي. وَيَجْمَعُ أَصَابِعَهُ إلَّا الإبْهَامَ؛ فإنَّ هَؤُلَاءِ تَجْمَعُ لكَ دُنْيَاكَ وَآخِرَتَكَ"',
            source: "صحيح مسلم 2697",
          },
        ],
      },
      {
        id: 9,
        title: "الدعاء للمسلمين بظهر الغيب",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما مِن عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بظَهْرِ الغَيْبِ، إلَّا قالَ المَلَكُ: وَلَكَ بمِثْلٍ"',
            source: "صحيح مسلم 2732",
          },
        ],
      },
      {
        id: 10,
        title: "الدعاء عند سماع صياح الديك والاستعاذة عند سماع صوت الحمار",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِن فَضْلِهِ؛ فإنَّهَا رَأَتْ مَلَكًا، وإذَا سَمِعْتُمْ نَهِيقَ الحِمَارِ فَتَعَوَّذُوا باللَّهِ مِنَ الشَّيْطَانِ؛ فإنَّه رَأَى شيطَانًا"',
            source: "صحيح البخاري 3303",
          },
        ],
      },
      {
        id: 11,
        title: "الدعاء عند نزول المطر",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ كانَ إذَا رَأَى المَطَرَ، قالَ: "اللَّهُمَّ صَيِّبًا نَافِعًا"',
            source: "صحيح البخاري 1032",
          },
        ],
      },
      {
        id: 12,
        title: "الدعاء بعد التشهد الأخير قبل التسليم من الصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: كُنَّا لا نَدْري ما نقولُ في كلِّ ركعتَيْنِ، غيرَ أنْ نُسبِّحَ ونُكبِّرَ ونَحمَدَ ربَّنا، وإنَّ مُحمَّدًا صلَّى اللهُ عليه وسلَّمَ عَلَّمَ فواتِحَ الخيرِ وخواتمَهِ، فقال: "إذا قعَدْتُمْ في كلِّ ركعتَيْنِ، فقولوا: التَّحيَّاتُ للهِ، والصَّلواتُ، والطَّيِّباتُ، السَّلامُ عليكَ أيُّها النبيُّ ورحمةُ اللهِ وبركاتُهُ، السَّلامَ علينا وعلى عبادِ اللهِ الصالحينَ، أشهَدُ أنْ لا إلهَ إلَّا اللهُ، وأشهَدُ أنَّ مُحمَّدًا عبدُهُ ورسولُهُ، وَلْيتخيَّرْ أحدُكم مِنَ الدُّعاءِ أَعْجَبَهَ إليه، فَلْيَدْعُ اللهَ عزَّ وجلَّ"',
            source: "صحيح النسائي 1162",
          },
        ],
      },
      {
        id: 13,
        title: "الدعاء عندما تعصف الريح",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كانَ النَّبيُّ صلَّى الله علَيهِ وسلَّمَ إذا رأَى الرِّيحَ قالَ اللَّهُمَّ إنِّي أسألُكَ مِن خَيرِها وخَيرِ ما فيها وخَيرِ ما أُرْسِلَت بِهِ وأعوذُ بِكَ مِن شرِّها وشرِّ ما فيها وشرِّ ما أُرْسِلَت بِهِ"',
            source: "صحيح الترمذي 3449",
          },
        ],
      },
      {
        id: 14,
        title: "الدعاء عند المصيبة",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما مِن مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ، فيَقولُ ما أمَرَهُ الله: {إِنَّا لله وَإِنَّا إِلَيْهِ رَاجِعُونَ} [البقرة: 156]، اللَّهُمَّ أْجُرْنِي في مُصِيبَتِي، وأَخْلِفْ لي خَيْرًا مِنْها، إلَّا أخْلَفَ الله له خَيْرًا مِنْها"، قالَتْ: فَلَمَّا ماتَ أبو سَلَمَةَ، قُلتُ: أيُّ المُسْلِمِينَ خَيْرٌ مِن أبِي سَلَمَةَ؟ أوَّلُ بَيْتٍ هاجَرَ إلى رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، ثُمَّ إنِّي قُلتُها، فأخْلَفَ الله لي رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ، قالَتْ: أرْسَلَ إلَيَّ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ حاطِبَ بنَ أبِي بَلْتَعَةَ يَخْطُبُنِي له، فَقُلتُ: إنَّ لي بنْتًا، وأنا غَيُورٌ، فقالَ: "أمَّا ابْنَتُها فَنَدْعُو اللَّهَ أنْ يُغْنِيَها عَنْها، وأَدْعُو اللَّهَ أنْ يَذْهَبَ بالغَيْرَةِ"',
            source: "صحيح مسلم 918",
          },
        ],
      },
      {
        id: 15,
        title: "دعاء القنوت",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن الحسنِ بن عليٍّ بن أبي طالب رضيَ الله عنْهما، قال : علَّمني رسولُ الله صلَّى الله عليْهِ وسلَّمَ كلماتٍ أقولُهنَّ في الوترِ، - قالَ ابنُ جوَّاسٍ: في قنوتِ الوترِ "اللَّهمَّ اهدِني فيمن هديت، وعافِني فيمن عافيتَ، وتولَّني فيمن تولَّيتَ، وبارِك لي فيما أعطيتَ، وقني شرَّ ما قضيتَ، إنَّكَ تقضي ولا يقضى عليْكَ، وإنَّهُ لا يذلُّ من واليتَ، ولا يعزُّ من عاديتَ، تبارَكتَ ربَّنا وتعاليتَ"',
            source: "صحيح أبي داود 1425",
          },
        ],
      },
      {
        id: 16,
        title: "دعاء قبل الجماع",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله غليه وسلم: " أَمَا لو أنَّ أحَدَهُمْ يَقولُ حِينَ يَأْتي أهْلَهُ: باسْمِ الله، اللَّهُمَّ جَنِّبْنِي الشَّيْطانَ، وجَنِّبِ الشَّيْطانَ ما رَزَقْتَنا، ثُمَّ قُدِّرَ بيْنَهُما في ذلكَ، أوْ قُضِيَ ولَدٌ؛ لَمْ يَضُرَّهُ شَيطانٌ أبَدًا."',
            source: "صحيح البخاري 5165",
          },
        ],
      },
      {
        id: 17,
        title: "الدعاء عند رؤية مبتلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من رأى مبتلًى فقال : "الحمدُ للهِ الذي عافاني مما ابتلاكَ به ، و فضَّلني على كثيرٍ ممن خلق تفضيلًا" ، لم يُصِبْهُ ذلك البلاءُ',
            source: "السلسلة الصحيحة 2737",
          },
        ],
      },
      {
        id: 18,
        title: "العزم في الدعاء",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا دَعا أحَدُكُمْ فَلْيَعْزِمِ المَسْأَلَةَ، ولا يَقُولَنَّ: اللَّهُمَّ إنْ شِئْتَ فأعْطِنِي؛ فإنَّه لا مُسْتَكْرِهَ له."',
            source: "صحيح البخاري 6338",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا دَعَوْتُمُ اللَّهَ فاعْزِمُوا في الدُّعاءِ، ولا يَقُولَنَّ أحَدُكُمْ إنْ شِئْتَ فأعْطِنِي، فإنَّ اللَّهَ لا مُسْتَكْرِهَ له"',
            source: "صحيح البخاري 7464",
          }
        ],
      },
    ],
  },
  //done sourced
  {
    id: 18,
    title: "سنن المريض",
    sunan: [
      {
        id: 1,
        title: "عيادة المريض",
        ahadith: [
          {
            id: 1,
            title: 'عن ثوبان مولى رسول الله صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم: "مَن عادَ مَرِيضًا لَمْ يَزَلْ في خُرْفَةِ الجَنَّةِ"، قيلَ يا رَسولَ اللهِ، وما خُرْفَةُ الجَنَّةِ؟ قالَ: "جَناها"',
            source: "صحيح مسلم 2568",
          },
          {
            id: 2,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
        ],
      },
      {
        id: 2,
        title: "وضع اليد على موضع الألم والدعاء",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن أبي العاص الثقفي رضي الله عنه ، أنَّهُ شَكَا إلى رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ وَجَعًا يَجِدُهُ في جَسَدِهِ مُنْذُ أَسْلَمَ، فَقالَ له رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: "ضَعْ يَدَكَ علَى الَّذي تَأَلَّمَ مِن جَسَدِكَ، وَقُلْ: باسْمِ اللهِ، ثَلَاثًا، وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِن شَرِّ ما أَجِدُ وَأُحَاذِرُ"',
            source: "صحيح مسلم 2202",
          },
        ],
      },
      {
        id: 3,
        title: "التداوي بالعسل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: أنَّ رَجُلًا أتَى النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ فقالَ: أخِي يَشْتَكِي بَطْنَهُ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتَى الثَّانِيَةَ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتاهُ الثَّالِثَةَ، فقالَ: "اسْقِهِ عَسَلًا"، ثُمَّ أتاهُ فقالَ: قدْ فَعَلْتُ؟ فقالَ: "صَدَقَ اللَّهُ، وكَذَبَ بَطْنُ أخِيكَ، اسْقِهِ عَسَلًا"، فَسَقاهُ فَبَرَأَ.',
            source: "صحيح البخاري 5684",
          },
          {
            id: 2,
            title: 'جَاءَ رَجُلٌ إلى النبيِّ صَلَّى الله عليه وسلَّمَ فَقالَ: إنَّ أَخِي اسْتَطْلَقَ بَطْنُهُ فَقالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ "اسْقِهِ عَسَلًا فَسَقَاهُ"، ثُمَّ جَاءَهُ فَقالَ: إنِّي سَقَيْتُهُ عَسَلًا فَلَمْ يَزِدْهُ إلَّا اسْتِطْلَاقًا، فَقالَ له "ثَلَاثَ مَرَّاتٍ"، ثُمَّ جَاءَ الرَّابِعَةَ فَقالَ: "اسْقِهِ عَسَلًا" فَقالَ: لقَدْ سَقَيْتُهُ فَلَمْ يَزِدْهُ إلَّا اسْتِطْلَاقًا، فَقالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "صَدَقَ الله، وَكَذَبَ بَطْنُ أَخِيكَ" فَسَقَاهُ فَبَرَأَ',
            source: "صحيح مسلم 2217"
          }
        ],
      },
      {
        id: 4,
        title: "الدعاء للمريض",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إذا حَضَرْتُمُ المَرِيضَ، أوِ المَيِّتَ، فَقُولوا خَيْرًا؛ فإنَّ المَلائِكَةَ يُؤَمِّنُونَ علَى ما تَقُولونَ"، قالَتْ: فَلَمَّا ماتَ أبو سَلَمَةَ أتَيْتُ النَّبيَّ صَلَّى الله عليه وسلَّمَ، فَقُلتُ: يا رَسولَ اللهِ، إنَّ أبا سَلَمَةَ قدْ ماتَ، قالَ: قُولِي: "اللَّهُمَّ اغْفِرْ لي ولَهُ، وأَعْقِبْنِي منه عُقْبَى حَسَنَةً"، قالَتْ: فَقُلتُ، فأعْقَبَنِي الله مَن هو خَيْرٌ لي منه؛ مُحَمَّدًا صَلَّى الله عليه وسلَّمَ.',
            source: "صحيح مسلم 919",
          },
        ],
      },
      
    ],
  },
  //done sourced
  {
    id: 19,
    title: "سنن التوبة",
    sunan: [
      {
        id: 1,
        title: "صلاة ركعتين عند التوبة من الذنب",
        ahadith: [
          {
            id: 1,
            title: 'عن أسماءَ بنِ الحَكَمِ الفزازي رضي الله عنه قالَ: سَمِعْتُ عليًّا رضيَ الله عنهُ يقولُ: كنتُ رجلًا إذا سَمِعْتُ من رسولِ الله صلَّى الله علَيهِ وسلَّمَ حديثًا نفعَني الله منهُ بما شاءَ أن ينفعَني، وإذا حدَّثَني أحدٌ من أصحابِهِ استَحلفتُهُ، فإذا حلَفَ لي صدَّقتُهُ، قالَ: وحدَّثَني أبو بَكْرٍ وصدقَ أبو بَكْرٍ رضيَ الله عنهُ، أنَّهُ قالَ: سَمِعْتُ رسولَ الله صلَّى الله علَيهِ وسلَّمَ يقولُ: "ما مِن عبدٍ يذنبُ ذنبًا، فيُحسنُ الطُّهورَ، ثمَّ يقومُ فيُصلِّي رَكْعتينِ، ثمَّ يستغفِرُ اللَّهَ، إلَّا غفرَ الله لَهُ"، ثمَّ قرأَ هذِهِ الآيةَ: "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ" إلى آخرِ الآيةِ',
            source: "صحيح أبي داود 1521",
          },
        ],
      },
      {
        id: 3,
        title: "التوبة الدائمة إلى الله",
        ahadith: [
          {
            id: 1,
            title: 'عن الأغر المزني أبي مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يَا أَيُّهَا النَّاسُ تُوبُوا إلى اللهِ، فإنِّي أَتُوبُ في اليَومِ إلَيْهِ مِئَةَ مَرَّةٍ"',
            source: "صحيح مسلم 2702",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِن مَغْرِبِهَا، تَابَ الله عليه"',
            source: "صحيح مسلم 2703",
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "...فإنَّ العَبْدَ إذَا اعْتَرَفَ بذَنْبِهِ ثُمَّ تَابَ، تَابَ الله عليه..."',
            source: "صحيح البخاري 2661",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 20,
    title: "سنن الأعمال الصالحة",
    sunan: [
      {
        id: 1,
        title: "إزالة الأذى عن الطريق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "بيْنَما رَجُلٌ يَمْشِي بطَرِيقٍ وجَدَ غُصْنَ شَوْكٍ علَى الطَّرِيقِ فأخَّرَهُ، فَشَكَرَ الله له فَغَفَرَ له. ثُمَّ قَالَ: الشُّهَدَاءُ خَمْسَةٌ: المَطْعُونُ، والمَبْطُونُ، والغَرِيقُ، وصَاحِبُ الهَدْمِ، والشَّهِيدُ في سَبيلِ اللَّهِ، وقَالَ: لو يَعْلَمُ النَّاسُ ما في النِّدَاءِ والصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إلَّا أنْ يَسْتَهِمُوا لَاسْتَهَمُوا عليه. ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إلَيْهِ ولو يَعْلَمُونَ ما في العَتَمَةِ والصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
            source: "صحيح البخاري 652",
          },
          {
            id: 2,
            title: 'عن أبي برزة الأسلمي نضلة بن عبيد رضي الله عنه قال: يا رسولَ الله ، دُلَّني على عملٍ أنتفعُ بِهِ ، قالَ : "اعزلِ الأذى عن طريقِ المسلِمينَ"',
            source: "صحيح ابن ماجه 2983",
          },
        ],
      },
      {
        id: 2,
        title: "المداومة على العمل الصالح وإن قل",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: سئل رسول الله صلى الله عليه وسلم: أي الأعمال أحب إلى الله ؟ قال: "أَحَبُّ الأعمالِ إلى اللهِ أدْومُها و إن قَلَّ"',
            source: "صحيح الجامع 163",
          },
        ],
      },
      {
        id: 3,
        title: "معاونة الأهل في أعمال البيت",
        ahadith: [
          {
            id: 1,
            title: 'عن الأسود رضي الله عنه قال: سَأَلْتُ عَائِشَةَ ما كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ يَصْنَعُ في بَيْتِهِ؟ قالَتْ: "كانَ يَكونُ في مِهْنَةِ أهْلِهِ - تَعْنِي خِدْمَةَ أهْلِهِ - فَإِذَا حَضَرَتِ الصَّلَاةُ خَرَجَ إلى الصَّلَاةِ"',
            source: "صحيح البخاري 676",
          },
        ],
      },
      {
        id: 4,
        title: "إحتساب النفقة على الأهل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مسعود البدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ المُسْلِمَ إذا أنْفَقَ علَى أهْلِهِ نَفَقَةً، وهو يَحْتَسِبُها، كانَتْ له صَدَقَةً"',
            source: "صحيح مسلم 1002",
          },
        ],
      },
      {
        id: 5,
        title: "إعلام الرجل أخيه أنه يحبه",
        ahadith: [
          {
            id: 1,
            title: 'عن المقدام بن معدي كرب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أحبَّ أحدُكم أخاه فليُعْلمَه إيَّاه"',
            source: "صحيح الترمذي 2391",
          },
        ],
      },
      {
        id: 6,
        title: "كفالة اليتيم",
        ahadith: [
          {
            id: 1,
            title: 'عن سهل بن سعد الساعدي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا وَكافلُ اليتيمِ في الجنَّةِ كَهاتين ، وأشارَ بأصبُعَيْهِ يعني: السَّبَّابةَ والوسطى"',
            source: "صحيح الترمذي 1918",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كافِلُ اليَتِيمِ له، أوْ لِغَيْرِهِ أنا وهو كَهاتَيْنِ في الجَنَّةِ وأَشارَ مالِكٌ بالسَّبَّابَةِ والْوُسْطَى"',
            source: "صحيح مسلم 2983",
          },
        ],
      },
      {
        id: 7,
        title: "الصدقة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن تَصَدَّقَ بعَدْلِ تَمْرَةٍ مِن كَسْبٍ طَيِّبٍ، ولَا يَقْبَلُ اللَّهُ إلَّا الطَّيِّبَ، وإنَّ اللَّهَ يَتَقَبَّلُهَا بيَمِينِهِ، ثُمَّ يُرَبِّيهَا لِصَاحِبِهِ، كما يُرَبِّي أَحَدُكُمْ فَلُوَّهُ، حتَّى تَكُونَ مِثْلَ الجَبَلِ"',
            source: "صحيح البخاري 1410",
          },
        ],
      },
      {
        id: 8,
        title: "الإكثار من قراءة القرآن",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أمامة الباهلي رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "اقْرَؤُوا القُرْآنَ فإنَّه يَأْتي يَومَ القِيامَةِ شَفِيعًا لأَصْحابِهِ، اقْرَؤُوا الزَّهْراوَيْنِ البَقَرَةَ، وسُورَةَ آلِ عِمْرانَ، فإنَّهُما تَأْتِيانِ يَومَ القِيامَةِ كَأنَّهُما غَمامَتانِ، أوْ كَأنَّهُما غَيايَتانِ، أوْ كَأنَّهُما فِرْقانِ مِن طَيْرٍ صَوافَّ، تُحاجَّانِ عن أصْحابِهِما، اقْرَؤُوا سُورَةَ البَقَرَةِ، فإنَّ أخْذَها بَرَكَةٌ، وتَرْكَها حَسْرَةٌ، ولا تَسْتَطِيعُها البَطَلَةُ. قالَ مُعاوِيَةُ: بَلَغَنِي أنَّ البَطَلَةَ: السَّحَرَةُ. [وفي رواية]: غيرَ أنَّه قالَ: وكَأنَّهُما في كِلَيْهِما، ولَمْ يَذْكُرْ قَوْلَ مُعاوِيَةَ بَلَغَنِي"',
            source: "صحيح مسلم 804",
          },
        ],
      },
      {
        id: 9,
        title: "ذكر الله على كل حال",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "كانَ النبيُّ صَلَّى الله عليه وسلَّمَ يَذْكُرُ اللَّهَ علَى كُلِّ أحْيَانِهِ"',
            source: "صحيح مسلم 373",
          },
        ],
      },
      {
        id: 10,
        title: "زراعة الأشجار",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنْ قامَتِ السَّاعةُ وفي يدِ أحدِكُم فَسيلةٌ فإنِ استَطاعَ أن لا تَقومَ حتَّى يغرِسَها فلْيغرِسْها"',
            source: "السلسلة الصحيحة 9",
          },
        ],
      },
      {
        id: 11,
        title: "أعمال تنفع المسلم في قبره",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ مما يلحَقُ المؤمنَ مِنْ عملِهِ وحسناتِهِ ، بعدَ موتِهِ ، علمًا نشرَهُ ، وولدًا صالحًا تركَهَ ، ومصحفًا ورَّثَهُ ، أوْ مسجِدًا بناهُ ، أوْ بيتًا لابْنِ السبيلِ بناهُ ، أوْ نهرًا أجراهُ ، أوْ صدَقَةً أخرجَها مِنْ مالِهِ في صحَّتِهِ وحياتِهِ ، تلحقُهُ مِنْ بعدِ موتِهِ"',
            source: "صحيح ابن ماجه 200"
          },
        ],
      },
      {
        id: 12,
        title: "الأعمال الصالحة في العشر الأوائل من ذي الحجة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما العَمَلُ في أيَّامٍ أفْضَلَ منها في هذه، قالوا: ولا الجِهادُ؟ قالَ: ولا الجِهادُ، إلَّا رَجُلٌ خَرَجَ يُخاطِرُ بنَفْسِه ومالِه، فلَمْ يَرْجِعْ بشَيءٍ"',
            source: "صحيح البخاري 969",
          },
        ],
      },
      {
        id: 13,
        title: "إحصاء أسماء الله الحسنى",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "إنَّ لله تِسْعَةً وتِسْعِينَ اسْمًا مِئَةً إلَّا واحِدًا، مَن أحْصَاهَا دَخَلَ الجَنَّةَ"',
            source: "صحيح البخاري 2736",
          },
        ],
      },
      {
        id: 14,
        title: "تعلم القرآن وتعليمه",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خَيْرُكُمْ مَن تَعَلَّمَ القُرْآنَ وعَلَّمَهُ". قالَ: وأَقْرَأَ أبو عبدِ الرَّحْمَنِ في إمْرَةِ عُثْمانَ، حتَّى كانَ الحَجَّاجُ قالَ: وذاكَ الذي أقْعَدَنِي مَقْعَدِي هذا',
            source: "صحيح البخاري 5027",
          },
        ],
      },
      {
        id: 15,
        title: "الإحسان إلى النساء",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي االه عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فلا يُؤْذِي جارَهُ، واسْتَوْصُوا بالنِّساءِ خَيْرًا؛ فإنَّهُنَّ خُلِقْنَ مِن ضِلَعٍ، وإنَّ أعْوَجَ شَيءٍ في الضِّلَعِ أعْلاهُ، فإنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وإنْ تَرَكْتَهُ لَمْ يَزَلْ أعْوَجَ، فاسْتَوْصُوا بالنِّساءِ خَيْرًا"',
            source: "صحيح البخاري 5185",
          },
        ],
      },
      {
        id: 16,
        title: "سقي العائلة الماء",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا سقَى الرجلُ امرأتَه الماءَ أُجِرَ"',
            source: "صحيح الجامع 602",
          },
        ],
      },
      {
        id: 17,
        title: "بناء المساجد",
        ahadith: [
          {
            id: 1,
            title: 'عن عُبَيد الله الخَوْلانيُّ رضي الله عنه قال: أنَّهُ سَمِعَ عُثْمَانَ بنَ عَفَّانَ يقولُ عِنْدَ قَوْلِ النَّاسِ فيه حِينَ بَنَى مَسْجِدَ الرَّسُولِ صَلَّى اللهُ عليه وسلَّمَ: إنَّكُمْ أكْثَرْتُمْ، وإنِّي سَمِعْتُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ يقولُ: "مَن بَنَى مَسْجِدًا - قالَ بُكَيْرٌ: حَسِبْتُ أنَّه قالَ: يَبْتَغِي به وجْهَ الله - بَنَى اللَّهُ له مِثْلَهُ في الجَنَّةِ"',
            source: "صحيح البخاري 450",
          },
        ],
      },
      {
        id: 18,
        title: "غض البصر",
        ahadith: [
          {
            id: 1,
            title: 'عن جرير بن عبد الله رضي الله عنه قال: "سَأَلْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ عن نَظَرِ الفُجَاءَةِ فأمَرَنِي أَنْ أَصْرِفَ بَصَرِي."',
            source: "صحيح مسلم 2159",
          },
        ],
      },
      {
        id: 19,
        title: "الإستغفار للوالدين",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللهَ ليرفعُ الدرجةَ للعبدِ الصالحِ في الجنةِ فيقولُ يا ربِّ من أينَ لي هذا فيقولُ باستغفارِ ولدِكَ لكَ"',
            source: "الإستغفار للوالدين",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 21,
    title: "سنن المولود والأولاد",
    sunan: [
      {
        id: 1,
        title: "تحنيك المولود",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: "وُلِدَ لي غُلَامٌ، فأتَيْتُ به النَّبيَّ صَلَّى اللهُ عليه وسلَّمَ فَسَمَّاهُ إبْرَاهِيمَ، فَحَنَّكَهُ بتَمْرَةٍ، ودَعَا له بالبَرَكَةِ، ودَفَعَهُ إلَيَّ". وكانَ أكْبَرَ ولَدِ أبِي مُوسَى',
            source: "صحيح البخاري 5467",
          },
        ]
      },
      {
        id: 2,
        title: "كف الصبيان أول المغرب",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا كانَ جُنْحُ اللَّيْلِ -أوْ أمْسَيْتُمْ- فَكُفُّوا صِبْيانَكُمْ؛ فإنَّ الشَّياطِينَ تَنْتَشِرُ حِينَئِذٍ، فإذا ذَهَبَ ساعَةٌ مِنَ اللَّيْلِ فَخلُّوهُمْ، فأغْلِقُوا الأبْوابَ، واذْكُرُوا اسْمَ الله؛ فإنَّ الشَّيْطانَ لا يَفْتَحُ بابًا مُغْلَقًا، وأَوْكُوا قِرَبَكُمْ واذْكُرُوا اسْمَ اللَّهِ، وخَمِّرُوا آنِيَتَكُمْ واذْكُرُوا اسْمَ الله، ولو أنْ تَعْرُضُوا عليها شَيئًا، وأَطْفِئُوا مَصابِيحَكُمْ."',
            source: "صحيح البخاري 5623",
          },
        ],
      },
      {
        id: 3,
        title: "الإحسان إلى الأولاد",
        ahadith: [
          {
            id: 1,
            title: 'عن عقبة بن عامر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن كانَ لَهُ ثلاثُ بَناتٍ فصبرَ عليهنَّ، وأطعمَهُنَّ، وسقاهنَّ، وَكَساهنَّ مِن جِدَتِهِ كنَّ لَهُ حجابًا منَ النَّارِ يومَ القيامَةِ"',
            source: "صحيح ابن ماجه 2974",
          },
        ],
      },
      {
        id: 4,
        title: "العدل بين الأولاد",
        ahadith: [
          {
            id: 1,
            title: 'عن النعمان بن بشير رضي الله عنه قال: أَعْطَانِي أبِي عَطِيَّةً، فَقالَتْ عَمْرَةُ بنْتُ رَوَاحَةَ: لا أرْضَى حتَّى تُشْهِدَ رَسولَ الله صلَّى اللهُ عليه وسلَّمَ، فأتَى رَسولَ الله صلَّى اللهُ عليه وسلَّمَ، فَقالَ: إنِّي أعْطَيْتُ ابْنِي مِن عَمْرَةَ بنْتِ رَوَاحَةَ عَطِيَّةً، فأمَرَتْنِي أنْ أُشْهِدَكَ يا رَسولَ الله، قالَ: "أعْطَيْتَ سَائِرَ ولَدِكَ مِثْلَ هذا؟" قالَ: لَا، قالَ: "فَاتَّقُوا اللَّهَ واعْدِلُوا بيْنَ أوْلَادِكُمْ"، قالَ: فَرَجَعَ فَرَدَّ عَطِيَّتَهُ.',
            source: "صحيح البخاري 2587",
          },
        ],
      },
      {
        id: 5,
        title: "التفريق بين الأولاد في أماكن النوم في سن العاشرة",
        ahadith: [
          {
            id: 1,
            title: 'عن جد عمرو بن شعيب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مُروا أولادَكم بالصلاةِ وهم أبناءُ سبعِ سنينَ واضربوهُم عليها وهمْ أبناءُ عشرٍ وفرِّقوا بينهُم في المضاجعِ"',
            source: "صحيح أبي داود 495",
          },
        ],
      },
      {
        id: 6,
        title: "أمر الأولاد بالصلاة في سن السابعة",
        ahadith: [
          {
            id: 1,
            title: 'عن جد عمرو بن شعيب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مُروا أولادَكم بالصلاةِ وهم أبناءُ سبعِ سنينَ واضربوهُم عليها وهمْ أبناءُ عشرٍ وفرِّقوا بينهُم في المضاجعِ"',
            source: "صحيح أبي داود 495",
          },
        ],
      },
      {
        id: 7,
        title: "معاقبة الأولاد على الصلاة في سن العاشرة",
        ahadith: [
          {
            id: 1,
            title: 'عن جد عمرو بن شعيب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مُروا أولادَكم بالصلاةِ وهم أبناءُ سبعِ سنينَ واضربوهُم عليها وهمْ أبناءُ عشرٍ وفرِّقوا بينهُم في المضاجعِ"',
            source: "صحيح أبي داود 495",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 22,
    title: "سنن البيع والشراء",
    sunan: [
      {
        id: 1,
        title: "السماحة في البيع والشراء",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله، رضي الله عنهما أنَّ رسول الله صلى الله عليه وسلم قال: "رحم الله رجلًا سمحًا إذا باع، وإذا اشترى، وإذا اقتضى"',
            source: "صحيح البخاري 2076",
          },
        ]
      },
      {
        id: 2,
        title: "عدم بيع الأشياء المحرمة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه أنه سَمِعَ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ يقولُ عَامَ الفَتْحِ وهو بمَكَّةَ: "إنَّ اللَّهَ ورَسولَه حَرَّمَ بَيْعَ الخَمْرِ والمَيْتَةِ، والخِنْزِيرِ والأصْنَامِ"، فقِيلَ: يا رَسولَ الله، أرَأَيْتَ شُحُومَ المَيْتَةِ؛ فإنَّهَا يُطْلَى بهَا السُّفُنُ، ويُدْهَنُ بهَا الجُلُودُ، ويَسْتَصْبِحُ بهَا النَّاسُ؟ فَقالَ: "لَا، هو حَرَامٌ"، ثُمَّ قالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ عِنْدَ ذلكَ: "قَاتَلَ الله اليَهُودَ؛ إنَّ اللَّهَ لَمَّا حَرَّمَ شُحُومَهَا جَمَلُوهُ، ثُمَّ بَاعُوهُ، فأكَلُوا ثَمَنَهُ"',
            source: "صحيح البخاري 2236"
          },
        ]
      },
    ],
  },
  {
    id: 23,
    title: "سنن الأخلاق الحسنة",
    // sunan: [
    //   {
    //     id: 2,
    //     title: "الحياء",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الإِيمانُ بضْعٌ وسَبْعُونَ، أوْ بضْعٌ وسِتُّونَ، شُعْبَةً، فأفْضَلُها قَوْلُ لا إلَهَ إلَّا اللَّهُ، وأَدْناها إماطَةُ الأذَى عَنِ الطَّرِيقِ، والْحَياءُ شُعْبَةٌ مِنَ الإيمانِ"',
    //         source: "صحيح مسلم 35",
    //       },
    //       {
    //         id: 2,
    //         title: 'عن عبد الله بن عمر رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ مَرَّ علَى رَجُلٍ مِنَ الأنْصَارِ، وهو يَعِظُ أخَاهُ في الحَيَاءِ، فَقالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: دَعْهُ فإنَّ الحَيَاءَ مِنَ الإيمَانِ."',
    //         source: "صحيح البخاري 24",
    //       },
    //     ],
    //   },
    //   {
    //     id: 3,
    //     title: "إحسان الظن بالناس",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ، فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَحَسَّسُوا، ولا تَجَسَّسُوا، ولا تَنافَسُوا، ولا تَحاسَدُوا، ولا تَباغَضُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ اللهِ إخْوانًا"',
    //         source: "صحيح مسلم 2563",
    //       },
    //     ],
    //   },
    //   {
    //     id: 4,
    //     title: "التبسم",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال لي النبي صلى الله عليه وسلم : "لا تَحْقِرَنَّ مِنَ المَعروفِ شيئًا، ولو أنْ تَلْقَى أخاكَ بوَجْهٍ طَلْقٍ"',
    //         source: "صحيح مسلم 2626",
    //       },
    //     ],
    //   },
    //   {
    //     id: 5,
    //     title: "الإكثار من الأخلاق الحسنة",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن أبي أمامة الباهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا زعيمٌ ببيتِ في رَبَضِ الجنةِ لمَن تَرَكَ المِراءَ وإن كان مُحِقًّا ، وببيتِ في وسطِ الجنةِ لمَن تركَ الكذبَ وإن كان مازحًا ، وببيتٍ في أعلى الجنةِ لمَن حَسُنَ خُلُقُه"',
    //         source: "صحيح أبي داود 4800",          
    //       },
    //       {
    //         id: 2,
    //         title: 'عن أبي هريرة رضي الله عنه قال:  "سُئِلَ رسولُ الله صلَّى الله علَيهِ وسلَّمَ عن أَكْثرِ ما يُدخلُ النَّاسَ الجنَّةَ ؟ فقالَ: تَقوى الله وحُسنُ الخلُقِ ، وسُئِلَ عن أَكْثرِ ما يُدخِلُ النَّاسَ النَّارَ ، قالَ: الفَمُ والفَرجُ"',
    //         source: "صحيح الترمذي 2004",
    //       },
    //       {
    //         id: 3,
    //         title: 'عن أسامة بن شريك رضي الله عنه قال: "كنا جلوسًا عند النَّبيِّ صلَّى اللهُ عليه وسلَّمَ كأنما على رؤوسنا الطيرُ ما يتكلم منا مُتكلِّمٌ إذ جاءه أناسٌ فقالوا من أَحَبُّ عبادِ اللهِ إلى اللهِ تعالى قال أَحسنُهم خُلُقًا"',
    //         source: "صحيح الترغيب 2652",
    //       },
    //       {
    //         id: 4,
    //         title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا ، وإنَّ مِن أبغضِكُم إليَّ وأبعدِكُم منِّي يومَ القيامةِ الثَّرثارونَ والمتشدِّقونَ والمتفَيهِقونَ، قالوا: يا رسولَ اللَّهِ، قد علِمنا الثَّرثارينَ والمتشدِّقينَ فما المتفَيهقونَ ؟ قالَ: المتَكَبِّرونَ"',
    //         source: "صحيح الترمذي 2018",
    //       },
    //       {
    //         id: 5,
    //         title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما مِن شيءٍ أثقلٌ في الميزانِ مِن حُسْنِ الخُلُقِ"',
    //         source: "صحيح أبي داود 4799",
    //       },
    //       {
    //         id: 6,
    //         title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إن المؤمنَ لَيُدْرِكُ بحُسْنِ خُلُقِه درجةَ الصائمِ القائمِ"',
    //         source: "صحيح أبي داود 4798",
    //       },
    //       {
    //         id: 7,
    //         title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ المسلِمَ المسَدَّدَ لَيُدْرِكُ درجَةَ الصوَّامِ القَوَّامِ بآياتِ اللهِ ، بِحُسْنِ خُلُقِهِ وكَرَمِ ضَرِيبَتِهِ"',
    //         source: "صحيح الجامع 1949",
    //       },
    //       {
    //         id: 8,
    //         title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما مِن شيءٍ يوضَعُ في الميزانِ أثقلُ من حُسنِ الخلقِ ، وإنَّ صاحبَ حُسنِ الخلقِ ليبلُغُ بِهِ درجةَ صاحبِ الصَّومِ والصَّلاةِ"',
    //         source: "صحيح الترمذي 2003",
    //       },
    //       {
    //         id: 9,
    //         title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إنَّهُ مَن أُعْطيَ حظَّهُ مِنَ الرِّفقِ، فقَدْ أُعْطيَ حظَّهُ من خيرِ الدُّنيا والآخِرةِ، وصلةُ الرَّحمِ، وحُسنُ الخُلُقِ وحُسنُ الجِوارِ، يُعمِّرانِ الدِّيارَ، ويَزيدانِ في الأعمارِ"',
    //         source: "السلسلة الصحيحة 519",
    //       },
    //       {
    //         id: 10,
    //         title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أكْملُ المؤمنينَ إيمانًا أحسنُهُم خلقًا. وخيارُكُم خيارُكُم لنسائِهِم"',
    //         source: "صحيح الترمذي  1162",
    //       },
    //     ],
    //   },
    //   {
    //     id: 6,
    //     title: "صلة الرحم",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إنَّهُ مَن أُعْطيَ حظَّهُ مِنَ الرِّفقِ، فقَدْ أُعْطيَ حظَّهُ من خيرِ الدُّنيا والآخِرةِ، وصلةُ الرَّحمِ، وحُسنُ الخُلُقِ وحُسنُ الجِوارِ، يُعمِّرانِ الدِّيارَ، ويَزيدانِ في الأعمارِ"',
    //         source: "السلسلة الصحيحة 519",
    //       },
    //       {
    //         id: 2,
    //         title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن سَرَّهُ أنْ يُبْسَطَ له في رِزْقِهِ، أوْ يُنْسَأَ له في أثَرِهِ، فَلْيَصِلْ رَحِمَهُ"',
    //         source: "صحيح البخاري 2067",
    //       },
    //       {
    //         id: 3,
    //         title: 'عن النعمان بن بشير رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "تَرَى المُؤْمِنِينَ في تَراحُمِهِمْ وتَوادِّهِمْ وتَعاطُفِهِمْ، كَمَثَلِ الجَسَدِ، إذا اشْتَكَى عُضْوًا تَداعَى له سائِرُ جَسَدِهِ بالسَّهَرِ والحُمَّى"',
    //         source: "صحيح البخاري 6011",
    //       },
    //       {
    //         id: 4,
    //         title: 'عن جبير بن مطعم رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَدْخُلُ الجَنَّةَ قاطِعٌ"',
    //         source: "صحيح البخاري 5984",
    //       },
    //     ],
    //   },
    //   {
    //     id: 7,
    //     title: "حسن الجوار",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إنَّهُ مَن أُعْطيَ حظَّهُ مِنَ الرِّفقِ، فقَدْ أُعْطيَ حظَّهُ من خيرِ الدُّنيا والآخِرةِ، وصلةُ الرَّحمِ، وحُسنُ الخُلُقِ وحُسنُ الجِوارِ، يُعمِّرانِ الدِّيارَ، ويَزيدانِ في الأعمارِ"',
    //         source: "السلسلة الصحيحة 519",
    //       },
    //       {
    //         id: 2,
    //         title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَدْخُلُ الجَنَّةَ مَن لا يَأْمَنُ جارُهُ بَوائِقَهُ"',
    //         source: "صحيح مسلم 46",
    //       },
    //       {
    //         id: 3,
    //         title: 'عن عائشة ام المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما زالَ يُوصِينِي جِبْرِيلُ بالجارِ، حتَّى ظَنَنْتُ أنَّه سَيُوَرِّثُهُ"',
    //         source: "صحيح البخاري 6014",
    //       },
    //     ],
    //   },
    //   {
    //     id: 8,
    //     title: "الرفق",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إنَّهُ مَن أُعْطيَ حظَّهُ مِنَ الرِّفقِ، فقَدْ أُعْطيَ حظَّهُ من خيرِ الدُّنيا والآخِرةِ، وصلةُ الرَّحمِ، وحُسنُ الخُلُقِ وحُسنُ الجِوارِ، يُعمِّرانِ الدِّيارَ، ويَزيدانِ في الأعمارِ"',
    //         source: "السلسلة الصحيحة 519",
    //       },
    //     ],
    //   },
    //   {
    //     id: 9,
    //     title: "إماطة الأذى عن الطريق",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الإِيمانُ بضْعٌ وسَبْعُونَ، أوْ بضْعٌ وسِتُّونَ، شُعْبَةً، فأفْضَلُها قَوْلُ لا إلَهَ إلَّا اللَّهُ، وأَدْناها إماطَةُ الأذَى عَنِ الطَّرِيقِ، والْحَياءُ شُعْبَةٌ مِنَ الإيمانِ"',
    //         source: "صحيح مسلم 35",
    //       },
    //     ],
    //   },
    //   {
    //     id: 10,
    //     title: "مساعدة المسلمين",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ"',
    //         source: "صحيح البخاري 2442",
    //       },
    //     ],
    //   },
    //   {
    //     id: 11,
    //     title: "تفريج كربات المسلمين",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ"',
    //         source: "صحيح البخاري 2442",
    //       },
    //     ],
    //   },
    //   {
    //     id: 12,
    //     title: "ستر المسلمين",
    //     ahadith: [
    //       {
    //         id: 1,
    //         title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ"',
    //         source: "صحيح البخاري 2442",
    //       },
    //     ],
    //   },
    // ],
    sunan: [
      {
        id: 1,
        title: "الإحسان",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: ثِنْتَانِ حَفِظْتُهُما عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، قالَ: "إنَّ الله كَتَبَ الإحْسَانَ علَى كُلِّ شيءٍ، فَإِذَا قَتَلْتُمْ فأحْسِنُوا القِتْلَةَ، وإذَا ذَبَحْتُمْ فأحْسِنُوا الذَّبْحَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، فَلْيُرِحْ ذَبِيحَتَهُ."',
            source: "صحيح مسلم 1955",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قالَ رَجُلٌ: يا رَسولَ الله، أنُؤاخَذُ بما عَمِلْنا في الجاهِلِيَّةِ؟ قالَ: "مَن أحْسَنَ في الإسْلامِ لَمْ يُؤاخَذْ بما عَمِلَ في الجاهِلِيَّةِ، ومَن أساءَ في الإسْلامِ أُخِذَ بالأوَّلِ والآخِرِ."',
            source: "صحيح البخاري 6921",
          },
          {
            id: 3,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: أَقْبَلَ رَجُلٌ إلى نَبِيِّ اللهِ صَلَّى الله عليه وَسَلَّمَ فَقالَ: أُبَايِعُكَ علَى الهِجْرَةِ وَالْجِهَادِ، أَبْتَغِي الأجْرَ مِنَ اللهِ، قالَ: "فَهلْ مِن وَالِدَيْكَ أَحَدٌ حَيٌّ؟" قالَ: نَعَمْ، بَلْ كِلَاهُمَا، قالَ: "فَتَبْتَغِي الأجْرَ مِنَ اللهِ؟" قالَ: نَعَمْ، قالَ: "فَارْجِعْ إلى وَالِدَيْكَ فأحْسِنْ صُحْبَتَهُمَا."',
            source: "صحيح مسلم 2549",
          },
        ],
      },
      {
        id: 2,
        title: "الألفة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 3,
        title: "الأمانة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سفيان بن حرب رضي الله عنه قال: أنَّ هِرَقْلَ قَالَ له: سَأَلْتُكَ مَاذَا يَأْمُرُكُمْ؟ فَزَعَمْتَ: "أنَّه أمَرَكُمْ بالصَّلَاةِ، والصِّدْقِ، والعَفَافِ، والوَفَاءِ بالعَهْدِ، وأَدَاءِ الأمَانَةِ، قَالَ: وهذِه صِفَةُ نَبِيٍّ."',
            source: "صحيح البخاري 2681",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: بيْنَما النبيُّ صَلَّى اللهُ عليه وسلَّمَ في مَجْلِسٍ يُحَدِّثُ القَوْمَ، جَاءَهُ أعْرَابِيٌّ فَقالَ: مَتَى السَّاعَةُ؟ فَمَضَى رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ يُحَدِّثُ، فَقالَ بَعْضُ القَوْمِ: سَمِعَ ما قالَ فَكَرِهَ ما قالَ. وقالَ بَعْضُهُمْ: بَلْ لَمْ يَسْمَعْ، حتَّى إذَا قَضَى حَدِيثَهُ قالَ: "أيْنَ - أُرَاهُ - السَّائِلُ عَنِ السَّاعَةِ" قالَ: هَا أنَا يا رَسولَ الله، قالَ: "فَإِذَا ضُيِّعَتِ الأمَانَةُ فَانْتَظِرِ السَّاعَةَ"، قالَ: كيفَ إضَاعَتُهَا؟ قالَ: "إذَا وُسِّدَ الأمْرُ إلى غيرِ أهْلِهِ فَانْتَظِرِ السَّاعَةَ."',
            source: "صحيح البخاري 59",
          },
        ],
      },
      {
        id: 4,
        title: "الإيثار",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ الأشْعَرِيِّينَ إذا أرْمَلُوا في الغَزْوِ، أوْ قَلَّ طَعامُ عِيالِهِمْ بالمَدِينَةِ جَمَعُوا ما كانَ عِنْدَهُمْ في ثَوْبٍ واحِدٍ، ثُمَّ اقْتَسَمُوهُ بيْنَهُمْ في إناءٍ واحِدٍ بالسَّوِيَّةِ، فَهُمْ مِنِّي وأنا منهمْ."',
            source: "صحيح البخاري 2486",
          },
        ],
      },
      {
        id: 5,
        title: "البر",
        ahadith: [
          {
            id: 1,
            title: 'عن النواس بن سمعان الأنصاري رضي الله عنه قال: أَقَمْتُ مع رَسُولِ اللهِ صَلَّى الله عليه وَسَلَّمَ بالمَدِينَةِ سَنَةً ما يَمْنَعُنِي مِنَ الهِجْرَةِ إلَّا المَسْأَلَةُ، كانَ أَحَدُنَا إذَا هَاجَرَ لَمْ يَسْأَلْ رَسُولَ اللهِ صَلَّى الله عليه وَسَلَّمَ عن شيءٍ، قالَ: فَسَأَلْتُهُ عَنِ البِرِّ وَالإِثْمِ، فَقالَ رَسُولُ اللهِ صَلَّى الله عليه وَسَلَّمَ: "البِرُّ حُسْنُ الخُلُقِ، وَالإِثْمُ ما حَاكَ في نَفْسِكَ، وَكَرِهْتَ أَنْ يَطَّلِعَ عليه النَّاسُ."',
            source: "صحيح مسلم 2553",
          },
          {
            id: 2,
            title: 'عن سلمان الفارسي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يردُّ القضاءَ إلَّا الدُّعاءُ ، ولا يزيدُ في العمرِ إلَّا البرُّ"',
            source: "صحيح الترمذي 2139",
          },
        ],
      },
      {
        id: 6,
        title: "البشاشة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي ذر الغفاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "تبسُّمُكَ في وجْهِ أخيكَ لَكَ صدقةٌ وأمرُكَ بالمعروفِ ونَهيُكَ عنِ المنْكرِ صدقةٌ وإرشادُكَ الرَّجلَ في أرضِ الضَّلالِ لَكَ صدقةٌ وبصرُكَ للرَّجلِ الرَّديءِ البصرِ لَكَ صدقةٌ وإماطتُكَ الحجرَ والشَّوْكَ والعظمَ عنِ الطَّريقِ لَكَ صدقةٌ وإفراغُكَ من دلوِكَ في دلوِ أخيكَ لَكَ صدقةٌ"',
            source: "صحيح الترمذي 1956",
          },
        ],
      },
      {
        id: 7,
        title: "التأني",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 8,
        title: "التضحية",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 9,
        title: "التعاون",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ المُؤْمِنَ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا. وشَبَّكَ أصَابِعَهُ."',
            source: "صحيح البخاري 481",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ الله في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ الله يَومَ القِيَامَةِ."',
            source: "صحيح البخاري 2442",
          },
        ],
      },
      {
        id: 10,
        title: "التواضع",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما نَقَصَتْ صَدَقةٌ مِن مالٍ، وما زادَ الله عَبْدًا بعَفْوٍ إلَّا عِزًّا، وما تَواضَعَ أحَدٌ لله إلَّا رَفَعَهُ الله"',
            source: "صحيح مسلم 2588",
          },
          {
            id: 2,
            title: 'عن عياض بنُ حِمارٍ رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:  "إنَّ اللهَ أوحى إليَّ أن تواضَعوا حتى لا يبغيَ أحدٌ على أحدٍ، ولا يفخرَ أحدٌ على أحدٍ"',
            source: "صحيح أبي داود 4895",
          },
        ],
      },
      {
        id: 11,
        title: "التودد",
        ahadith: [
          {
            id: 1,
            title: 'عن النعمان بن بشير رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "تَرَى المُؤْمِنِينَ في تَرَاحُمِهِمْ وتَوَادُّهِمْ وتَعَاطُفِهِمْ، كَمَثَلِ الجَسَدِ، إذا اشْتَكَى عُضْوًا تَدَاعَى لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالحُمَّى"',
            source: "صحيح البخاري 6011",
          },
        ],
      },
      {
        id: 12,
        title: "الجود والكرم والسخاء والبذل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "دِينارٌ أنْفَقْتَهُ في سَبيلِ اللهِ، ودِينارٌ أنْفَقْتَهُ في رَقَبَةٍ، ودِينارٌ تَصَدَّقْتَ به علَى مِسْكِينٍ، ودِينارٌ أنْفَقْتَهُ علَى أهْلِكَ؛ أعْظَمُها أجْرًا الذي أنْفَقْتَهُ علَى أهْلِكَ"',
            source: "صحيح مسلم 995",
          },
        ],
      },
      {
        id: 13,
        title: "حسن الظن",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ، فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَحَسَّسُوا، ولا تَجَسَّسُوا، ولا تَنافَسُوا، ولا تَحاسَدُوا، ولا تَباغَضُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ اللهِ إخْوانًا"',
            source: "صحيح مسلم 2563",
          },
        ],
      },
      {
        id: 14,
        title: "الحكمة",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَا حَسَدَ إلَّا في اثْنَتَيْنِ: رَجُلٌ آتَاهُ الله مَالًا فَسُلِّطَ علَى هَلَكَتِهِ في الحَقِّ، ورَجُلٌ آتَاهُ الله الحِكْمَةَ فَهو يَقْضِي بهَا ويُعَلِّمُهَا."',
            source: "صحيح البخاري 73",
          },
        ],
      },
      {
        id: 15,
        title: "الحلم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "أَنْهَاكُمْ عَمَّا يُنْبَذُ فِي الدُّبَّاءِ، وَالنَّقِيرِ، وَالْحَنْتَمِ، وَالْمُزَفَّتِ". وزادَ ابنُ مُعَاذٍ، في حَدِيثِهِ عَنْ أَبِيهِ: قَالَ: وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلأَشَجِّ، أَشَجِّ عَبْدِ القَيْسِ: إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ: الْحِلْمُ، وَالأَنَاةُ"',
            source: "صحيح مسلم 17",
          },
        ],
      },
      {
        id: 16,
        title: "الحياء",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الإِيمانُ بضْعٌ وسَبْعُونَ، أوْ بضْعٌ وسِتُّونَ، شُعْبَةً، فأفْضَلُها قَوْلُ لا إلَهَ إلَّا الله، وأَدْناها إماطَةُ الأذَى عَنِ الطَّرِيقِ، والْحَياءُ شُعْبَةٌ مِنَ الإيمانِ"',
            source: "صحيح مسلم 35",
          },
        ],
      },
      {
        id: 17,
        title: "الرحمة",
        ahadith: [
          {
            id: 1,
            title: 'عن النعمان بن بشير رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "تَرَى المُؤْمِنِينَ في تَرَاحُمِهِمْ وتَوَادُّهِمْ وتَعَاطُفِهِمْ، كَمَثَلِ الجَسَدِ، إذا اشْتَكَى عُضْوًا تَدَاعَى لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالحُمَّى"',
            source: "صحيح البخاري 6011",
          },
        ],
      },
      {
        id: 18,
        title: "الرفق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من أُعطِيَ حظَّه من الرِّفقِ فقد أُعطِيَ حظَّه من الخيرِ ومن حُرِمَ حظُّه من الرِّفقِ ؛ فقد حُرِمَ حظُّه من الخيرِ . أثقلٌ شيءٍ في ميزانِ المؤمنِ يومَ القيامةِ حُسنُ الخُلُقِ ، وإنَّ اللهَ لَيبغضُ الفاحشَ البذِيءَ"',
            source: "صحيح الأدب المفرد 361",
          },
        ],
      },
      {
        id: 19,
        title: "الستر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ الله عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ الله عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ الله في الدُّنْيَا وَالآخِرَةِ، والله في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ الله له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ؛ إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ، وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ الله فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ"',
            source: "صحيح مسلم 2699",
          },
        ],
      },
      {
        id: 20,
        title: "السكينة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أُقِيمَتِ الصَّلاةُ، فَلا تَأْتُوهَا وَأَنتُمْ تَسْعَوْنَ، وَلَكِنْ ائْتُوهَا وَأَنتُمْ تَمْشُونَ، وَعَلَيْكُمُ السَّكِينَةَ، فَمَا أَدْرَكْتُمْ فَصَلُّوا، وَمَا فَاتَكُمْ فَأَتِمُّوا"',
            source: "صحيح الترمذي 327",
          },
        ],
      },
      {
        id: 21,
        title: "سلامة الصدر",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 22,
        title: "السماحة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "رَحِمَ الله رَجُلًا سَمْحًا إذا باعَ، وإذا اشْتَرَى، وإذا اقْتَضَى"',
            source: "صحيح البخاري 2076",
          },
        ],
      },
      {
        id: 23,
        title: "الشجاعة",
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: كان النبي صلى الله عليه وسلم يعلمنا هؤلاء الكلمات، كما تعلم الكتابة: "اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ البُخْلِ، وأَعُوذُ بكَ مِنَ الجُبْنِ، وأَعُوذُ بكَ مِن أنْ نُرَدَّ إلى أرْذَلِ العُمُرِ، وأَعُوذُ بكَ مِن فِتْنَةِ الدُّنْيَا، وعَذَابِ القَبْرِ"',
            source: "صحيح البخاري 6390",
          }, 
        ],
      },
      {
        id: 24,
        title: "الشفقة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 25,
        title: "الشهامة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 26,
        title: "الصبر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: إنَّ نَاسًا مِنَ الأنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ فأعْطَاهُمْ، ثُمَّ سَأَلُوهُ فأعْطَاهُمْ، ثُمَّ سَأَلُوهُ فأعْطَاهُمْ، حتَّى نَفِدَ مَا عِنْدَهُ، فَقَالَ: "ما يَكُونُ عِنْدِي مِن خَيْرٍ فَلَنْ أدَّخِرَهُ عَنْكُمْ، وَمَن يَسْتَعْفِفْ يُعِفَّهُ الله، وَمَن يَسْتَغْنِ يُغْنِهِ الله، وَمَن يَتَصَبَّرْ يُصَبِّرْهُ الله، وَما أُعْطِيَ أَحَدٌ عَطَاءً خَيْرًا وَأَوْسَعَ مِنَ الصَّبْرِ"',
            source: "صحيح البخاري 1469",
          },           
        ],
      },
      {
        id: 27,
        title: "الصدق",
        ahadith: [
          {
            id: 1,
            title: 'عن عبدالله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ الصِّدْقَ يَهْدِي إلى البِرِّ، وإنَّ البِرَّ يَهْدِي إلى الجَنَّةِ، وإنَّ الرَّجُلَ لَيَصْدُقُ حتَّى يَكونَ صِدِّيقًا. وإنَّ الكَذِبَ يَهْدِي إلى الفُجُورِ، وإنَّ الفُجُورَ يَهْدِي إلى النَّارِ، وإنَّ الرَّجُلَ لَيَكْذِبُ حتَّى يُكْتَبَ عِنْدَ الله كَذَّابًا"',
            source: "صحيح البخاري 6094",
          },        
        ],
      },
      {
        id: 28,
        title: "الصمت",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن كانَ يُؤْمِنُ بالله والْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا، أوْ لِيَصْمُتْ، وَمَن كانَ يُؤْمِنُ بالله والْيَوْمِ الآخِرِ فَلْيُكْرِمْ جارَهُ، وَمَن كانَ يُؤْمِنُ بالله والْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ"',
            source: "صحيح مسلم 47",
          },   
        ],
      },
      {
        id: 29,
        title: "العدل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ المُقْسِطِينَ عِنْدَ اللهِ علَى مَنابِرَ مِن نُورٍ، عن يَمِينِ الرَّحْمَنِ عزَّ وجلَّ -وكِلْتا يَدَيْهِ يَمِينٌ- الَّذِينَ يَعْدِلُونَ في حُكْمِهِمْ وأَهْلِيهِمْ وما وَلُوا"',
            source: "صحيح مسلم 1827",
          },
        ],
      },
      {
        id: 30,
        title: "العزة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 31,
        title: "العزم والعزيمة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 32,
        title: "العفة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 33,
        title: "العفو والصفح",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما نَقَصَتْ صَدَقةٌ مِن مالٍ، وما زادَ اللهُ عَبْدًا بعَفْوٍ إلَّا عِزًّا، وما تَواضَعَ أحَدٌ لله إلَّا رَفَعَهُ الله"',
            source: "صحيح مسلم 2588",
          },
        ],
      },
      {
        id: 34,
        title: "علو الهمة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 35,
        title: "الغيرة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عتيك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "منَ الغَيرةِ ما يحبُّ اللَّهُ ومِنها ما يُبغِضُ اللَّهُ، فأمَّا الَّتي يحبُّها اللَّهُ فالغيرةُ في الرِّيبةِ، وأمَّا الغيرةُ الَّتي يُبغِضُها اللَّهُ فالغَيرةُ في غيرِ ريبةٍ، وإنَّ منَ الخُيَلاءِ ما يُبغضُ اللَّهُ، ومنها ما يحبُّ اللَّهُ، فأمَّا الخيلاءُ الَّتي يحبُّ اللَّهُ فاختيالُ الرَّجلِ نفسَهُ عندَ القتالِ، واختيالُهُ عندَ الصَّدَقةِ، وأمَّا الَّتي يبغضُه اللَّهُ فاختيالُهُ في البغيِ والفخرِ"',
            source: "صحيح أبي داود 2",
          },
        ],
      },
      {
        id: 36,
        title: "الفراسة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 37,
        title: "الفصاحة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 38,
        title: "الفطنة والذكاء",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 39,
        title: "القناعة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 40,
        title: "كتمان السر",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 41,
        title: "كظم الغيض",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ الشَّدِيدُ بالصُّرَعَةِ، إنَّما الشَّدِيدُ الذي يَمْلِكُ نَفْسَهُ عِنْدَ الغَضَبِ"',
            source: "صحيح البخاري 6114",
          },
        ],
      },
      {
        id: 42,
        title: "المحبة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 43,
        title: "المداراة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 44,
        title: "المروءة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 45,
        title: "المزاح",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 46,
        title: "النبل",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 47,
        title: "النزاهة",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 48,
        title: "النشاط",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ العَجْزِ والكَسَلِ، والجُبْنِ والهَرَمِ، وأَعُوذُ بكَ مِن فِتْنَةِ المَحْيا والمَماتِ، وأَعُوذُ بكَ مِن عَذابِ القَبْرِ"',
            source: "صحيح البخاري 2823",
          },
        ],
      },
      {
        id: 49,
        title: "النصرة",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "انصر أخاك ظالمًا أو مظلومًا". فقال رجل: يا رسول الله، أنصره إذا كان مظلومًا، أفرأيت إذا كان ظالمًا، كيف أنصره؟ قال: "تحجزه -أو تمنعه- من الظلم؛ فإن ذلك نصره"',
            source: "صحيح البخاري 6952",
          },
        ],
      },
      {
        id: 50,
        title: "النصيحة",
        ahadith: [
          {
            id: 1,
            title: 'عن تميم الداري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الدِّينُ النَّصِيحَةُ". قُلْنَا: لِمَنْ؟ قَالَ: "لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ"',
            source: "صحيح مسلم 55",
          },
        ],
      },
      {
        id: 51,
        title: "الورع",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 52,
        title: "الوفاء بالعهد",
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      {
        id: 53,
        title: "الوقار",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَتَاكُمْ أَهْلُ الْيَمَنِ، هُمْ أَرَقُّ أَفْئِدَةً وَأَلْيَنُ قُلُوبًا، الْإِيمَانُ يَمَانٍ وَالْحِكْمَةُ يَمَانِيَّةٌ، وَالْفَخْرُ وَالْخُيَلَاءُ فِي أَصْحَابِ الْإِبِلِ، وَالسَّكِينَةُ وَالْوَقَارُ فِي أَهْلِ الْغَنَمِ"',
            source: "صحيح البخاري 4388",
          },
        ],
      },
    ]
  },
  //done sourced
  {
    id: 25,
    title: "السنن الرواتب",
    sunan: [
      {
        id: 1,
        title: "أداء السنن الرواتب",
        desc: "من السنة أداء السنن الرواتب.",
        ahadith: [
          {
            id: 1,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما من عبدٍ مسلمٍ يصلِّي للهِ تعالى في كلِّ يومٍ ثِنْتي عشرةَ ركعةً تطوُّعًا غيرَ فريضةٍ إلا بنى اللهُ تعالى له بيتًا في الجنَّةِ ، أو : إلا بُنِيَ له بيتٌ في الجنَّةِ :أربعًا قبلَ الظهرِ ، و ركعتَين بعدَها ، و ركعتَين بعد المغربِ ، و ركعتَين بعد العشاءِ ، و ركعتَين قبلَ صلاةِ الغَداةِ"',
            source: "صحيح الترغيب 579",
          },
        ],
      },
      {
        id: 2,
        title: "سنة الفجر القبلية",
        desc: "من السنة صلاة ركعتين قبل صلاة الفجر.",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "رَكْعَتَا الفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَما فِيهَا"',
            source: "صحيح مسلم 725"
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رضِي الله عنها، قالت: "لم يكُنِ النبيُّ صلَّى اللهُ عليه وسلَّم على شيءٍ مِن النوافلِ أَشدَّ تعاهُدًا منْه على رَكعتَي الفجرِ"',
            source: "صحيح البخاري 1169",
          },
          {
            id: 3,
            title: 'عن عَبدُ اللهِ بنُ شَقيقٍ رضي الله عنه قال: سَأَلْتُ عَائِشَةَ عن صَلَاةِ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ؛ عن تَطَوُّعِهِ، فَقالَتْ: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
            source: "صحيح مسلم 730"
          },
        ],
      },
      {
        id: 3,
        title: "سنة الظهر القبلية",
        desc: "من السنة صلاة أربع ركعات (ركعتين ركعتين) قبل صلاة الظهر.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ السَّائبِ رَضِيَ اللهُ عَنْه: "أنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّمَ كان يصلي أربعًا بعد أن تزولَ الشمسُ قبلَ الظهرِ وقال : إنها ساعةٌ تُفتح فيها أبوابُ السماءِ، وأُحبُّ أن يصعَد لي فيها عملٌ صالحٌ"',
            source: "صحيح الترمذي 478",
          },
          {
            id: 2,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "من رَكعَ أربعَ رَكعاتٍ قبلَ الظُّهرِ وأربعًا بعدَها حرَّمَ الله عزَّ وجلَّ لحمَه علَى النَّارِ فما ترَكتُهنَّ منذُ سمعتُهنَّ"',
            source: "صحيح النسائي 1811",
          },
          {
            id: 3,
            title: 'عن عَبدُ اللهِ بنُ شَقيقٍ رضي الله عنه قال: سَأَلْتُ عَائِشَةَ عن صَلَاةِ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ؛ عن تَطَوُّعِهِ، فَقالَتْ: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
            source: "صحيح مسلم 730"
          },
        ]
      },
      {
        id: 4,
        title: "سنة الظهر البعدية",
        desc: "من السنة صلاة أربع ركعات (ركعتين ركعتين) بعد صلاة الظهر.",
        ahadith: [
          {
            id: 1,
            title: 'عن أم حبيبة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "من رَكعَ أربعَ رَكعاتٍ قبلَ الظُّهرِ وأربعًا بعدَها حرَّمَ الله عزَّ وجلَّ لحمَه علَى النَّارِ فما ترَكتُهنَّ منذُ سمعتُهنَّ"',
            source: "صحيح النسائي 1811",
          },
          {
            id: 2,
            title: 'عن عَبدُ اللهِ بنُ شَقيقٍ رضي الله عنه قال: سَأَلْتُ عَائِشَةَ عن صَلَاةِ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ؛ عن تَطَوُّعِهِ، فَقالَتْ: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
            source: "صحيح مسلم 730"
          },
        ]
      },
      {
        id: 5,
        title: "سنة العصر القبلية",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "رحِمَ الله امرَأً صلَّى قبلَ العصرِ أربعًا"',
            source: "صحيح أبي داود 1271",
          },
        ],
      },
      {
        id: 6,
        title: "سنة المغرب البعدية",
        desc: "من السنة صلاة ركعتين بعد صلاة المغرب.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "حفِظتُ عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم عشرَ ركَعاتٍ ، كان يُصلِّيها باللَّيلِ والنَّهارِ : ركعتَيْن قبل الظُّهرِ ، وركعتَيْن بعدها ، وركعتَيْن بعد المغربِ وركعتَيْن بعد العشاءِ الآخرةِ . قال وحدَّثتني حفصةُ : أنَّه كان يُصلِّي قبل الفجرِ ركعتَيْن"',
            source: "صحيح الترمذي 433",
          },
          {
            id: 2,
            title: 'عن عَبدُ اللهِ بنُ شَقيقٍ رضي الله عنه قال: سَأَلْتُ عَائِشَةَ عن صَلَاةِ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ؛ عن تَطَوُّعِهِ، فَقالَتْ: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
            source: "صحيح مسلم 730"
          },
        ],
      },
      {
        id: 7,
        title: "سنة العشاء البعدية",
        desc: "من السنة صلاة ركعتين بعد صلاة العشاء.",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "حفِظتُ عن رسولِ اللهِ صلَّى اللهُ عليه وسلَّم عشرَ ركَعاتٍ ، كان يُصلِّيها باللَّيلِ والنَّهارِ : ركعتَيْن قبل الظُّهرِ ، وركعتَيْن بعدها ، وركعتَيْن بعد المغربِ وركعتَيْن بعد العشاءِ الآخرةِ . قال وحدَّثتني حفصةُ : أنَّه كان يُصلِّي قبل الفجرِ ركعتَيْن"',
            source: "صحيح الترمذي 433",
          },
          {
            id: 2,
            title: 'عن عَبدُ اللهِ بنُ شَقيقٍ رضي الله عنه قال: سَأَلْتُ عَائِشَةَ عن صَلَاةِ رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ؛ عن تَطَوُّعِهِ، فَقالَتْ: "كانَ يُصَلِّي في بَيْتي قَبْلَ الظُّهْرِ أَرْبَعًا، ثُمَّ يَخْرُجُ فيُصَلِّي بالنَّاسِ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي بالنَّاسِ المَغْرِبَ، ثُمَّ يَدْخُلُ فيُصَلِّي رَكْعَتَيْنِ، وَيُصَلِّي بالنَّاسِ العِشَاءَ، وَيَدْخُلُ بَيْتي فيُصَلِّي رَكْعَتَيْنِ، وَكانَ يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ، فِيهِنَّ الوِتْرُ، وَكانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا، وَلَيْلًا طَوِيلًا قَاعِدًا، وَكانَ إذَا قَرَأَ وَهو قَائِمٌ، رَكَعَ وَسَجَدَ وَهو قَائِمٌ، وإذَا قَرَأَ قَاعِدًا، رَكَعَ وَسَجَدَ وَهو قَاعِدٌ، وَكانَ إذَا طَلَعَ الفَجْرُ صَلَّى رَكْعَتَيْنِ"',
            source: "صحيح مسلم 730"
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 26,
    title: "سنن صلاة النوافل",
    sunan: [
      {
        id: 1,
        title: "أداء صلاة النافلة في البيت",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا قَضَى أحَدُكُمُ الصَّلاةَ في مَسْجِدِهِ، فَلْيَجْعَلْ لِبَيْتِهِ نَصِيبًا مِن صَلاتِهِ، فإنَّ اللَّهَ جاعِلٌ في بَيْتِهِ مِن صَلاتِهِ خَيْرًا"',
            source: "صحيح مسلم 778",
          },
          {
            id: 2,
            title: 'عن زيدِ بنِ ثابتٍ، قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ اتَّخَذَ حُجْرَةً - قالَ: حَسِبْتُ أنَّهُ قالَ مِن حَصِيرٍ - في رَمَضَانَ، فَصَلَّى فِيهَا لَيَالِيَ، فَصَلَّى بصَلَاتِهِ نَاسٌ مِن أَصْحَابِهِ، فَلَمَّا عَلِمَ بهِمْ جَعَلَ يَقْعُدُ، فَخَرَجَ إليهِم فَقالَ: "قدْ عَرَفْتُ الذي رَأَيْتُ مِن صَنِيعِكُمْ، فَصَلُّوا أَيُّهَا النَّاسُ في بُيُوتِكُمْ، فإنَّ أَفْضَلَ الصَّلَاةِ صَلَاةُ المَرْءِ في بَيْتِهِ إلَّا المَكْتُوبَةَ"',
            source: "صحيح البخاري 731",
          },
        ],
      },
      {
        id: 2,
        title: "صلاة الضحى",
        ahadith: [
          {
            id: 1,
            title: 'عن مُعاذةُ بنتُ عبدِ اللهِ العَدويَّةُ رضي الله عنها أنَّهَا سَأَلَتْ عَائِشَةَ رَضِيَ الله عَنْهَا: كَمْ كانَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ يُصَلِّي صَلَاةَ الضُّحَى؟ قالَتْ: "أَرْبَعَ رَكَعَاتٍ، وَيَزِيدُ ما شَاءَ. [وفي رواية]: يَزِيدُ ما شَاءَ الله"',
            source: "صحيح مسلم 719"
          },
          {
            id: 2,
            title: 'عن أبي ذرٍّ رَضِيَ اللهُ عنه، عنِ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّه قال: "يُصبِحُ على كلِّ سُلامَى من أحدِكم صَدقةٌ؛ فكلُّ تَحميدةٍ صدقةٌ، وكلُّ تهليلةٍ صدقةٌ، وأمْرٌ بالمعروفِ صَدقةٌ، ونهيٌ عن المنكَرِ صدقةٌ، ويُجزِئُ عن ذلك ركعتانِ يَركعُهما من الضُّحَى"',
            source: "صحيح مسلم 720",
          },
          {
            id: 3,
            title: 'عن أبي الدَّرداءِ رَضِيَ اللهُ عنه، قال: "أَوْصاني حبيبي بثلاثٍ لنْ أَدَعهنَّ ما عشتُ: بصيامِ ثلاثةِ أيَّامٍ من كلِّ شهرٍ، وصلاةِ الضُّحى، وأنْ لا أنامَ حتى أُوتِرَ"',
            source: "صحيح مسلم 722",
          },
          {
            id: 4,
            title: 'عن أبي هُرَيرَة رَضِيَ اللهُ عنه، قال: "أَوْصاني خليلي صلَّى اللهُ عليه وسلَّم بثلاثٍ: صيامِ ثلاثةِ أيَّامٍ من كلِّ شهرٍ، وركعتي الضُّحى، وأنْ أُوتِرَ قبل أن أرقُدَ"',
            source: "صحيح البخاري 1178",
          },
        ],
      },
      {
        id: 3,
        title: "قيام الليل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من قامَ بعشرِ آياتٍ لم يُكتب منَ الغافلينَ ومن قامَ بمائةِ آيةٍ كتبَ منَ القانتينَ ومن قامَ بألفِ آيةٍ كتبَ منَ المقنطرينَ"',
            source: "صحيح أبي داود 1398",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: سَأَلَ رَجُلٌ النبيَّ صَلَّى اللهُ عليه وسلَّمَ وهو علَى المِنْبَرِ: ما تَرَى في صَلَاةِ اللَّيْلِ؟ قَالَ: "مَثْنَى مَثْنَى، فَإِذَا خَشِيَ الصُّبْحَ صَلَّى واحِدَةً، فأوْتَرَتْ له ما صَلَّى." وإنَّه كانَ يقولُ: "اجْعَلُوا آخِرَ صَلَاتِكُمْ وِتْرًا"؛ فإنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ أمَرَ بهِ',
            source: "صحيح البخاري 472",
          },
          {
            id: 3,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "لاَ تدع قيامَ اللَّيلِ فإنَّ رسولَ الله صلى الله عليه وسلم كانَ لاَ يدعُهُ وَكانَ إذا مرضَ أو كسلَ صلَّى قاعدًا"',
            source: "صحيح أبي داود 1307",
          },
          {
            id: 4,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عَنْها قالت: "أنَّ نَبِيَّ الله صَلَّى اللهُ عليه وسلَّمَ كانَ يَقُومُ مِنَ اللَّيْلِ حتَّى تَتَفَطَّرَ قَدَمَاهُ"، فَقالَتْ عَائِشَةُ: لِمَ تَصْنَعُ هذا يا رَسولَ الله، وقدْ غَفَرَ الله لكَ ما تَقَدَّمَ مِن ذَنْبِكَ وما تَأَخَّرَ؟ قالَ: "أفلا أُحِبُّ أنْ أكُونَ عَبْدًا شَكُورًا" فَلَمَّا كَثُرَ لَحْمُهُ صَلَّى جَالِسًا، فَإِذَا أرَادَ أنْ يَرْكَعَ قَامَ فَقَرَأَ ثُمَّ رَكَعَ',
            source: "صحيح البخاري 4837",
          },
          {
            id: 5,
            title: 'عن عبدِ اللهِ بنِ سَلَامٍ رَضِيَ اللهُ عَنْه، قال: لمَّا قدمَ النَّبيُّ صلَّى الله علَيهِ وسلَّمَ المدينةَ، انجَفلَ النَّاسُ قبلَهُ، وقيلَ: قد قدمَ رسولُ الله صلَّى الله علَيهِ وسلَّمَ، قد قدمَ رسولُ الله، قد قدمَ رسولُ الله ثلاثًا، فَجِئْتُ في النَّاسِ، لأنظرَ، فلمَّا تبيَّنتُ وجهَهُ، عرفتُ أنَّ وجهَهُ ليسَ بوَجهِ كذَّابٍ، فَكانَ أوَّلُ شيءٍ سَمِعْتُهُ تَكَلَّمَ بِهِ، أن قالَ: "يا أيُّها النَّاسُ أفشوا السَّلامَ، وأطعِموا الطَّعامَ، وصِلوا الأرحامَ، وصلُّوا باللَّيلِ، والنَّاسُ نيامٌ، تدخلوا الجنَّةَ بسَلامٍ"',
            source: "صحيح ابن ماجه 2648",
          },
          {
            id: 6,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ في الجنةِ غُرَفًا يُرَى ظَاهِرُها من باطِنِها ، و باطِنُها من ظَاهِرِها" . فقال أبو مالِكٍ الأَشْعَرِيُّ : لِمَنْ هيَ يا رسولَ اللهِ ؟ قال : "لِمَنْ أَطَابَ الكَلامَ ، و أَطْعَمَ الطَّعَامَ ، و باتَ قائِمًا و الناسُ نِيامٌ"',
            source: "صحيح الترغيب 946",
          },
          {
            id: 7,
            title: 'عن أبي الدرداء رَضِيَ اللهُ عَنْه قال: قال الرسول صلَّى اللهُ عليه وسلَّم: "عليكمْ بقيامِ الليلِ فإنَّه دأبُ الصالحينَ قبلكمْ، و قربةٌ إلى اللهِ تعالى، و منهاةٌ عنِ الإثمِ، و تكفيرٌ للسيئاتِ، و مطردةٌ للداءِ عنِ الجسدِ"',
            source: "الجامع الصغير 5555",
          },
          {
            id: 8,
            title: 'عن أَبي هُرَيرَة رَضِيَ اللهُ عَنْه قال: سُئِلَ [أي النبي صلى الله عليه وسلم]: أَيُّ الصَّلَاةِ أَفْضَلُ بَعْدَ المَكْتُوبَةِ؟ وَأَيُّ الصِّيَامِ أَفْضَلُ بَعْدَ شَهْرِ رَمَضَانَ؟ فَقالَ: "أَفْضَلُ الصَّلَاةِ بَعْدَ الصَّلَاةِ المَكْتُوبَةِ الصَّلَاةُ في جَوْفِ اللَّيْلِ، وَأَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ صِيَامُ شَهْرِ اللهِ المُحَرَّمِ"',
            source: "صحيح مسلم 1163",
          },
          {
            id: 9,
            title: 'عن أبي سَلمةَ بنِ عبدِ الرحمنِ رضي الله عنه أنَّه سَأَلَ عائِشةَ رَضيَ اللهُ عنها: كيفَ كَانَتْ صَلَاةُ رَسولِ الله صلَّى اللهُ عليه وسلَّمَ في رَمَضَانَ؟ فَقالَتْ: "ما كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ يَزِيدُ في رَمَضَانَ ولَا في غيرِهِ علَى إحْدَى عَشْرَةَ رَكْعَةً؛ يُصَلِّي أَرْبَعًا، فلا تَسَلْ عن حُسْنِهِنَّ وطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا، فلا تَسَلْ عن حُسْنِهِنَّ وطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلَاثًا." قالَتْ عَائِشَةُ: فَقُلتُ: يا رَسولَ الله، أَتَنَامُ قَبْلَ أَنْ تُوتِرَ؟ فَقالَ: "يا عَائِشَةُ، إنَّ عَيْنَيَّ تَنَامَانِ ولَا يَنَامُ قَلْبِي"',
            source: "صحيح البخاري 1147",
          },
          {
            id: 10,
            title: 'عن ابنِ عبَّاسٍ رَضِيَ اللهُ عَنْهما قال: "كان صلاةُ النبيِّ صلَّى اللهُ عليه وسلَّم ثلاثَ عَشرةَ ركعةً. يعني: باللَّيل"',
            source: "صحيح البخاري 1138",
          },
          {
            id: 11,
            title: 'عن عبدِ اللهِ بنِ عُمرَ رَضِيَ اللهُ عَنْهما، قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: "صلاةُ الليلِ مَثنَى مَثنى، فإذا رأيتَ أنَّ الصبحَ يُدركُك فأَوتِر بواحدةٍ"، قال: فقيل لابن عُمر: ما مَثنَى مَثنَى؟ قال تُسلِّم في كلِّ ركعتينِ',
            source: "صحيح مسلم 749",
          },
          {
            id: 12,
            title: 'عن عائشةَ أم المؤمنين رضي الله عنها قالت: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ كانَ يُصَلِّي إحْدَى عَشْرَةَ رَكْعَةً، كَانَتْ تِلكَ صَلَاتَهُ يَسْجُدُ السَّجْدَةَ مِن ذلكَ قَدْرَ ما يَقْرَأُ أحَدُكُمْ خَمْسِينَ آيَةً، قَبْلَ أنْ يَرْفَعَ رَأْسَهُ، ويَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلَاةِ الفَجْرِ، ثُمَّ يَضْطَجِعُ علَى شِقِّهِ الأيْمَنِ حتَّى يَأْتِيَهُ المُنَادِي لِلصَّلَاةِ"',
            source: "صحيح البخاري 1123",
          },
        ],
      },
      {
        id: 4,
        title: "صلاة التوبة",
        ahadith: [
          {
            id: 1,
            title: 'عن أسماءَ بنِ الحَكَمِ الفزازي ، قالَ: سَمِعْتُ عليًّا رضيَ الله عنهُ يقولُ: كنتُ رجلًا إذا سَمِعْتُ من رسولِ الله صلَّى الله علَيهِ وسلَّمَ حديثًا نفعَني الله منهُ بما شاءَ أن ينفعَني، وإذا حدَّثَني أحدٌ من أصحابِهِ استَحلفتُهُ، فإذا حلَفَ لي صدَّقتُهُ، قالَ: وحدَّثَني أبو بَكْرٍ وصدقَ أبو بَكْرٍ رضيَ الله عنهُ، أنَّهُ قالَ: سَمِعْتُ رسولَ الله صلَّى الله علَيهِ وسلَّمَ يقولُ: "ما مِن عبدٍ يذنبُ ذنبًا، فيُحسنُ الطُّهورَ، ثمَّ يقومُ فيُصلِّي رَكْعتينِ، ثمَّ يستغفِرُ اللَّهَ، إلَّا غفرَ الله لَهُ، ثمَّ قرأَ هذِهِ الآيةَ: وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ ذَكَرُوا اللَّهَ إلى آخرِ الآيةِ"',
            source: "صحيح أبي داود 1521",
          },
        ],
      },
      {
        id: 5,
        title: "صلاة الوتر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبزى رضي الله عنه قال: "كانَ رسولُ الله يوترُ بِ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ الله أَحَدٌ ويقولُ بعدما يسلِّمُ : سُبحانَ الملِكِ القدُّوس ثلاثَ مرَّاتٍ ، يرفَعُ بِها صوتَهُ"',
            source: "صحيح النسائي 1750",
          },
        ],
      },
      {
        id: 50,
        title: "ما يقرأ في صلاة الوتر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبزى رضي الله عنه قال: "كانَ رسولُ الله يوترُ بِ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ الله أَحَدٌ ويقولُ بعدما يسلِّمُ : سُبحانَ الملِكِ القدُّوس ثلاثَ مرَّاتٍ ، يرفَعُ بِها صوتَهُ"',
            source: "صحيح النسائي 1750",
          },
        ],
      },
      {
        id: 51,
        title: "ما يقال بعد صلاة الوتر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبزى رضي الله عنه قال: "كانَ رسولُ الله يوترُ بِ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ الله أَحَدٌ ويقولُ بعدما يسلِّمُ : سُبحانَ الملِكِ القدُّوس ثلاثَ مرَّاتٍ ، يرفَعُ بِها صوتَهُ"',
            source: "صحيح النسائي 1750",
          },
        ],
      },
      {
        id: 6,
        title: "صلاة الإستخارة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبدالله رضي الله عنه قال: "كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ في الأُمُورِ كُلِّهَا كما يُعَلِّمُنَا السُّورَةَ مِنَ القُرْآنِ؛ يقولُ: إذَا هَمَّ أحَدُكُمْ بالأمْرِ، فَلْيَرْكَعْ رَكْعَتَيْنِ مِن غيرِ الفَرِيضَةِ، ثُمَّ لْيَقُل: اللَّهُمَّ إنِّي أسْتَخِيرُكَ بعِلْمِكَ، وأَسْتَقْدِرُكَ بقُدْرَتِكَ، وأَسْأَلُكَ مِن فَضْلِكَ العَظِيمِ؛ فإنَّكَ تَقْدِرُ ولَا أقْدِرُ، وتَعْلَمُ ولَا أعْلَمُ، وأَنْتَ عَلَّامُ الغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ خَيْرٌ لي في دِينِي ومعاشِي وعَاقِبَةِ أمْرِي - أوْ قالَ: عَاجِلِ أمْرِي وآجِلِهِ - فَاقْدُرْهُ لي ويَسِّرْهُ لِي، ثُمَّ بَارِكْ لي فِيهِ، وإنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ شَرٌّ لي في دِينِي ومعاشِي وعَاقِبَةِ أمْرِي - أوْ قالَ: في عَاجِلِ أمْرِي وآجِلِهِ - فَاصْرِفْهُ عَنِّي واصْرِفْنِي عنْه، واقْدُرْ لي الخَيْرَ حَيْثُ كَانَ، ثُمَّ أرْضِنِي قالَ: «وَيُسَمِّي حَاجَتَهُ»".',
            source: "صحيح البخاري 1162",
          },
        ],
      },
      {
        id: 7,
        title: "صلاة الجنازة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن شَهِدَ الجَنازَةَ حتَّى يُصَلِّيَ، فَلَهُ قِيراطٌ، ومَن شَهِدَ حتَّى تُدْفَنَ كانَ له قِيراطانِ"، قيلَ: وما القِيراطانِ؟ قالَ: "مِثْلُ الجَبَلَيْنِ العَظِيمَيْنِ"',
            source: "صحيح البخاري 1325",
          },
        ],
      },
      {
        id: 8,
        title: "صلاة الكسوف والخسوف",
        ahadith: [
          {
            id: 1,
            title: 'عن المغيرة بن شعبة رضي الله عنه قال: كَسَفَتِ الشَّمْسُ علَى عَهْدِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ يَومَ مَاتَ إبْرَاهِيمُ، فَقالَ النَّاسُ: كَسَفَتِ الشَّمْسُ لِمَوْتِ إبْرَاهِيمَ، فَقالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: "إنَّ الشَّمْسَ والقَمَرَ لا يَنْكَسِفَانِ لِمَوْتِ أحَدٍ ولَا لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ فَصَلُّوا، وادْعُوا اللَّهَ"',
            source: "صحيح البخاري 1043",
          },
        ],
      },
      {
        id: 9,
        title: "صلاة التهجد",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يَنْزِلُ رَبُّنا تَبارَكَ وتَعالَى كُلَّ لَيْلةٍ إلى السَّماءِ الدُّنْيا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ، يقولُ: مَن يَدْعُونِي، فأسْتَجِيبَ له؟ مَن يَسْأَلُنِي فأُعْطِيَهُ؟ مَن يَستَغْفِرُني فأغْفِرَ له؟"',
            source: "صحيح البخاري 1145",
          },
        ],
      },
      {
        id: 10,
        title: "صلاة الاستسقاء",
        ahadith: [
          {
            id: 1,
            title: 'عن عبدِ اللهِ بنِ زيدِ بنِ عاصمٍ، قال: "رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يومًا خرَج يَستسقي، قال: فحوَّل إلى الناسِ ظَهرَه، واستقبل القِبلةَ يَدْعو، ثم حوَّلَ رِداءَه، ثم صلَّى لنا ركعتينِ، جهَر فيهما بالقِراءةِ"',
            source: "صحيح البخاري 1025",
          },
        ],
      },
      {
        id: 11,
        title: "صلاة العيدين",
        ahadith: [
         
        ],
      },
      {
        id: 12,
        title: "المحافظة على قيام الليل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قالَ لي رَسولُ الله صلَّى اللهُ عليه وسلَّمَ: "يا عَبْدَ الله، لا تَكُنْ مِثْلَ فُلانٍ؛ كانَ يَقُومُ اللَّيْلَ، فَتَرَكَ قِيَامَ اللَّيْلِ"',
            source: "صحيح البخاري 1152",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 27,
    title: "سنن في المنزل",
    sunan: [
      {
        id: 1,
        title: "المشي حافيا في المنزل",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بريدة بن الحصيب الأسلمي رضي الله عنه قال: أنَّ رجلًا من أصحابِ النَّبيِّ رحلَ إلى فَضالةَ بنِ عبيدٍ وَهوَ بمصرَ، فقدمَ عليهِ، فقال: أما إنِّي لم آتِكَ زائرًا، ولَكنِّي سمعتُ أنا وأنتَ حديثًا من رسولِ الله صلَّى الله عليْهِ وسلَّمَ رجوتُ أن يَكونَ عندَكَ منْهُ علمٌ، قال: وما هو؟ قال: كذا وَكذا، قال: فما لي أراكَ شعثًا وأنتَ أميرُ الأرضِ؟ قال: إنَّ رسولَ الله صلَّى الله عليْهِ وسلَّمَ كانَ ينْهانا عن كثيرٍ منَ الإرفاهِ، قال: فما لي لا أرى عليْكَ حِذاءً؟ قال: "كانَ النَّبيُّ صلَّى الله عليْهِ وسلَّمَ يأمرُنا أن نحتَفِيَ أحيانًا"',
            source: "صحيح أبي داود 4160",
          },
        ],
      },
      {
        id: 2,
        title: "الإستئذان قبل الدخول ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الاستئذانُ ثَلاثٌ ، فإن أذنَ لَكَ وإلَّا فارجِعْ"',
            source: "صحيح الترمذي 2690",
          },
        ],
      },
      {
        id: 3,
        title: "صلاة ركعتين عند الخروج من المنزل وعند الدخول",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا خرجتَ من منزلكَ فصلّ ركعتين يمنعانكَ من مخرجِ السوءِ ، وإذا دخلتَ إلى منزلكِ فصلّ ركعتينَ يمنعانكَ من مدخلِ السوءِ"',
            source: "السلسلة الصحيحة 1323",
          },
        ],
      },
      {
        id: 4,
        title: "الوقوف عن يمين الباب أو شماله",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بسر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تأْتوا البيوتَ من أبوابها ، ولكن ائْتوها من جوانبِها ، فاستأذِنوا فإن أُذِنَ لكم فادْخلوا ، وإلا فارْجِعوا"',
            source: "صحيح الترغيب 2731",
          },
        ],
      },
      {
        id: 5,
        title: "ذكر الله عند دخول المنزل",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ، فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ، قالَ الشَّيْطَانُ: لا مَبِيتَ لَكُمْ، وَلَا عَشَاءَ، وإذَا دَخَلَ، فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ، قالَ الشَّيْطَانُ: أَدْرَكْتُمُ المَبِيتَ، وإذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ، قالَ: أَدْرَكْتُمُ المَبِيتَ وَالْعَشَاءَ. وفي روايةٍ : وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ طَعَامِهِ، وإنْ لَمْ يَذْكُرِ اسْمَ اللهِ عِنْدَ دُخُولِهِ."',
            source: "صحيح مسلم 2018",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 28,
    title: "سنن الإغتسال",
    sunan: [
      {
        id: 1,
        title: "غسل اليدين ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ إذَا اغْتَسَلَ مِنَ الجَنَابَةِ، بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كما يَتَوَضَّأُ لِلصَّلَاةِ، ثُمَّ يُدْخِلُ أصَابِعَهُ في المَاءِ، فيُخَلِّلُ بهَا أُصُولَ شَعَرِهِ، ثُمَّ يَصُبُّ علَى رَأْسِهِ ثَلَاثَ غُرَفٍ بيَدَيْهِ، ثُمَّ يُفِيضُ المَاءَ علَى جِلْدِهِ كُلِّهِ"',
            source: "صحيح البخاري 248",
          },
        ]
      },
      {
        id: 2,
        title: "غسل الفرج بالشمال",
        ahadith: [
          {
            id: 1,
            title: 'عن ميمونة بنت الحارث أم المؤمنين رضي الله عنها قالت: "وَضَعْتُ لِرَسولِ الله صَلَّى اللهُ عليه وسلَّمَ غُسْلًا وسَتَرْتُهُ، فَصَبَّ علَى يَدِهِ، فَغَسَلَهَا مَرَّةً أوْ مَرَّتَيْنِ - قالَ: سُلَيْمَانُ لا أدْرِي، أذَكَرَ الثَّالِثَةَ أمْ لَا؟ - ثُمَّ أفْرَغَ بيَمِينِهِ علَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، ثُمَّ دَلَكَ يَدَهُ بالأرْضِ أوْ بالحَائِطِ، ثُمَّ تَمَضْمَضَ واسْتَنْشَقَ، وغَسَلَ وجْهَهُ ويَدَيْهِ، وغَسَلَ رَأْسَهُ، ثُمَّ صَبَّ علَى جَسَدِهِ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ، فَنَاوَلْتُهُ خِرْقَةً، فَقالَ بيَدِهِ هَكَذَا، ولَمْ يُرِدْهَا"',
            source: "صحيح البخاري 266",
          },
        ]
      },
    ],
  },
  //done sourced
  {
    id: 29,
    title: "سنن العيد",
    sunan: [
      {
        id: 1,
        title: "الذهاب إلى مصلى العيد من طريق، والعودة من طريق آخر",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبدالله رضي الله عنه قال: "كان النبيُّ صلَّى اللهُ عليه وسلَّم إذا كان يومُ العيدِ خالَفَ الطريقَ"',
            source: "صحيح البخاري 986",
          },
        ],
      },
      {
        id: 2,
        title: "الأكل يوم عيد الفطر قبل الذهاب للمصلى",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "كانَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ لا يَغْدُو يَومَ الفِطْرِ حتَّى يَأْكُلَ تَمَراتٍ. وقال مرجأ بن رجاء...: ويَأْكُلُهُنَّ وِتْرًا"',
            source: "صحيح البخاري 953",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 30,
    title: "سنن عن الحيوانات",
    sunan: [
      {
        id: 1,
        title: "عدم سب الديك",
        ahadith: [
          {
            id: 1,
            title: 'عن زيد بن خالد الجهني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تسُبُّوا الدِّيكَ ، فإنَّهُ يُوقِظُ للصلاةِ"',
            source: "الجامع الصغير 9767",
          },
        ]
      },
      {
        id: 2,
        title: "قتل الوزغ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قَتَلَ وزَغًا في أوَّلِ ضَرْبَةٍ كُتِبَتْ له مِئَةُ حَسَنَةٍ، وفي الثَّانِيَةِ دُونَ ذلكَ، وفي الثَّالِثَةِ دُونَ ذلكَ. وفي رواية : في أوَّلِ ضَرْبَةٍ سَبْعِينَ حَسَنَةً"',
            source: "صحيح مسلم 2240",
          },
        ]
      },
      {
        id: 3,
        title: "الرفق بالحيوانات",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "يا عائِشَةُ إنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ، ويُعْطِي علَى الرِّفْقِ ما لا يُعْطِي علَى العُنْفِ، وما لا يُعْطِي علَى ما سِواهُ"',
            source: "صحيح مسلم 2593",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "عُذِّبَتِ امْرَأَةٌ في هِرَّةٍ سَجَنَتْها حتَّى ماتَتْ، فَدَخَلَتْ فيها النَّارَ، لا هي أطْعَمَتْها ولا سَقَتْها، إذْ حَبَسَتْها، ولا هي تَرَكَتْها تَأْكُلُ مِن خَشاشِ الأرْضِ"',
            source: "صحيح البخاري 3482",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "بَيْنما رَجُلٌ يَمْشِي، فاشْتَدَّ عليه العَطَشُ، فَنَزَلَ بئْرًا، فَشَرِبَ مِنْها، ثُمَّ خَرَجَ فإذا هو بكَلْبٍ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ العَطَشِ، فقالَ: لقَدْ بَلَغَ هذا مِثْلُ الذي بَلَغَ بي، فَمَلَأَ خُفَّهُ، ثُمَّ أمْسَكَهُ بفِيهِ، ثُمَّ رَقِيَ، فَسَقَى الكَلْبَ، فَشَكَرَ اللَّهُ له، فَغَفَرَ له"، قالوا: يا رَسولَ الله، وإنَّ لنا في البَهائِمِ أجْرًا؟ قالَ: "في كُلِّ كَبِدٍ رَطْبَةٍ أجْرٌ"',
            source: "صحيح البخاري 2363",
          },
        ]
      },
      {
        id: 4,
        title: "عدم بيع وشراء القطط والكلاب إلا كلاب الصيد",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "أن رسولَ اللهِ صلى الله عليه وسلم نهى عن ثمنِ السِّنَّوْرِ ، والكلبِ ، إلا كلبَ صيدٍ."',
            source: "صحيح النسائي 4306",
          },
        ],
      },
      {
        id: 5,
        title: "إطعام وسقي الحيوانات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "بَيْنما رَجُلٌ يَمْشِي، فاشْتَدَّ عليه العَطَشُ، فَنَزَلَ بئْرًا، فَشَرِبَ مِنْها، ثُمَّ خَرَجَ فإذا هو بكَلْبٍ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ العَطَشِ، فقالَ: لقَدْ بَلَغَ هذا مِثْلُ الذي بَلَغَ بي، فَمَلَأَ خُفَّهُ، ثُمَّ أمْسَكَهُ بفِيهِ، ثُمَّ رَقِيَ، فَسَقَى الكَلْبَ، فَشَكَرَ اللَّهُ له، فَغَفَرَ له"، قالوا: يا رَسولَ الله، وإنَّ لنا في البَهائِمِ أجْرًا؟ قالَ: "في كُلِّ كَبِدٍ رَطْبَةٍ أجْرٌ"',
            source: "صحيح البخاري 2363",
          },
        ],
      },
      {
        id: 6,
        title: "عدم قتل النملة والنحلة والهدهد والصرد",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: "إنَّ النبيَّ صلَّى اللهُ عليهِ وسلَّمَ نهى عن قتلِ أربعٍ من الدوابِّ ؛ النملةِ، والنحلةِ، والهدهدِ، والصّردِ"',
            source: "صحيح أبي داود 5267",
          },
        ],
      },
      {
        id: 7,
        title: "الحث على تربية واقتناء الغنم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر وأبي هريرة رضي الله عنهما قالا: قال رسول الله صلى الله عليه وسلم: "عليكم بالغَنمِ ، فإنَّها من دوابِّ الجنةِ ، وصَلُّوا في مُراحِها ، وامسحُوا رِغامَها"',
            source: "صحيح الجامع 4073",
          },
        ],
      },
      {
        id: 8,
        title: "الصلاة في أماكن تجمع الغنم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر وأبي هريرة رضي الله عنهما قالا: قال رسول الله صلى الله عليه وسلم: "عليكم بالغَنمِ ، فإنَّها من دوابِّ الجنةِ ، وصَلُّوا في مُراحِها ، وامسحُوا رِغامَها"',
            source: "صحيح الجامع 4073",
          },
        ],
      },
      {
        id: 9,
        title: "مسح التراب عن الغنم ورعايتها",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر وأبي هريرة رضي الله عنهما قالا: قال رسول الله صلى الله عليه وسلم: "عليكم بالغَنمِ ، فإنَّها من دوابِّ الجنةِ ، وصَلُّوا في مُراحِها ، وامسحُوا رِغامَها"',
            source: "صحيح الجامع 4073",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 31,
    title: "سنن عن الجنازة",
    sunan: [
      {
        id: 1,
        title: "اتباع الجنائز",
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: نَهانا النَّبيُّ صلَّى اللهُ عليه وسلَّم عن سَبْعٍ: "نَهانا عن خاتَمِ الذَّهَبِ -أوْ قالَ: حَلْقَةِ الذَّهَبِ- وعَنِ الحَرِيرِ، والإِسْتَبْرَقِ، والدِّيباجِ، والمِيثَرَةِ الحَمْراءِ، والقَسِّيِّ، وآنِيَةِ الفِضَّةِ. وأَمَرَنا بسَبْعٍ: بعِيادَةِ المَرِيضِ، واتِّباعِ الجَنائِزِ، وتَشْمِيتِ العاطِسِ، ورَدِّ السَّلامِ، وإجابَةِ الدَّاعِي، وإبْرارِ المُقْسِمِ، ونَصْرِ المَظْلُومِ"',
            source: "صحيح البخاري 5863",
          },
        ]
      },
      {
        id: 2,
        title: "زيارة القبور",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كنتُ نهيتُكم عن زيارَةِ القبورِ ألا فزورُوها ، فإِنَّها تُرِقُّ القلْبَ ، و تُدْمِعُ العينَ ، وتُذَكِّرُ الآخرةَ ، ولا تقولوا هُجْرًا"',
            source: "صحيح الجامع 4584"
          },
        ],
      },
      {
        id: 3,
        title: "صلاة الجنازة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن شَهِدَ الجَنازَةَ حتَّى يُصَلِّيَ، فَلَهُ قِيراطٌ، ومَن شَهِدَ حتَّى تُدْفَنَ كانَ له قِيراطانِ"، قيلَ: وما القِيراطانِ؟ قالَ: "مِثْلُ الجَبَلَيْنِ العَظِيمَيْنِ"',
            source: "صحيح البخاري 1325",
          },
        ],
      },
      {
        id: 4,
        title: "عدم إتخاذ القبور مساجد",
        ahadith: [
          {
            id: 1,
            title: 'عن جندب بن عبد الله رضي الله عنه قال: سَمِعْتُ النبيَّ صَلَّى الله عليه وسلَّمَ قَبْلَ أنْ يَمُوتَ بخَمْسٍ، وهو يقولُ: "إنِّي أبْرَأُ إلى اللهِ أنْ يَكونَ لي مِنكُم خَلِيلٌ، فإنَّ اللهِ تَعَالَى قَدِ اتَّخَذَنِي خَلِيلًا، كما اتَّخَذَ إبْرَاهِيمَ خَلِيلًا، ولو كُنْتُ مُتَّخِذًا مِن أُمَّتي خَلِيلًا لَاتَّخَذْتُ أبَا بَكْرٍ خَلِيلًا، ألَا وإنَّ مَن كانَ قَبْلَكُمْ كَانُوا يَتَّخِذُونَ قُبُورَ أنْبِيَائِهِمْ وصَالِحِيهِمْ مَسَاجِدَ، ألَا فلا تَتَّخِذُوا القُبُورَ مَسَاجِدَ، إنِّي أنْهَاكُمْ عن ذلكَ"',
            source: "صحيح مسلم 532",
          },
        ],
      },
      {
        id: 5,
        title: "عدم الجلوس على القبر",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "نَهَى رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ أَنْ يُجَصَّصَ القَبْرُ، وَأَنْ يُقْعَدَ عليه، وَأَنْ يُبْنَى عليه"',
            source: "صحيح مسلم 970",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لأَنْ يَجْلِسَ أحَدُكُمْ علَى جَمْرَةٍ فَتُحْرِقَ ثِيابَهُ، فَتَخْلُصَ إلى جِلْدِهِ، خَيْرٌ له مِن أنْ يَجْلِسَ علَى قَبْرٍ"',
            source: "صحيح مسلم 971",
          },
        ],
      },
      {
        id: 6,
        title: "عدم البناء على القبر",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "نَهَى رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ أَنْ يُجَصَّصَ القَبْرُ، وَأَنْ يُقْعَدَ عليه، وَأَنْ يُبْنَى عليه"',
            source: "صحيح مسلم 970",
          },
        ],
      },
      {
        id: 7,
        title: "عدم بناء القبر بالجص والجبس",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: "نَهَى رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ أَنْ يُجَصَّصَ القَبْرُ، وَأَنْ يُقْعَدَ عليه، وَأَنْ يُبْنَى عليه"',
            source: "صحيح مسلم 970",
          },
        ],
      },
      {
        id: 8,
        title: "تكفين الموتى في اللباس الأبيض",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "البِسوا من ثيابِكُمُ البياضَ فإنَّها مِن خيرِ ثيابِكُم، وَكَفِّنوا فيها موتاكم"',
            source: "صحيح أبي داود 3878",
          },
        ],
      },
      {
        id: 9,
        title: "الصبر والإحتساب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يقولُ اللَّهُ تَعالَى: ما لِعَبْدِي المُؤْمِنِ عِندِي جَزاءٌ، إذا قَبَضْتُ صَفِيَّهُ مِن أهْلِ الدُّنْيا ثُمَّ احْتَسَبَهُ، إلَّا الجَنَّةُ"',
            source: "صحيح البخاري 6424",
          },
          {
            id: 2,
            title: 'عن ثابِتٌ البُنانيُّ رضي الله عنه قال: سَمِعْتُ أنَسَ بنَ مَالِكٍ يقولُ لِامْرَأَةٍ مِن أهْلِهِ: تَعْرِفِينَ فُلَانَةَ؟ قالَتْ: نَعَمْ، قالَ: فإنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ مَرَّ بهَا وهي تَبْكِي عِنْدَ قَبْرٍ، فَقالَ: "اتَّقِي اللَّهَ، واصْبِرِي"، فَقالَتْ: إلَيْكَ عَنِّي، فإنَّكَ خِلْوٌ مِن مُصِيبَتِي، قالَ: فَجَاوَزَهَا ومَضَى، فَمَرَّ بهَا رَجُلٌ فَقالَ: ما قالَ لَكِ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ؟ قالَتْ: ما عَرَفْتُهُ؟ قالَ: إنَّه لَرَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، قالَ: فَجَاءَتْ إلى بَابِهِ فَلَمْ تَجِدْ عليه بَوَّابًا، فَقالَتْ: يا رَسولَ الله، والله ما عَرَفْتُكَ، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: "إنَّ الصَّبْرَ عِنْدَ أوَّلِ صَدْمَةٍ"',
            source: "صحيح البخاري 7154",
          },
        ],
      },
      {
        id: 10,
        title: "تغميض عين الميت",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: "دَخَلَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ علَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ، فأغْمَضَهُ، ثُمَّ قالَ: إنَّ الرُّوحَ إذَا قُبِضَ تَبِعَهُ البَصَرُ"، فَضَجَّ نَاسٌ مِن أَهْلِهِ، فَقالَ: "لا تَدْعُوا علَى أَنْفُسِكُمْ إلَّا بخَيْرٍ؛ فإنَّ المَلَائِكَةَ يُؤَمِّنُونَ علَى ما تَقُولونَ"، ثُمَّ قالَ: "اللَّهُمَّ اغْفِرْ لأَبِي سَلَمَةَ، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّينَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِينَ، وَاغْفِرْ لَنَا وَلَهُ يا رَبَّ العَالَمِينَ، وَافْسَحْ له في قَبْرِهِ، وَنَوِّرْ له فِيهِ". [وفي رواية]: "نَحْوَهُ"، غيرَ أنَّهُ قالَ: "وَاخْلُفْهُ في تَرِكَتِهِ"، وَقالَ: "اللَّهُمَّ أَوْسِعْ له في قَبْرِهِ"، وَلَمْ يَقُلْ: "افْسَحْ له"',
            source: "صحيح مسلم 920",
          },
        ],
      },
      {
        id: 11,
        title: "الحمد والإسترجاع",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا ماتَ ولَدُ العبدِ قالَ اللَّهُ لملائِكتِهِ قبضتم ولدَ عبدي فيقولونَ نعم فيقولُ قبضتُم ثمرةَ فؤادِهِ فيقولونَ نعم فيقولُ ماذا قالَ عبدي فيقولونَ حمِدَكَ واسترجعَ فيقولُ الله ابنوا لعبدي بيتًا في الجنَّةِ وسمُّوهُ بيتَ الحمْدِ"',
            source: "صحيح الترمذي 1021",
          },
          {
            id: 2,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما مِن مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ، فيَقولُ ما أمَرَهُ الله: {إِنَّا لله وَإِنَّا إِلَيْهِ رَاجِعُونَ} [البقرة: 156]، اللَّهُمَّ أْجُرْنِي في مُصِيبَتِي، وأَخْلِفْ لي خَيْرًا مِنْها، إلَّا أخْلَفَ الله له خَيْرًا مِنْها"، قالَتْ: فَلَمَّا ماتَ أبو سَلَمَةَ، قُلتُ: أيُّ المُسْلِمِينَ خَيْرٌ مِن أبِي سَلَمَةَ؟ أوَّلُ بَيْتٍ هاجَرَ إلى رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، ثُمَّ إنِّي قُلتُها، فأخْلَفَ الله لي رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ، قالَتْ: أرْسَلَ إلَيَّ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ حاطِبَ بنَ أبِي بَلْتَعَةَ يَخْطُبُنِي له، فَقُلتُ: إنَّ لي بنْتًا، وأنا غَيُورٌ، فقالَ: أمَّا ابْنَتُها فَنَدْعُو اللَّهَ أنْ يُغْنِيَها عَنْها، وأَدْعُو اللَّهَ أنْ يَذْهَبَ بالغَيْرَةِ',
            source: "صحيح مسلم 918",
          }
        ],
      },
      {
        id: 12,
        title: "الدعاء للميت بالخير",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إذا حَضَرْتُمُ المَرِيضَ، أوِ المَيِّتَ، فَقُولوا خَيْرًا؛ فإنَّ المَلائِكَةَ يُؤَمِّنُونَ علَى ما تَقُولونَ"، قالَتْ: فَلَمَّا ماتَ أبو سَلَمَةَ أتَيْتُ النَّبيَّ صَلَّى الله عليه وسلَّمَ، فَقُلتُ: يا رَسولَ اللهِ، إنَّ أبا سَلَمَةَ قدْ ماتَ، قالَ: قُولِي: "اللَّهُمَّ اغْفِرْ لي ولَهُ، وأَعْقِبْنِي منه عُقْبَى حَسَنَةً"، قالَتْ: فَقُلتُ، فأعْقَبَنِي الله مَن هو خَيْرٌ لي منه؛ مُحَمَّدًا صَلَّى الله عليه وسلَّمَ.',
            source: "صحيح مسلم 919",
          },
        ],
      },
      {
        id: 13,
        title: "عدم النياح على الميت",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ثلاثةٌ من الكُفرِ باللهِ : شَقُّ الجيبِ ، والنِّياحةُ ، والطَّعنُ في النَّسَبِ."',
            source: "صحيح الترغيب 3525",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اثنتانِ في الناسِ هما بهم كفرٌ : الطعنُ في الأنسابِ ، و النِّياحةُ على الميِّتِ"',
            source: "الجامع الصغير 164",
          },
          {
            id: 3,
            title: 'عن أم عطية نسيبة بنت كعب رضي الله عنها قالت: بَايَعْنَا النبيَّ صَلَّى اللهُ عليه وسلَّمَ، فَقَرَأَ عَلَيْنَا: "{أَنْ لا يُشْرِكْنَ باللَّهِ شيئًا} [الممتحنة: 12]، ونَهَانَا عَنِ النِّيَاحَةِ"، فَقَبَضَتِ امْرَأَةٌ مِنَّا يَدَهَا، فَقالَتْ: فُلَانَةُ أسْعَدَتْنِي، وأَنَا أُرِيدُ أنْ أجْزِيَهَا، فَلَمْ يَقُلْ شيئًا، فَذَهَبَتْ ثُمَّ رَجَعَتْ، فَما وفَتِ امْرَأَةٌ إلَّا أُمُّ سُلَيْمٍ، وأُمُّ العَلَاءِ، وابْنَةُ أبِي سَبْرَةَ، امْرَأَةُ مُعَاذٍ، أوِ ابْنَةُ أبِي سَبْرَةَ، وامْرَأَةُ مُعَاذٍ.',
            source: "صحيح البخاري 7215",
          },
          {
            id: 4,
            title: 'عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَرْبَعٌ في أُمَّتي مِن أمْرِ الجاهِلِيَّةِ لا يَتْرُكُونَهُنَّ: الفَخْرُ في الأحْسابِ، والطَّعْنُ في الأنْسابِ، والاسْتِسْقاءُ بالنُّجُومِ، والنِّياحَةُ". وقالَ: "النَّائِحَةُ إذا لَمْ تَتُبْ قَبْلَ مَوْتِها، تُقامُ يَومَ القِيامَةِ وعليها سِرْبالٌ مِن قَطِرانٍ، ودِرْعٌ مِن جَرَبٍ."',
            source: "صحيح مسلم 934",
          },
        ],
      },
      {
        id: 14,
        title: "عدم تمزيق الثياب عند الموت",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي بُرْدةَ رضي الله عنه قال: وَجِعَ أَبُو مُوسَى وجَعًا شَدِيدًا، فَغُشِيَ عليه ورَأْسُهُ في حَجْرِ امْرَأَةٍ مِن أَهْلِهِ، فَلَمْ يَسْتَطِعْ أَنْ يَرُدَّ عَلَيْهَا شيئًا، فَلَمَّا أَفَاقَ، قالَ: أَنَا بَرِيءٌ مِمَّنْ بَرِئَ منه رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ، إنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ: "بَرِئَ مِنَ الصَّالِقَةِ والحَالِقَةِ والشَّاقَّةِ"',
            source: "صحيح البخاري 1296",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ مِنَّا مَن لَطَمَ الخُدُودَ، وشَقَّ الجُيُوبَ، ودَعَا بدَعْوَى الجَاهِلِيَّةِ."',
            source: "صحيح البخاري 1294",
          },
        ],
      },
      {
        id: 15,
        title: "عدم ضرب الوجه باليد عند الموت",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ مِنَّا مَن لَطَمَ الخُدُودَ، وشَقَّ الجُيُوبَ، ودَعَا بدَعْوَى الجَاهِلِيَّةِ."',
            source: "صحيح البخاري 1294",
          },
        ],
      },
      {
        id: 16,
        title: "تكثير الصفوف في الجنازة",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "ما مِن مَيِّتٍ تُصَلِّي عليه أُمَّةٌ مِنَ المُسْلِمِينَ يَبْلُغُونَ مِائَةً، كُلُّهُمْ يَشْفَعُونَ له؛ إلَّا شُفِّعُوا فِيهِ."',
            source: "صحيح مسلم 947",
          },
        ],
      },
      {
        id: 17,
        title: "عدم اتباع النساء الجنائز",
        ahadith: [
          {
            id: 1,
            title: 'عن أم عطية نسيبة بنت كعب رضي الله عنها قالت: "نُهِينَا عَنِ اتِّبَاعِ الجَنَائِزِ، ولَمْ يُعْزَمْ عَلَيْنَا."',
            source: "صحيح البخاري 1278",
          },
        ],
      },
      {
        id: 18,
        title: "تعجيل قضاء الدين عن الميت",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نفسُ المؤمنِ معلَّقةٌ بِدَينِه حتَّى يُقضَى عنهُ"',
            source: "صحيح الترمذي 1078",
          },
        ],
      },
      {
        id: 19,
        title: "عدم سب الأموات",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "لا تَسُبُّوا الأمْوَاتَ، فإنَّهُمْ قدْ أفْضَوْا إلى ما قَدَّمُوا."',
            source: "صحيح البخاري 1393",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 32,
    title: "سنن عن الحج",
    sunan: [
      {
        id: 1,
        title: "الرَّمَل في الطواف",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "كانَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ إذَا طَافَ الطَّوَافَ الأوَّلَ خَبَّ ثَلَاثًا ومَشَى أَرْبَعًا، وكانَ يَسْعَى بَطْنَ المَسِيلِ إذَا طَافَ بيْنَ الصَّفَا والمَرْوَةِ، فَقُلتُ لِنَافِعٍ: أَكانَ عبدُ الله يَمْشِي إذَا بَلَغَ الرُّكْنَ اليَمَانِيَ؟ قالَ: لَا، إلَّا أَنْ يُزَاحَمَ علَى الرُّكْنِ، فإنَّه كانَ لا يَدَعُهُ حتَّى يَسْتَلِمَهُ"',
            source: "صحيح البخاري 1644",
          },
        ]
      },
    ],
  },
  //done sourced
  {
    id: 33,
    title: "سنن صلة الرحم والزيارة",
    sunan: [
      {
        id: 1,
        title: "صلة الرحم",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "الرَّحِمُ شِجْنَةٌ، فمَن وصَلَها وصَلْتُهُ، ومَن قَطَعَها قَطَعْتُهُ"',
            source: "صحيح البخاري 5989",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيَصِلْ رَحِمَهُ، ومَن كانَ يُؤْمِنُ بالله واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ"',
            source: "صحيح البخاري 6138",
          },
          {
            id: 3,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليس الواصلُ بالمكافِيءِ ولكنَّ الواصِلَ الذي إذا انقطعتْ رحمُه وصلَها"',
            source: "صحيح الجامع 5385",
          },
        ],
      },
      {
        id: 2,
        title: "التزاور في الله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنَّ رَجُلًا زارَ أخًا له في قَرْيَةٍ أُخْرَى، فأرْصَدَ الله له علَى مَدْرَجَتِهِ مَلَكًا، فَلَمَّا أتَى عليه، قالَ: أيْنَ تُرِيدُ؟ قالَ: أُرِيدُ أخًا لي في هذِه القَرْيَةِ، قالَ: هلْ لكَ عليه مِن نِعْمَةٍ تَرُبُّها؟ قالَ: لا، غيرَ أنِّي أحْبَبْتُهُ في اللهِ عزَّ وجلَّ، قالَ: فإنِّي رَسولُ اللهِ إلَيْكَ بأنَّ اللَّهَ قدْ أحَبَّكَ كما أحْبَبْتَهُ فِيهِ"',
            source: "صحيح مسلم 2567",
          },
        ],
      },
      {
        id: 3,
        title: "الإستئذان قبل الدخول ثلاثا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الاستئذانُ ثَلاثٌ ، فإن أذنَ لَكَ وإلَّا فارجِعْ"',
            source: "صحيح الترمذي 2690",
          },
        ],
      },
      {
        id: 4,
        title: "الوقوف عن يمين الباب أو شماله",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن بسر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تأْتوا البيوتَ من أبوابها ، ولكن ائْتوها من جوانبِها ، فاستأذِنوا فإن أُذِنَ لكم فادْخلوا ، وإلا فارْجِعوا"',
            source: "صحيح الترغيب 2731",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 34,
    title: "سنن الفطرة والنظافة",
    sunan: [
      {
        id: 1,
        title: "الختان",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
        ],
      },
      {
        id: 2,
        title: "الاستحداد (حلق شعر العانة)",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 3,
        title: "نتف الإبط",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 4,
        title: "تقليم الأظافر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 5,
        title: "قص الشارب",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الفِطْرَةُ خَمْسٌ -أَوْ خَمْسٌ مِنَ الفِطْرَةِ-: الخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإبْطِ، وَتَقْلِيمُ الأظْفَارِ، وَقَصُّ الشَّارِبِ"',
            source: "صحيح البخاري 5889",
          },
          {
            id: 2,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
          {
            id: 3,
            title: 'عن عبد الله ابنِ عُمرَ رَضِيَ اللهُ عنهما أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "خَالِفُوا المُشْرِكِينَ؛ وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ". وَكانَ ابنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ علَى لِحْيَتِهِ، فَما فَضَلَ أَخَذَهُ',
            source: "صحيح البخاري 5892",
          },
        ],
      },
      {
        id: 6,
        title: "عدم القزع (حلق بعض الرأس وترك بعض)",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "سَمِعْتُ رَسولَ الله صلَّى اللهُ عليه وسلَّم يَنْهَى عَنِ القَزَعِ. قالَ عُبَيْدُ الله: قُلتُ: وما القَزَعُ؟ فأشَارَ لَنَا عُبَيْدُ الله قالَ: إذَا حَلَقَ الصَّبِيَّ، وتَرَكَ هَاهُنَا شَعَرَةً، وهَاهُنَا وهَاهُنَا، فأشَارَ لَنَا عُبَيْدُ الله إلى نَاصِيَتِهِ وجَانِبَيْ رَأْسِهِ. قيلَ لِعُبَيْدِ الله: فَالْجَارِيَةُ والغُلَامُ؟ قالَ: لا أدْرِي، هَكَذَا قالَ: الصَّبِيُّ. قالَ عُبَيْدُ الله: وعَاوَدْتُهُ، فَقالَ: أمَّا القُصَّةُ والقَفَا لِلْغُلَامِ فلا بَأْسَ بهِمَا، ولَكِنَّ القَزَعَ أنْ يُتْرَكَ بنَاصِيَتِهِ شَعَرٌ، وليسَ في رَأْسِهِ غَيْرُهُ، وكَذلكَ شِقُّ رَأْسِهِ هذا وهذا"',
            source: "صحيح البخاري 5920",
          },
          {
            id: 2,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "أنَّ النبيَّ صلى الله عليه وسلم رأى صبيًا حلق بعضَ رأسِه وترك بعضًا فنهى عن ذلك وقال احلقوه كلَّهُ أو اتركوه كلَّهُ"',
            source: "صحيح البخاري 1644",
          },
        ],
      },
      {
        id: 7,
        title: "إعفاء اللحية",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
          {
            id: 2,
            title: 'عن عبد الله ابنِ عُمرَ رَضِيَ اللهُ عنهما أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم قال: "خَالِفُوا المُشْرِكِينَ؛ وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ". وَكانَ ابنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ علَى لِحْيَتِهِ، فَما فَضَلَ أَخَذَهُ',
            source: "صحيح البخاري 5892",
          },
        ],
      },
      {
        id: 8,
        title: "السِّواكُ",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 9,
        title: "غَسْلُ البَراجِمِ (مَفاصِلِ الأصابِعِ وعُقَدِها)",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 10,
        title: "إستنشاق الماء",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",          
          },
        ],
      },
      {
        id: 11,
        title: "انتقاص الماء (التَّطهُّرُ بالماءِ بعدَ قَضاءِ الحاجَةِ)",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",
          },
        ],
      },
      {
        id: 12,
        title: "المضمضة",
        ahadith: [
          {
            id: 1,
            title: 'عن عائشةَ أم المؤمنين رَضِيَ اللهُ عنها قالت: قال رسولُ الله صلَّى اللهُ عليه وسلَّم: "عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ"',
            source: "صحيح مسلم 261",
          },
        ],
      },
      {
        id: 13,
        title: "عدم تركها لأكثر من أربعين يوما",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "وُقِّتَ لنا في قَصِّ الشَّارِبِ، وتَقْلِيمِ الأظْفارِ، ونَتْفِ الإبِطِ، وحَلْقِ العانَةِ، أنْ لا نَتْرُكَ أكْثَرَ مِن أرْبَعِينَ لَيْلَةً"',
            source: "صحيح مسلم 258",
          },
        ],
      },
      {
        id: 14,
        title: "الإستحمام مرة في كل سبعة أيام",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "حَقٌّ لله علَى كُلِّ مُسْلِمٍ أنْ يَغْتَسِلَ في كُلِّ سَبْعَةِ أيَّامٍ، يَغْسِلُ رَأْسَهُ وجَسَدَهُ"',
            source: "صحيح مسلم 849",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "نَحْنُ الآخِرُونَ السَّابِقُونَ يَومَ القِيامَةِ، أُوتُوا الكِتابَ مِن قَبْلِنا وأُوتِيناهُ مِن بَعْدِهِمْ، فَهذا اليَوْمُ الذي اخْتَلَفُوا فِيهِ، فَهَدانا اللَّهُ فَغَدًا لِلْيَهُودِ، وبَعْدَ غَدٍ لِلنَّصارَى فَسَكَتَ. ثُمَّ قالَ: حَقٌّ علَى كُلِّ مُسْلِمٍ، أنْ يَغْتَسِلَ في كُلِّ سَبْعَةِ أيَّامٍ يَوْمًا يَغْسِلُ فيه رَأْسَهُ وجَسَدَهُ"',
            source: "صحيح البخاري 896",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 35,
    title: "سنن العلم والتعلم",
    sunan: [
      {
        id: 1,
        title: "طلب العلم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من سلك طريقًا يطلبُ فيه علمًا ، سلك اللهُ به طريقًا من طرقِ الجنةِ ، وإنَّ الملائكةَ لتضعُ أجنحتَها رضًا لطالبِ العِلمِ ، وإنَّ العالِمَ ليستغفرُ له من في السماواتِ ومن في الأرضِ ، والحيتانُ في جوفِ الماءِ ، وإنَّ فضلَ العالمِ على العابدِ كفضلِ القمرِ ليلةَ البدرِ على سائرِ الكواكبِ ، وإنَّ العلماءَ ورثةُ الأنبياءِ ، وإنَّ الأنبياءَ لم يُورِّثُوا دينارًا ولا درهمًا ، ورَّثُوا العِلمَ فمن أخذَه أخذ بحظٍّ وافرٍ"',
            source: "صحيح أبي داود 3641 "
          },
        ],
      },
      {
        id: 2,
        title: "نشر العلم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِنَّ مما يلحَقُ المؤمنَ مِنْ عملِهِ وحسناتِهِ ، بعدَ موتِهِ ، علمًا نشرَهُ ، وولدًا صالحًا تركَهَ ، ومصحفًا ورَّثَهُ ، أوْ مسجِدًا بناهُ ، أوْ بيتًا لابْنِ السبيلِ بناهُ ، أوْ نهرًا أجراهُ ، أوْ صدَقَةً أخرجَها مِنْ مالِهِ في صحَّتِهِ وحياتِهِ ، تلحقُهُ مِنْ بعدِ موتِهِ"',
            source: "صحيح ابن ماجه 200",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 36,
    title: "سنن الأذكار",
    sunan: [
      {
        id: 1,
        title: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير 10 مرات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أيوب الأنصاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قالَ: "لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، عَشْرَ مِرَارٍ كانَ كَمَن أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِن وَلَدِ إسْمَاعِيلَ"',
            source: "صحيح مسلم 2693",
          },
        ],
      },
      {
        id: 2,
        title: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير 100 مرة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَسولَ الله صلَّى اللهُ عليه وسلَّمَ قالَ: مَن قالَ: "لا إلَهَ إلَّا الله، وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ، وهو علَى كُلِّ شَيءٍ قَدِيرٌ، في يَومٍ مِئَةَ مَرَّةٍ؛ كانَتْ له عَدْلَ عَشْرِ رِقابٍ، وكُتِبَتْ له مِئَةُ حَسَنَةٍ، ومُحِيَتْ عنْه مِئَةُ سَيِّئَةٍ، وكانَتْ له حِرْزًا مِنَ الشَّيْطانِ يَومَهُ ذلكَ حتَّى يُمْسِيَ، ولَمْ يَأْتِ أحَدٌ بأَفْضَلَ ممَّا جاءَ به، إلَّا أحَدٌ عَمِلَ أكْثَرَ مِن ذلكَ."',
            source: "صحيح البخاري 3293",
          },
        ],
      },
      {
        id: 3,
        title: "سُبْحانَ الله وبِحَمْدِهِ 100 مرة في اليوم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قال: "سُبْحانَ الله وبِحَمْدِهِ، في يَومٍ مِائَةَ مَرَّةٍ؛ حُطَّتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ"',
            source: "صحيح البخاري 6405",
          },
        ],
      },
      {
        id: 4,
        title: "التسبيح 100 مرة في اليوم",
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: كُنَّا عِنْدَ رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ، فَقالَ: "أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَومٍ أَلْفَ حَسَنَةٍ؟" فَسَأَلَهُ سَائِلٌ مِن جُلَسَائِهِ: كيفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قالَ: "يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ، فيُكْتَبُ له أَلْفُ حَسَنَةٍ، أَوْ يُحَطُّ عنْه أَلْفُ خَطِيئَةٍ"',
            source: "صحيح مسلم 2698",
          },
        ],
      },
      {
        id: 5,
        title: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ 3 مرات",
        ahadith: [
          {
            id: 1,
            title: 'عن جويرية بنت الحارث أم المؤمنين رضي الله عنها قالت: أنَّ النَّبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ مِن عِندِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهي في مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهي جَالِسَةٌ، فَقالَ: ما زِلْتِ علَى الحَالِ الَّتي فَارَقْتُكِ عَلَيْهَا؟ قالَتْ: نَعَمْ، قالَ النَّبيُّ صَلَّى اللَّهُ عليه وَسَلَّمَ: لقَدْ قُلتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لو وُزِنَتْ بما قُلْتِ مُنْذُ اليَومِ لَوَزَنَتْهُنَّ: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ"',
            source: "صحيح مسلم 2726",
          },
        ],
      },
      {
        id: 6,
        title: "سيد الاستغفار",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ. قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ"',
            source: "صحيح البخاري 6306",
          },
        ],
      },
      {
        id: 7,
        title: "لا حول ولا قوة إلا بالله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري عبد الله بن قيس رضي الله عنه قال: لَمَّا غَزَا رَسولُ الله صلَّى اللهُ عليه وسلَّمَ خَيْبَرَ -أوْ قالَ: لَمَّا تَوَجَّهَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ- أشْرَفَ النَّاسُ علَى وادٍ، فَرَفَعُوا أصْوَاتَهُمْ بالتَّكْبِيرِ: الله أكْبَرُ الله أكْبَرُ، لا إلَهَ إلَّا الله، فَقالَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ: "ارْبَعُوا علَى أنْفُسِكُمْ؛ إنَّكُمْ لا تَدْعُونَ أصَمَّ ولَا غَائِبًا؛ إنَّكُمْ تَدْعُونَ سَمِيعًا قَرِيبًا وهو معكُمْ." وأَنَا خَلْفَ دَابَّةِ رَسولِ الله صلَّى اللهُ عليه وسلَّمَ، فَسَمِعَنِي وأَنَا أقُولُ: لا حَوْلَ ولَا قُوَّةَ إلَّا بالله، فَقالَ لِي: "يا عَبْدَ الله بنَ قَيْسٍ." قُلتُ: لَبَّيْكَ يا رَسولَ الله، قالَ: "ألَا أدُلُّكَ علَى كَلِمَةٍ مِن كَنْزٍ مِن كُنُوزِ الجَنَّةِ؟" قُلتُ: بَلَى يا رَسولَ الله، فَدَاكَ أبِي وأُمِّي، قالَ: "لا حَوْلَ ولَا قُوَّةَ إلَّا بالله"',
            source: "صحيح البخاري 4205",
          },
        ],
      },
      {
        id: 8,
        title: "سُبْحانَ الله العَظِيمِ، سُبْحانَ الله وبِحَمْدِهِ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كَلِمَتانِ خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ، حَبِيبَتانِ إلى الرَّحْمَنِ: سُبْحانَ الله العَظِيمِ، سُبْحانَ الله وبِحَمْدِهِ"',
            source: "صحيح البخاري 6406",
          },
        ],
      },
      {
        id: 9,
        title: "سبحان الله والحمد لله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الطُّهُورُ شَطْرُ الإيمانِ، والْحَمْدُ لله تَمْلأُ المِيزانَ، وسُبْحانَ اللهِ والْحَمْدُ لله تَمْلَآنِ -أَوْ تَمْلأُ- ما بيْنَ السَّمَواتِ والأرْضِ، والصَّلاةُ نُورٌ، والصَّدَقَةُ بُرْهانٌ، والصَّبْرُ ضِياءٌ، والْقُرْآنُ حُجَّةٌ لَكَ، أوْ عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبايِعٌ نَفْسَهُ فَمُعْتِقُها، أوْ مُوبِقُها"',
            source: "صحيح مسلم 223",
          },
        ],
      },
      {
        id: 10,
        title: "سبحان الله، الحمد لله، لا إله إلا الله، الله أكبر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لأَنْ أَقُولَ: سُبْحَانَ اللهِ، وَالْحَمْدُ لله، وَلَا إِلَهَ إِلَّا الله، والله أَكْبَرُ؛ أَحَبُّ إِلَيَّ ممَّا طَلَعَتْ عليه الشَّمْسُ"',
            source: "صحيح مسلم 2695",
          },
          {
            id: 2,
            title: 'عن سمرة بن جندب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أَحَبُّ الكَلامِ إلى اللهِ أرْبَعٌ: سُبْحانَ اللهِ، والْحَمْدُ لله، ولا إلَهَ إلَّا الله، والله أكْبَرُ، لا يَضُرُّكَ بأَيِّهِنَّ بَدَأْتَ. ولا تُسَمِّيَنَّ غُلامَكَ يَسارًا، ولا رَباحًا، ولا نَجِيحًا، ولا أفْلَحَ؛ فإنَّكَ تَقُولُ: أثَمَّ هُوَ؟ فلا يَكونُ، فيَقولُ: لا." [قال سَمُرةُ]: إنَّما هُنَّ أرْبَعٌ فلا تَزِيدُنَّ عَلَيَّ',
            source: "صحيح مسلم 2137",
          },
        ],
      },
      {
        id: 11,
        title: "الحَمْدُ لله حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ رَجُلًا جَاءَ فَدَخَلَ الصَّفَّ وَقَدْ حَفَزَهُ النَّفَسُ، فَقالَ: الحَمْدُ لله حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، فَلَمَّا قَضَى رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ صَلَاتَهُ قالَ: أَيُّكُمُ المُتَكَلِّمُ بالكَلِمَاتِ؟ فأرَمَّ القَوْمُ، فَقالَ: أَيُّكُمُ المُتَكَلِّمُ بهَا؟ فإنَّه لَمْ يَقُلْ بَأْسًا فَقالَ رَجُلٌ: جِئْتُ وَقَدْ حَفَزَنِي النَّفَسُ فَقُلتُهَا، فَقالَ: لقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"',
            source: "صحيح مسلم 600",
          },
        ],
      },
      {
        id: 12,
        title: "الله أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لله كَثِيرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَأَصِيلًا",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: بيْنَما نَحْنُ نُصَلِّي مع رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ إذْ قالَ رَجُلٌ مِنَ القَوْمِ: "الله أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لله كَثِيرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَأَصِيلًا"، فَقالَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ: "مِنَ القَائِلُ كَلِمَةَ كَذَا وَكَذَا؟" قالَ رَجُلٌ مَنِ القَوْمِ: أَنَا، يا رَسولَ اللهِ، "قالَ: عَجِبْتُ لَهَا، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ" قالَ ابنُ عُمَرَ: فَما تَرَكْتُهُنَّ مُنْذُ سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ ذلكَ',
            source: "صحيح مسلم 601",
          },
        ],
      },
      {
        id: 13,
        title: "لا إله إلا اللهُ",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أفضلُ الذِّكْرِ : لا إله إلا اللهُ، وأفضلُ الدعاءِ : الحمدُ للهِ"',
            source: "هداية الرواة 2246",
          },
        ],
      },
      {
        id: 14,
        title: "أستغفر الله العظيم وأتوب إليه",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "والله إنِّي لَأَسْتَغْفِرُ اللَّهَ وأَتُوبُ إلَيْهِ في اليَومِ أكْثَرَ مِن سَبْعِينَ مَرَّةً."',
            source: "صحيح البخاري 6307",
          },
        ],
      },
      {
        id: 15,
        title: "ذكر الله دائما",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَثَلُ الذي يَذْكُرُ رَبَّهُ والذي لا يَذْكُرُ رَبَّهُ، مَثَلُ الحَيِّ والمَيِّتِ."',
            source: "صحيح البخاري 6407",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 37,
    title: "سنن الإيمان",
    sunan: [
      {
        id: 1,
        title: "من الإيمان أن يحب المرء لأخيه ما يحب لنفسه",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ"',
            source: "صحيح البخاري 13",
          },
        ],
      },
      {
        id: 2,
        title: "من الإيمان أن يكون الرسول ﷺ أحب الناس إلينا من الناس أجمعين",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَا يُؤْمِنُ أحَدُكُمْ، حتَّى أكُونَ أحَبَّ إلَيْهِ مِن والِدِهِ ووَلَدِهِ والنَّاسِ أجْمَعِينَ"',
            source: "صحيح البخاري 15",
          },
        ],
      },
      {
        id: 3,
        title: "من الإيمان المحبة وافشاء السلام",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَدْخُلُونَ الجَنَّةَ حتَّى تُؤْمِنُوا، ولا تُؤْمِنُوا حتَّى تَحابُّوا، أوَلا أدُلُّكُمْ علَى شيءٍ إذا فَعَلْتُمُوهُ تَحابَبْتُمْ؟ أفْشُوا السَّلامَ بيْنَكُمْ"',
            source: "صحيح مسلم 54",
          },
        ],
      },
      {
        id: 4,
        title: "الحياء من الإيمان",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ مَرَّ علَى رَجُلٍ مِنَ الأنْصَارِ، وهو يَعِظُ أخَاهُ في الحَيَاءِ، فَقالَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ: دَعْهُ فإنَّ الحَيَاءَ مِنَ الإيمَانِ."',
            source: "صحيح البخاري 24",
          },
        ],
      },
      {
        id: 5,
        title: "من الإيمان حسن الخلق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أكْملُ المؤمنينَ إيمانًا أحسنُهُم خلقًا . وخيارُكُم خيارُكُم لنسائِهِم"',
            source: "صحيح الترمذي 1162",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 38,
    title: "أذكار الصباح",
    sunan: [
      {
        id: 1,
        title: "آية الكرسي",
        ahadith: [
          {
            id: 1,
            title: 'عن أُبَيّ بن كعب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يا أبا المُنْذِرِ، أتَدْرِي أيُّ آيَةٍ مِن كِتابِ اللهِ معكَ أعْظَمُ؟" قالَ: قُلتُ: الله ورَسولُهُ أعْلَمُ. قالَ: "يا أبا المُنْذِرِ أتَدْرِي أيُّ آيَةٍ مِن كِتابِ اللهِ معكَ أعْظَمُ؟" قالَ: قُلتُ: "{الله لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ}" [البقرة: 255]. قالَ: فَضَرَبَ في صَدْرِي، وقالَ: "والله لِيَهْنِكَ العِلْمُ أبا المُنْذِرِ"',
            source: "صحيح مسلم 810",
          },
          {
            id: 2,
            title: 'عن أبي أمامة البهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قرأَ آيةَ الكرسيِّ دبُرَ كلِّ صلاةٍ مَكْتوبةٍ ، لم يمنَعهُ مِن دخولِ الجنَّةِ ، إلَّا الموتُ"',
            source: "بلوغ المرام 97",
          },
        ],
      },
      {
        id: 2,
        title: "سورة الإخلاص والمعوذات",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن خبيب رضي الله عنه قال: خرجنا في ليلةِ مَطَرٍ وظُلْمَةٍ شديدةٍ نطلبُ رسولَ اللهِ صلى الله عليه وسلم لِيُصليَ لنا ، فأدركناه ، فقال: "أصليتم ؟" فلم أقلْ شيئًا ، فقال: "قلْ". فلم أقلْ شيئًا ، ثم قال: "قلْ". فلم أقلْ شيئًا ، ثم قال: "قلْ": فقلتُ : يا رسولَ اللهِ، ما أقولُ ؟ قال: "قل هو الله أحد والمُعَوِّذَتين حينَ تُمسي وحينَ تُصبحُ ثلاثَ مراتٍ تُكفيك مِن كلِّ شيءٍ"',
            source: "صحيح أبي داود 5082",
          },
        ],
      },
      {
        id: 3,
        title: "اللَّهمَّ بِكَ أصبَحنا، وبِكَ أمسَينا، وبِكَ نَحيا وبِكَ نَموتُ وإليكَ النُّشورُ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أصبحَ أحدُكُم فليقُلْ : اللَّهمَّ بِكَ أصبَحنا، وبِكَ أمسَينا، وبِكَ نَحيا وبِكَ نَموتُ وإليكَ النُّشورُ، وإذا أمسى فليقُلْ: اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نموتُ ، وإليكَ المصيرُ"',
            source: "الكلم الطيب 20",
          },
        ],
      },
      {
        id: 4,
        title: "اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: كانَ يقولُ إذا صلَّى الصُّبحَ حينَ يسلِّمُ "اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا"',
            source: "صحيح ابن ماجه 762",
          },
        ],
      },
      {
        id: 5,
        title: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ 3 مرات",
        ahadith: [
          {
            id: 1,
            title: 'عن جويرية بنت الحارث أم المؤمنين رضي الله عنها قالت: أنَّ النَّبيَّ صَلَّى اللَّهُ عليه وَسَلَّمَ خَرَجَ مِن عِندِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهي في مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهي جَالِسَةٌ، فَقالَ: ما زِلْتِ علَى الحَالِ الَّتي فَارَقْتُكِ عَلَيْهَا؟ قالَتْ: نَعَمْ، قالَ النَّبيُّ صَلَّى اللَّهُ عليه وَسَلَّمَ: لقَدْ قُلتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ، لو وُزِنَتْ بما قُلْتِ مُنْذُ اليَومِ لَوَزَنَتْهُنَّ: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ"',
            source: "صحيح مسلم 2726",
          },
        ],
      },
      {
        id: 6,
        title: "سيد الاستغفار",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ. قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ"',
            source: "صحيح البخاري 6306",
          },
        ],
      },
      {
        id: 7,
        title: "اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ، اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن أبي بكرة نفيع بن الحارث رضي الله عنه قال: يا أَبتِ، إنِّي أَسمَعُك تَدْعو كلَّ غَداةٍ: "اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ؛ تُعيدُها ثلاثًا حينَ تُصبِحُ، وثَلاثًا حينَ تُمسي؟" فَقال: إنِّي سَمِعتُ رَسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم يَدْعو بِهنَّ، فأَنا أُحِبُّ أن أَستَنَّ بِسُنَّتِه. قال عبَّاسٌ فيهِ: وتَقولُ: "اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ، تُعيدُها ثَلاثًا حينَ تُصبِح، وثَلاثًا حينَ تُمسي"، فتَدْعو بهِنَّ، فأُحِبُّ أن أَستَنَّ بِسُنَّتِه',
            source: "صحيح أبي داود 5090",
          },
        ],
      },
      {
        id: 8,
        title: "أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أمَا إنَّكَ لَوْ قُلتَ حِينَ أمْسيْتَ : أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق ؛ لَمْ تَضُرَّكَ"',
            source: "صحيح الجامع 1318",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: جَاءَ رَجُلٌ إلى النَّبيِّ صَلَّى الله عليه وَسَلَّمَ فَقالَ: يا رَسولَ اللهِ، ما لَقِيتُ مِن عَقْرَبٍ لَدَغَتْنِي البَارِحَةَ، قالَ: "أَمَا لو قُلْتَ حِينَ أَمْسَيْتَ: أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ، لَمْ تَضُرَّكَ." وفي روايةٍ: قالَ رَجُلٌ: يا رَسولَ اللهِ، لَدَغَتْنِي عَقْرَبٌ...',
            source: "صحيح مسلم 2709",
          },
        ],
      },
      {
        id: 9,
        title: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ صلى الله عليه وسلم رسولًا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من قالَ: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ رسولًا، وجَبت لَهُ الجنَّةُ"',
            source: "صحيح أبي داود 1529",
          },
        ],
      },
      {
        id: 10,
        title: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قال: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ . ثلاثُ مراتٍ ، لم تصبْه فجأةُ بلاءٍ حتى يُصبحَ ، ومَن قالها حينَ يُصبحُ ثلاثَ مراتٍ لم تُصبْه فجأةُ بلاءٍ حتى يُمسي"',
            source: "صحيح أبي داود 5088",
          },
        ],
      },
      {
        id: 11,
        title: "يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ أصلِحْ لِي شأنِي كلَّهُ ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما يَمنعُكِ أنْ تسمَعِي ما أُوصِيكِ بهِ ؟ أنْ تقولِي إذا أصبحتِ وإذا أمسيْتِ : يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ ، أصلِحْ لِي شأنِي كلَّهُ ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ"',
            source: "صحيح الجامع 5820",
          },
        ],
      },
      {
        id: 12,
        title: "اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أن أبا بكرٍ الصديقَ رضي الله عنه قال يا رسولَ اللهِ مرني بكلماتٍ أقولُهُن إذا أصبحتُ وإذا أمسيتُ, قال قل: "اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه". قال: "قلْها إذا أصبحتَ, وإذا أمسيتَ، وإذا أخذتَ مضجعَك"',
            source: "صحيح أبي داود 5067",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 39,
    title: "أذكار المساء",
    sunan: [
      {
        id: 1,
        title: "آية الكرسي",
        ahadith: [
          {
            id: 1,
            title: 'عن أُبَيّ بن كعب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "يا أبا المُنْذِرِ، أتَدْرِي أيُّ آيَةٍ مِن كِتابِ اللهِ معكَ أعْظَمُ؟" قالَ: قُلتُ: الله ورَسولُهُ أعْلَمُ. قالَ: "يا أبا المُنْذِرِ أتَدْرِي أيُّ آيَةٍ مِن كِتابِ اللهِ معكَ أعْظَمُ؟" قالَ: قُلتُ: "{الله لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ}" [البقرة: 255]. قالَ: فَضَرَبَ في صَدْرِي، وقالَ: "والله لِيَهْنِكَ العِلْمُ أبا المُنْذِرِ"',
            source: "صحيح مسلم 810",
          },
          {
            id: 2,
            title: 'عن أبي أمامة البهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قرأَ آيةَ الكرسيِّ دبُرَ كلِّ صلاةٍ مَكْتوبةٍ ، لم يمنَعهُ مِن دخولِ الجنَّةِ ، إلَّا الموتُ"',
            source: "بلوغ المرام 97",
          },
        ],
      },
      {
        id: 2,
        title: "سورة الإخلاص والمعوذات",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن خبيب رضي الله عنه قال: خرجنا في ليلةِ مَطَرٍ وظُلْمَةٍ شديدةٍ نطلبُ رسولَ اللهِ صلى الله عليه وسلم لِيُصليَ لنا ، فأدركناه ، فقال: أصليتم ؟ فلم أقلْ شيئًا ، فقال: قلْ. فلم أقلْ شيئًا ، "ثم قال: قلْ. فلم أقلْ شيئًا ، ثم قال: قلْ: فقلتُ : يا رسولَ اللهِ، ما أقولُ ؟ قال: "قل هو الله أحد والمُعَوِّذَتين حينَ تُمسي وحينَ تُصبحُ ثلاثَ مراتٍ تُكفيك مِن كلِّ شيءٍ"',
            source: "صحيح أبي داود 5082",
          },
        ],
      },
      {
        id: 3,
        title: "اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نَموتُ وإليكَ النُّشورُ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا أصبحَ أحدُكُم فليقُلْ : اللَّهمَّ بِكَ أصبَحنا، وبِكَ أمسَينا، وبِكَ نَحيا وبِكَ نَموتُ وإليكَ النُّشورُ، وإذا أمسى فليقُلْ: اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نموتُ ، وإليكَ المصيرُ"',
            source: "الكلم الطيب 20",
          },
        ],
      },
      {
        id: 4,
        title: "سيد الاستغفار",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ. قالَ: ومَن قالَها مِنَ النَّهارِ مُوقِنًا بها، فَماتَ مِن يَومِهِ قَبْلَ أنْ يُمْسِيَ، فَهو مِن أهْلِ الجَنَّةِ، ومَن قالَها مِنَ اللَّيْلِ وهو مُوقِنٌ بها، فَماتَ قَبْلَ أنْ يُصْبِحَ، فَهو مِن أهْلِ الجَنَّةِ"',
            source: "صحيح البخاري 6306",
          },
        ],
      },
      {
        id: 5,
        title: "أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أمَا إنَّكَ لَوْ قُلتَ حِينَ أمْسيْتَ : أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق ؛ لَمْ تَضُرَّكَ"',
            source: "صحيح الجامع 1318",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: جَاءَ رَجُلٌ إلى النَّبيِّ صَلَّى الله عليه وَسَلَّمَ فَقالَ: يا رَسولَ اللهِ، ما لَقِيتُ مِن عَقْرَبٍ لَدَغَتْنِي البَارِحَةَ، قالَ: "أَمَا لو قُلْتَ حِينَ أَمْسَيْتَ: أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ مِن شَرِّ ما خَلَقَ، لَمْ تَضُرَّكَ." وفي روايةٍ: قالَ رَجُلٌ: يا رَسولَ اللهِ، لَدَغَتْنِي عَقْرَبٌ...',
            source: "صحيح مسلم 2709",
          },
        ],
      },
      {
        id: 6,
        title: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ صلى الله عليه وسلم رسولًا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من قالَ: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ رسولًا، وجَبت لَهُ الجنَّةُ"',
            source: "صحيح أبي داود 1529",
          },
        ],
      },
      {
        id: 7,
        title: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: مَن قال: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ . ثلاثُ مراتٍ ، لم تصبْه فجأةُ بلاءٍ حتى يُصبحَ ، ومَن قالها حينَ يُصبحُ ثلاثَ مراتٍ لم تُصبْه فجأةُ بلاءٍ حتى يُمسي"',
            source: "صحيح أبي داود 5088",
          },
        ],
      },
      {
        id: 8,
        title: "يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ أصلِحْ لِي شأنِي كلَّهُ ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ما يَمنعُكِ أنْ تسمَعِي ما أُوصِيكِ بهِ ؟ أنْ تقولِي إذا أصبحتِ وإذا أمسيْتِ : يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ ، أصلِحْ لِي شأنِي كلَّهُ ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ"',
            source: "صحيح الجامع 5820",
          },
        ],
      },
      {
        id: 12,
        title: "اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أن أبا بكرٍ الصديقَ رضي الله عنه قال يا رسولَ اللهِ مرني بكلماتٍ أقولُهُن إذا أصبحتُ وإذا أمسيتُ, قال قل: "اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه". قال: "قلْها إذا أصبحتَ, وإذا أمسيتَ، وإذا أخذتَ مضجعَك"',
            source: "صحيح أبي داود 5067",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 40,
    title: "سنن النهي عن الكبائر",
    sunan: [
      {
        id: 1,
        title: "اجتناب السبع الموبقات (الذُّنوبُ المهلِكاتُ)",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 2,
        title: "اجتناب الشرك",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: أَتَى النبيَّ صَلَّى الله عليه وسلَّمَ رَجُلٌ فقالَ: يا رَسولَ اللهِ، ما المُوجِبَتانِ؟ "فقالَ: مَن ماتَ لا يُشْرِكُ باللَّهِ شيئًا دَخَلَ الجَنَّةَ، ومَن ماتَ يُشْرِكُ باللَّهِ شيئًا دَخَلَ النَّارَ"',
            source: "صحيح مسلم 93",
          },
          {
            id: 3,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: جاءَ أعْرابِيٌّ إلى النَّبيِّ صَلَّى اللهُ عليه وسلَّمَ، فقالَ: يا رَسولَ الله، ما الكَبائِرُ؟ "قالَ: الإشْراكُ بالله." قالَ: ثُمَّ ماذا؟ "قالَ: ثُمَّ عُقُوقُ الوالِدَيْنِ." قالَ: ثُمَّ ماذا؟ "قالَ: اليَمِينُ الغَمُوسُ." قُلتُ: وما اليَمِينُ الغَمُوسُ؟ "قالَ: الذي يَقْتَطِعُ مالَ امْرِئٍ مُسْلِمٍ هو فيها كاذِبٌ"',
            source: "صحيح البخاري 6920",
          },
        ],
      },
      {
        id: 3,
        title: "اجتناب السحر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 4,
        title: "اجتناب القتل",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 5,
        title: "عدم الربا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
          {
            id: 2,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: "لَعَنَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ آكِلَ الرِّبَا وَمُؤْكِلَهُ." قالَ: قُلتُ: وَكَاتِبَهُ وَشَاهِدَيْهِ؟ قالَ: إنَّما نُحَدِّثُ بما سَمِعْنَا',
            source: "صحيح مسلم 1597",
          },
        ],
      },
      {
        id: 6,
        title: "اجتناب أكل مال اليتيم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 7,
        title: "اجتناب الهروب من ساحة القتال",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 8,
        title: "اجتناب إتهام العفيفات البريئات بالزنا",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اجْتَنِبُوا السَّبْعَ المُوبِقاتِ"، قالوا: يا رَسولَ الله وما هُنَّ؟ "قالَ: الشِّرْكُ بالله، والسِّحْرُ، وقَتْلُ النَّفْسِ الَّتي حَرَّمَ اللَّهُ إلَّا بالحَقِّ، وأَكْلُ الرِّبا، وأَكْلُ مالِ اليَتِيمِ، والتَّوَلِّي يَومَ الزَّحْفِ، وقَذْفُ المُحْصَناتِ المُؤْمِناتِ الغافِلاتِ"',
            source: "صحيح البخاري 2766",
          },
        ],
      },
      {
        id: 9,
        title: "النهي عن عقوق الوالدين",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: جاءَ أعْرابِيٌّ إلى النَّبيِّ صَلَّى اللهُ عليه وسلَّمَ، فقالَ: يا رَسولَ الله، ما الكَبائِرُ؟ "قالَ: الإشْراكُ بالله." قالَ: ثُمَّ ماذا؟ "قالَ: ثُمَّ عُقُوقُ الوالِدَيْنِ." قالَ: ثُمَّ ماذا؟ "قالَ: اليَمِينُ الغَمُوسُ." قُلتُ: وما اليَمِينُ الغَمُوسُ؟ "قالَ: الذي يَقْتَطِعُ مالَ امْرِئٍ مُسْلِمٍ هو فيها كاذِبٌ"',
            source: "صحيح البخاري 6920",
          },
        ],
      },
      {
        id: 10,
        title: "النهي عن اليمين الغموس",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: جاءَ أعْرابِيٌّ إلى النَّبيِّ صَلَّى اللهُ عليه وسلَّمَ، فقالَ: يا رَسولَ الله، ما الكَبائِرُ؟ "قالَ: الإشْراكُ بالله." قالَ: ثُمَّ ماذا؟ "قالَ: ثُمَّ عُقُوقُ الوالِدَيْنِ." قالَ: ثُمَّ ماذا؟ "قالَ: اليَمِينُ الغَمُوسُ." قُلتُ: وما اليَمِينُ الغَمُوسُ؟ "قالَ: الذي يَقْتَطِعُ مالَ امْرِئٍ مُسْلِمٍ هو فيها كاذِبٌ"',
            source: "صحيح البخاري 6920",
          },
        ],
      },
      {
        id: 11,
        title: "عدم الزنة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال:  "سُئِلَ رسولُ الله صلَّى الله علَيهِ وسلَّمَ عن أَكْثرِ ما يُدخلُ النَّاسَ الجنَّةَ ؟ فقالَ: تَقوى الله وحُسنُ الخلُقِ ، وسُئِلَ عن أَكْثرِ ما يُدخِلُ النَّاسَ النَّارَ ، قالَ: الفَمُ والفَرجُ"',
            source: "صحيح الترمذي 2004",
          },
        ],
      },
      {
        id: 12,
        title: "النهي عن التمائم",
        ahadith: [
          {
            id: 1,
            title: 'عن عقبة بن عامر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من علَّق تميمةً فقد أشركَ"',
            source: "صحيح الجامع 6394",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 41,
    title: "سنن النهي عن الأعمال السيئة",
    sunan: [
      {
        id: 1,
        title: "عدم التشبه بالجنس الآخر",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: "لَعَنَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ"',
            source: "صحيح البخاري 5885",
          },
        ],
      },
      {
        id: 2,
        title: "عدم المجاهرة بالمعاصي",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كُلُّ أُمَّتي مُعافًى إلَّا المُجاهِرِينَ، وإنَّ مِنَ المُجاهَرَةِ أنْ يَعْمَلَ الرَّجُلُ باللَّيْلِ عَمَلًا، ثُمَّ يُصْبِحَ وقدْ سَتَرَهُ اللَّهُ عليه، فَيَقُولَ: يا فُلانُ، عَمِلْتُ البارِحَةَ كَذا وكَذا، وقدْ باتَ يَسْتُرُهُ رَبُّهُ، ويُصْبِحُ يَكْشِفُ سِتْرَ اللَّهِ عنْه"',
            source: "صحيح البخاري 6069",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كُلُّ أُمَّتي مُعافاةٌ، إلَّا المُجاهِرِينَ، وإنَّ مِنَ الإجْهارِ أنْ يَعْمَلَ العَبْدُ باللَّيْلِ عَمَلًا، ثُمَّ يُصْبِحُ قدْ سَتَرَهُ رَبُّهُ، فيَقولُ: يا فُلانُ قدْ عَمِلْتُ البارِحَةَ كَذا وكَذا، وقدْ باتَ يَسْتُرُهُ رَبُّهُ، فَيَبِيتُ يَسْتُرُهُ رَبُّهُ، ويُصْبِحُ يَكْشِفُ سِتْرَ اللهِ عنْه."',
            source: "صحيح مسلم 2990",
          },
        ],
      },
      {
        id: 3,
        title: "عدم إخافة وإفزاع وترويع الآخرين",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الرحمن بن أبي ليلى رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يحلُّ لمسلمٍ أن يروِّعَ مسلمًا"',
            source: "صحيح أبي داود 5004",
          },
        ],
      },
      {
        id: 4,
        title: "عدم وصف المرأة غيرها من النساء لزوجها وعدم وصف الرجل غيره من الرجال لزوجته",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تُباشِرِ المَرْأَةُ المَرْأَةَ، فَتَنْعَتَها لِزَوْجِها كَأنَّهُ يَنْظُرُ إلَيْها."',
            source: "صحيح البخاري 5240",
          },
        ],
      },
      {
        id: 5,
        title: "النهي عن الموسيقى",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَيَكونَنَّ مِن أُمَّتي أقْوامٌ يَسْتَحِلُّونَ الحِرَ والحَرِيرَ، والخَمْرَ والمَعازِفَ، ولَيَنْزِلَنَّ أقْوامٌ إلى جَنْبِ عَلَمٍ، يَرُوحُ عليهم بسارِحَةٍ لهمْ، يَأْتِيهِمْ -يَعْنِي الفقِيرَ- لِحاجَةٍ، فيَقولونَ: ارْجِعْ إلَيْنا غَدًا، فيُبَيِّتُهُمُ الله، ويَضَعُ العَلَمَ، ويَمْسَخُ آخَرِينَ قِرَدَةً وخَنازِيرَ إلى يَومِ القِيامَةِ."',
            source: "صحيح البخاري 5590",
          },
        ],
      },
      {
        id: 6,
        title: "عدم استحلال الحرام",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مالك الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَيَكونَنَّ مِن أُمَّتي أقْوامٌ يَسْتَحِلُّونَ الحِرَ والحَرِيرَ، والخَمْرَ والمَعازِفَ، ولَيَنْزِلَنَّ أقْوامٌ إلى جَنْبِ عَلَمٍ، يَرُوحُ عليهم بسارِحَةٍ لهمْ، يَأْتِيهِمْ -يَعْنِي الفقِيرَ- لِحاجَةٍ، فيَقولونَ: ارْجِعْ إلَيْنا غَدًا، فيُبَيِّتُهُمُ الله، ويَضَعُ العَلَمَ، ويَمْسَخُ آخَرِينَ قِرَدَةً وخَنازِيرَ إلى يَومِ القِيامَةِ."',
            source: "صحيح البخاري 5590",
          },
        ],
      },
      {
        id: 7,
        title: "عدم اللعب بالنرد",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن لَعِبَ بالنَّرْدِ فقد عصى اللهَ ورسولَه."',
            source: "صحيح أبي داود 4938",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 24,
    title: "سنن النهي عن الأخلاق الذميمة",
    sunan2: [
      {
        id: 1,
        title: "عدم الغضب",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَجُلًا قالَ للنَّبيِّ صلَّى اللهُ عليه وسلَّم: أوْصِنِي، قالَ: "لا تَغْضَبْ". فَرَدَّدَ مِرَارًا، قالَ: "لا تَغْضَبْ"',
            source: "صحيح البخاري 6116",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ الشَّدِيدُ بالصُّرَعَةِ، إنَّما الشَّدِيدُ الذي يَمْلِكُ نَفْسَهُ عِنْدَ الغَضَبِ"',
            source: "صحيح البخاري 6114",
          },
          {
            id: 3,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنْ كَفَّ غضبَهُ كَفَّ اللهُ عنهُ عذابَهُ ، ومَنْ خزنَ لسانَهُ سترَ اللهُ عَوْرَتَهُ ، ومَنِ اعْتَذَرَ إلى اللهِ قَبِلَ اللهُ عُذْرَهُ"',
            source: "السلسلة الصحيحة 2360",
          },
        ],
      },
      {
        id: 2,
        title: "عدم الكذب",
        ahadith: [
          {
            id: 1,
            title: 'عن معاوية بن حيدة القشيري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ويلٌ للذي يحدِّثُ بالحديثِ ليُضحكَ به القومَ فيكذبُ ويلٌ له ويلٌ له"',
            source: "صحيح الترمذي 2315",
          },
          {
            id: 2,
            title: 'عن أبي أمامة الباهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا زعيمٌ ببيتِ في رَبَضِ الجنةِ لمَن تَرَكَ المِراءَ وإن كان مُحِقًّا ، وببيتِ في وسطِ الجنةِ لمَن تركَ الكذبَ وإن كان مازحًا ، وببيتٍ في أعلى الجنةِ لمَن حَسُنَ خُلُقُه"',
            source: "صحيح أبي داود 4800",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كَفَى بالمَرْءِ كَذِبًا أنْ يُحَدِّثَ بكُلِّ ما سَمِعَ"',
            source: "صحيح مسلم 5",
          },
          {
            id: 4,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
        ],
      },
      {
        id: 3,
        title: "عدم النجش (الزِّيادةُ في ثَمنِ السِّلعةِ ممَّن لا يُريدُ شِراءَها لِيَخدَعَ غيرَه ويَغُرَّه لِيَزيدَ في ثَمنِها ويَشتريَها)",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: "نَهَى النبيُّ صَلَّى اللهُ عليه وسلَّمَ عَنِ النَّجْشِ"',
            source: "صحيح البخاري 2142",
          },
        ],
      },
      {
        id: 4,
        title: "عدم النميمة",
        ahadith: [
          {
            id: 1,
            title: 'عن حذيفة بن اليمان رضي الله عنه أنَّهُ بَلَغَهُ أنَّ رَجُلًا يَنِمُّ الحَدِيثَ فقالَ حُذَيْفَةُ: سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ: "لا يَدْخُلُ الجَنَّةَ نَمَّامٌ."',
            source: "صحيح مسلم 105",
          },
        ],
      },
      {
        id: 5,
        title: "عدم التكبر",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا ، وإنَّ مِن أبغضِكُم إليَّ وأبعدِكُم منِّي يومَ القيامةِ الثَّرثارونَ والمتشدِّقونَ والمتفَيهِقونَ، قالوا: يا رسولَ اللَّهِ، قد علِمنا الثَّرثارينَ والمتشدِّقينَ فما المتفَيهقونَ ؟ قالَ: المتَكَبِّرونَ"',
            source: "صحيح الترمذي 2018",
          },
        ],
      },
      {
        id: 6,
        title: "عدم الثرثرة",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا ، وإنَّ مِن أبغضِكُم إليَّ وأبعدِكُم منِّي يومَ القيامةِ الثَّرثارونَ والمتشدِّقونَ والمتفَيهِقونَ، قالوا: يا رسولَ اللَّهِ، قد علِمنا الثَّرثارينَ والمتشدِّقينَ فما المتفَيهقونَ ؟ قالَ: المتَكَبِّرونَ"',
            source: "صحيح الترمذي 2018",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال:  "سُئِلَ رسولُ الله صلَّى الله علَيهِ وسلَّمَ عن أَكْثرِ ما يُدخلُ النَّاسَ الجنَّةَ ؟ فقالَ: تَقوى الله وحُسنُ الخلُقِ ، وسُئِلَ عن أَكْثرِ ما يُدخِلُ النَّاسَ النَّارَ ، قالَ: الفَمُ والفَرجُ"',
            source: "صحيح الترمذي 2004",
          },
        ],
      },
      {
        id: 8,
        title: "عدم النزاع والمجادلة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي أمامة الباهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا زعيمٌ ببيتِ في رَبَضِ الجنةِ لمَن تَرَكَ المِراءَ وإن كان مُحِقًّا ، وببيتِ في وسطِ الجنةِ لمَن تركَ الكذبَ وإن كان مازحًا ، وببيتٍ في أعلى الجنةِ لمَن حَسُنَ خُلُقُه"',
            source: "صحيح أبي داود 4800",
          },
          {
            id: 2,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "إنَّ أَبْغَضَ الرِّجَالِ إلى الله الألَدُّ الخَصِمُ"',
            source: "صحيح البخاري 2457",
          },
        ],
      },
      {
        id: 9,
        title: "عدم الفضول",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "من حُسنِ إسلامِ المرءِ تركُه ما لا يَعنيهِ"',
            source: "صحيح الترمذي 2317",
          },
        ],
      },
      {
        id: 10,
        title: "عدم الغِيبَةُ",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول اااه صلى الله عليه وسلم: "أَتَدْرُونَ ما الغِيبَةُ؟" قالوا: الله ورَسولُهُ أعْلَمُ، "قالَ: ذِكْرُكَ أخاكَ بما يَكْرَهُ." قيلَ: أفَرَأَيْتَ إنْ كانَ في أخِي ما أقُولُ؟ "قالَ: إنْ كانَ فيه ما تَقُولُ فَقَدِ اغْتَبْتَهُ، وإنْ لَمْ يَكُنْ فيه فقَدْ بَهَتَّهُ"',
            source: "صحيح مسلم 2589",
          },
        ],
      },
      {
        id: 20,
        title: "النهي عن المنكر وتغييره",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: أَوَّلُ مَن بَدَأَ بالخُطْبَةِ يَومَ العِيدِ قَبْلَ الصَّلاةِ مَرْوانُ. فَقامَ إلَيْهِ رَجُلٌ، فقالَ: الصَّلاةُ قَبْلَ الخُطْبَةِ، فقالَ: قدْ تُرِكَ ما هُنالِكَ، فقالَ أبو سَعِيدٍ: أمَّا هذا فقَدْ قَضَى ما عليه سَمِعْتُ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ يقولُ: "مَن رَأَى مِنكُم مُنْكَرًا فَلْيُغَيِّرْهُ بيَدِهِ، فإنْ لَمْ يَسْتَطِعْ فَبِلِسانِهِ، فإنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وذلكَ أضْعَفُ الإيمانِ"',
            source: "صحيح مسلم 49",
          },
        ],
      },
      {
        id: 21,
        title: "عدم الظلم",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ"',
            source: "صحيح البخاري 2442",
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اتَّقُوا الظُّلْمَ، فإنَّ الظُّلْمَ ظُلُماتٌ يَومَ القِيامَةِ، واتَّقُوا الشُّحَّ، فإنَّ الشُّحَّ أهْلَكَ مَن كانَ قَبْلَكُمْ، حَمَلَهُمْ علَى أنْ سَفَكُوا دِماءَهُمْ واسْتَحَلُّوا مَحارِمَهُمْ"',
            source: "صحيح مسلم 2578",
          },
        ],
      },
      {
        id: 22,
        title: "عدم إخلاف الوعود",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
        ],
      },
      {
        id: 23,
        title: "عدم خيانة الأمانة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
        ],
      },
      {
        id: 26,
        title: "النهي عن  قول الزور",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "ذَكَرَ رَسولُ الله صَلَّى اللهُ عليه وسلَّمَ الكَبَائِرَ -أوْ سُئِلَ عَنِ الكَبَائِرِ- فَقالَ: الشِّرْكُ بالله، وقَتْلُ النَّفْسِ، وعُقُوقُ الوَالِدَيْنِ، فَقالَ: ألَا أُنَبِّئُكُمْ بأَكْبَرِ الكَبَائِرِ؟ قالَ: قَوْلُ الزُّورِ -أوْ قالَ: شَهَادَةُ الزُّورِ"، قالَ شُعْبَةُ: وأَكْثَرُ ظَنِّي أنَّه قالَ: "شَهَادَةُ الزُّورِ"',
            source: "صحيح البخاري 5977",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه عَنِ النبيِّ صَلَّى الله عليه وسلَّمَ في الكَبائِرِ، قالَ: "الشِّرْكُ بالله، وعُقُوقُ الوالِدَيْنِ، وقَتْلُ النَّفْسِ، وقَوْلُ الزُّورِ"',
            source: "صحيح مسلم 88",
          }
        ],
      },
    ],
    sunan: [
      { 
        id: 1, 
        title: 'عدم الإساءة',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قالَ رَجُلٌ: يا رَسولَ الله، أنُؤاخَذُ بما عَمِلْنا في الجاهِلِيَّةِ؟ قالَ: "مَن أحْسَنَ في الإسْلامِ لَمْ يُؤاخَذْ بما عَمِلَ في الجاهِلِيَّةِ، ومَن أساءَ في الإسْلامِ أُخِذَ بالأوَّلِ والآخِرِ."',
            source: "صحيح البخاري 6921",
          },
        ],
      },
      { 
        id: 2, 
        title: 'عدم الإسراف والتبذير', 
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كُلوا واشرَبوا وتَصدَّقوا والْبَسوا ما لم يخالِطْهُ إسرافٌ أو مَخيَلةٌ"',
            source: "صحيح ابن ماجه 2920",
          },
        ],
      },
      { 
        id: 3, 
        title: 'عدم الإفتراء والبهتان',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 4, 
        title: 'عدم إفشاء الشر', 
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ مِن أَعْظَمِ الأمَانَةِ عِنْدَ اللهِ يَومَ القِيَامَةِ، الرَّجُلَ يُفْضِي إلى امْرَأَتِهِ، وَتُفْضِي إِلَيْهِ، ثُمَّ يَنْشُرُ سِرَّهَا. وَقالَ ابنُ نُمَيْرٍ: [وفي روايةٍ]: إنَّ أَعْظَمَ"',
            source: "صحيح مسلم 1437",
          },
        ],
      },
      { 
        id: 5, 
        title: 'عدم الإنتقام',
        ahadith: [
          {
            id: 1,
            title: 'عن عائشة أم المؤمنين رضي الله عنها قالت: "ما خُيِّرَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بيْنَ أمْرَيْنِ إلَّا اخْتارَ أيْسَرَهُما ما لَمْ يَأْثَمْ، فإذا كانَ الإثْمُ كانَ أبْعَدَهُما منه، والله ما انْتَقَمَ لِنَفْسِهِ في شيءٍ يُؤْتَى إلَيْهِ قَطُّ، حتَّى تُنْتَهَكَ حُرُماتُ الله، فَيَنْتَقِمُ لله"',
            source: "صحيح البخاري 6786",
          },
        ],
      },
      { 
        id: 6, 
        title: 'عدم البخل والشح',
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: ...فَكُنْتُ أخْدُمُ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ إذَا نَزَلَ، فَكُنْتُ أسْمَعُهُ كَثِيرًا يقولُ: "اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ، وغَلَبَةِ الرِّجَالِ..."',
            source: "صحيح البخاري 2893",
          },
        ],
      },
      { 
        id: 7, 
        title: 'عدم البغض والكراهية',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ؛ فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَجَسَّسُوا، ولا تَحَسَّسُوا، ولا تَباغَضُوا، وكُونُوا إخْوانًا، ولا يَخْطُبُ الرَّجُلُ علَى خِطْبَةِ أخِيهِ حتَّى يَنْكِحَ أوْ يَتْرُكَ"',
            source: "صحيح البخاري 5143",
          },
          {
            id: 2,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَباغَضُوا، ولا تَحاسَدُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ الله إخْوانًا، ولا يَحِلُّ لِمُسْلِمٍ أنْ يَهْجُرَ أخاهُ فَوْقَ ثَلاثَةِ أيَّامٍ."',
            source: "صحيح البخاري 6065",
          },
        ],
      },
      { 
        id: 8, 
        title: 'عدم التجسس',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ؛ فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَجَسَّسُوا، ولا تَحَسَّسُوا، ولا تَباغَضُوا، وكُونُوا إخْوانًا، ولا يَخْطُبُ الرَّجُلُ علَى خِطْبَةِ أخِيهِ حتَّى يَنْكِحَ أوْ يَتْرُكَ"',
            source: "صحيح البخاري 5143",
          },
        ],
      },
      { 
        id: 9, 
        title: 'عدم التعسير',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ الله عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ الله عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ الله في الدُّنْيَا وَالآخِرَةِ، والله في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ الله له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ؛ إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ، وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ الله فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ"',
            source: "صحيح مسلم 2699",
          },
          {
            id: 2,
            title: 'عن أبي قتادة رضي الله عنه أنه طَلَبَ غَرِيمًا له، فَتَوَارَى عنْه، ثُمَّ وَجَدَهُ، فَقالَ: إنِّي مُعْسِرٌ، فَقالَ: آلله؟ قالَ: آلله؟ قالَ: فإنِّي سَمِعْتُ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ يقولُ: "مَن سَرَّهُ أَنْ يُنْجِيَهُ الله مِن كُرَبِ يَومِ القِيَامَةِ، فَلْيُنَفِّسْ عن مُعْسِرٍ، أَوْ يَضَعْ عنْه."',
            source: "صحيح مسلم 1563",
          },
        ],
      },
      { 
        id: 10,
        title: 'عدم التقليد والتبعية',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 11,
        title: 'عدم التنفير',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 12,
        title: 'عدم الجبن',
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: ...فَكُنْتُ أخْدُمُ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ إذَا نَزَلَ، فَكُنْتُ أسْمَعُهُ كَثِيرًا يقولُ: "اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ، وغَلَبَةِ الرِّجَالِ..."',
            source: "صحيح البخاري 2893",
          },
        ],
      },
      { 
        id: 13,
        title: 'عدم الجدال والمراء',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 14,
        title: 'عدم الجزع',
        ahadith: [
          {
            id: 1,
            title: 'عن جندب بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كانَ فِيمَن كانَ قَبْلَكُمْ رَجُلٌ به جُرْحٌ، فَجَزِعَ، فأخَذَ سِكِّينًا فَحَزَّ بهَا يَدَهُ، فَما رَقَأَ الدَّمُ حتَّى مَاتَ، قالَ الله تَعَالَى: بَادَرَنِي عَبْدِي بنَفْسِهِ، حَرَّمْتُ عليه الجَنَّةَ."',
            source: "صحيح البخاري 3463",
          },
        ],
      },
      { 
        id: 15, 
        title: 'عدم الجفاء',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "الحياءُ منَ الإيمانِ ، والإيمانُ في الجنَّةِ ، والبَذاءُ منَ الجفاءِ ، والجفاءُ في النَّارِ"',
            source: "صحيح الترمذي 2009",
          },
        ],
      },
      { 
        id: 16, 
        title: 'عدم الحسد',
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا تَباغَضُوا، ولا تَحاسَدُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ الله إخْوانًا، ولا يَحِلُّ لِمُسْلِمٍ أنْ يَهْجُرَ أخاهُ فَوْقَ ثَلاثَةِ أيَّامٍ."',
            source: "صحيح البخاري 6065",
          },
        ],
      },
      { 
        id: 17, 
        title: 'عدم الحقد',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 18, 
        title: 'عدم الخبث',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 19, 
        title: 'عدم الخداع',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 20, 
        title: 'عدم الخذلان',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 21, 
        title: 'عدم الخيانة',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
        ],
      },
      { 
        id: 22, 
        title: 'عدم الذل', 
         ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 23, 
        title: 'عدم السخرية والإستهزاء', 
         ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 24, 
        title: 'عدم الشفه والحمق',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 25, 
        title: 'عدم سوء الظن',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إيَّاكُمْ والظَّنَّ، فإنَّ الظَّنَّ أكْذَبُ الحَديثِ، ولا تَحَسَّسُوا، ولا تَجَسَّسُوا، ولا تَنافَسُوا، ولا تَحاسَدُوا، ولا تَباغَضُوا، ولا تَدابَرُوا، وكُونُوا عِبادَ اللهِ إخْوانًا"',
            source: "صحيح مسلم 2563",
          },
        ],
      },
      { 
        id: 26, 
        title: 'عدم الشماتة',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 27, 
        title: 'عدم الطمع',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 28, 
        title: 'عدم الظلم', 
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمر رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ قالَ: "المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ الله عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ"',
            source: "صحيح البخاري 2442",
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "اتَّقُوا الظُّلْمَ، فإنَّ الظُّلْمَ ظُلُماتٌ يَومَ القِيامَةِ، واتَّقُوا الشُّحَّ، فإنَّ الشُّحَّ أهْلَكَ مَن كانَ قَبْلَكُمْ، حَمَلَهُمْ علَى أنْ سَفَكُوا دِماءَهُمْ واسْتَحَلُّوا مَحارِمَهُمْ"',
            source: "صحيح مسلم 2578",
          },
        ],
      },
      { 
        id: 29, 
        title: 'عدم العجب', 
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 30, 
        title: 'عدم العدوان', 
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 31, 
        title: 'عدم الغدر', 
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 32, 
        title: 'عدم الغش', 
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه، أنَّ رَسولَ اللهِ صَلَّى الله عليه وسلَّمَ مَرَّ علَى صُبْرَةِ طَعامٍ فأدْخَلَ يَدَهُ فيها، فَنالَتْ أصابِعُهُ بَلَلًا فقالَ: "ما هذا يا صاحِبَ الطَّعامِ؟" قالَ أصابَتْهُ السَّماءُ يا رَسولَ اللهِ، قالَ: "أفَلا جَعَلْتَهُ فَوْقَ الطَّعامِ كَيْ يَراهُ النَّاسُ، مَن غَشَّ فليسَ مِنِّي."',
            source: "صحيح مسلم 102",
          },
        ],
      },
      { 
        id: 33, 
        title: 'عدم الغضب', 
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: أنَّ رَجُلًا قالَ للنَّبيِّ صلَّى اللهُ عليه وسلَّم: أوْصِنِي، قالَ: "لا تَغْضَبْ". فَرَدَّدَ مِرَارًا، قالَ: "لا تَغْضَبْ"',
            source: "صحيح البخاري 6116",
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ الشَّدِيدُ بالصُّرَعَةِ، إنَّما الشَّدِيدُ الذي يَمْلِكُ نَفْسَهُ عِنْدَ الغَضَبِ"',
            source: "صحيح البخاري 6114",
          },
          {
            id: 3,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنْ كَفَّ غضبَهُ كَفَّ اللهُ عنهُ عذابَهُ ، ومَنْ خزنَ لسانَهُ سترَ اللهُ عَوْرَتَهُ ، ومَنِ اعْتَذَرَ إلى اللهِ قَبِلَ اللهُ عُذْرَهُ"',
            source: "السلسلة الصحيحة 2360",
          },
        ],
      },
      { 
        id: 34, 
        title: 'عدم الغيبة', 
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول اااه صلى الله عليه وسلم: "أَتَدْرُونَ ما الغِيبَةُ؟" قالوا: الله ورَسولُهُ أعْلَمُ، "قالَ: ذِكْرُكَ أخاكَ بما يَكْرَهُ." قيلَ: أفَرَأَيْتَ إنْ كانَ في أخِي ما أقُولُ؟ "قالَ: إنْ كانَ فيه ما تَقُولُ فَقَدِ اغْتَبْتَهُ، وإنْ لَمْ يَكُنْ فيه فقَدْ بَهَتَّهُ"',
            source: "صحيح مسلم 2589",
          },
        ],
      },
      { 
        id: 35, 
        title: 'عدم الفتور',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 36, 
        title: 'عدم الفجور',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 37, 
        title: 'عدم الفحش والبذاءة',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليسَ المؤمنُ بالطَّعَّانِ ولا اللَّعَّانِ ولا الفاحشِ ولا البَذيءِ"',
            source: "صحيح الترمذي 1977",
          },
        ],
      },
      { 
        id: 38, 
        title: 'عدم القسوة والغلظة والفظاظة',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي مسعود عقبة بن عمرو رضي الله عنه قال: أَشَارَ رَسولُ الله صلَّى اللهُ عليه وسلَّمَ بيَدِهِ نَحْوَ اليَمَنِ فَقالَ: "الإيمَانُ يَمَانٍ هَاهُنَا، ألَا إنَّ القَسْوَةَ وغِلَظَ القُلُوبِ في الفَدَّادِينَ، عِنْدَ أُصُولِ أذْنَابِ الإبِلِ، حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ في رَبِيعَةَ ومُضَرَ."',
            source: "صحيح البخاري 3302",
          },
        ],
      },
      { 
        id: 39, 
        title: 'عدم الكبر',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَدْخُلُ الجَنَّةَ مَن كانَ في قَلْبِهِ مِثْقالُ ذَرَّةٍ مِن كِبْرٍ" قالَ رَجُلٌ: إنَّ الرَّجُلَ يُحِبُّ أنْ يَكونَ ثَوْبُهُ حَسَنًا ونَعْلُهُ حَسَنَةً، قالَ: "إنَّ اللَّهَ جَمِيلٌ يُحِبُّ الجَمالَ، الكِبْرُ بَطَرُ الحَقِّ، وغَمْطُ النَّاسِ."',
            source: "صحيح مسلم 91",
          },
        ],
      },
      { 
        id: 40, 
        title: 'عدم الكذب',
        ahadith: [
          {
            id: 1,
            title: 'عن معاوية بن حيدة القشيري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ويلٌ للذي يحدِّثُ بالحديثِ ليُضحكَ به القومَ فيكذبُ ويلٌ له ويلٌ له"',
            source: "صحيح الترمذي 2315",
          },
          {
            id: 2,
            title: 'عن أبي أمامة الباهلي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "أنا زعيمٌ ببيتِ في رَبَضِ الجنةِ لمَن تَرَكَ المِراءَ وإن كان مُحِقًّا ، وببيتِ في وسطِ الجنةِ لمَن تركَ الكذبَ وإن كان مازحًا ، وببيتٍ في أعلى الجنةِ لمَن حَسُنَ خُلُقُه"',
            source: "صحيح أبي داود 4800",
          },
          {
            id: 3,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كَفَى بالمَرْءِ كَذِبًا أنْ يُحَدِّثَ بكُلِّ ما سَمِعَ"',
            source: "صحيح مسلم 5",
          },
          {
            id: 4,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "آيَةُ المُنَافِقِ ثَلَاثٌ: إذَا حَدَّثَ كَذَبَ، وإذَا وعَدَ أخْلَفَ، وإذَا اؤْتُمِنَ خَانَ"',
            source: "صحيح البخاري 33",
          },
        ],
      },
      { 
        id: 41, 
        title: 'عدم الكسل',
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أنَّ رَسولَ الله صَلَّى اللهُ عليه وسلَّمَ كانَ يَدْعُو: "أعُوذُ بكَ مِنَ البُخْلِ والكَسَلِ، وأَرْذَلِ العُمُرِ، وعَذَابِ القَبْرِ، وفِتْنَةِ الدَّجَّالِ، وفِتْنَةِ المَحْيَا والمَمَاتِ"',
            source: "صحيح البخاري 4707",
          },
        ],
      },
      { 
        id: 42, 
        title: 'عدم اللؤم',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 43, 
        title: 'عدم المكر والكيد',
        ahadith: [
          {
            id: 1,
            title: 'عن سعد بن أبي وقاص رضي الله عنه قال: سَمِعْتُ النبيَّ صَلَّى اللهُ عليه وسلَّمَ يقولُ: "لا يَكِيدُ أهْلَ المَدِينَةِ أحَدٌ، إلَّا انْمَاعَ كما يَنْمَاعُ المِلْحُ في المَاءِ."',
            source: "صحيح البخاري 1877",
          },
        ],
      },
      { 
        id: 44, 
        title: 'عدم نقض العهد',
        ahadith: [
          {
            id: 1,
            title: "",
            source: "",
          },
        ],
      },
      { 
        id: 45, 
        title: 'عدم النميمة',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: مَرَّ النبيُّ صَلَّى اللهُ عليه وسلَّمَ بحَائِطٍ مِن حِيطَانِ المَدِينَةِ، أوْ مَكَّةَ، فَسَمِعَ صَوْتَ إنْسَانَيْنِ يُعَذَّبَانِ في قُبُورِهِمَا، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: "يُعَذَّبَانِ، وما يُعَذَّبَانِ في كَبِيرٍ" ثُمَّ قالَ: "بَلَى، كانَ أحَدُهُما لا يَسْتَتِرُ مِن بَوْلِهِ، وكانَ الآخَرُ يَمْشِي بالنَّمِيمَةِ". ثُمَّ دَعَا بجَرِيدَةٍ، فَكَسَرَهَا كِسْرَتَيْنِ، فَوَضَعَ علَى كُلِّ قَبْرٍ منهما كِسْرَةً، فقِيلَ له: يا رَسولَ الله، لِمَ فَعَلْتَ هذا؟ قالَ: "لَعَلَّهُ أنْ يُخَفَّفَ عنْهما ما لَمْ تَيْبَسَا أوْ: إلى أنْ يَيْبَسَا."',
            source: "صحيح البخاري 216",
          },
          {
            id: 2,
            title: 'عن حذيفة بن اليمان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يَدْخُلُ الجَنَّةَ قَتّاتٌ."',
            source: "صحيح البخاري 6056",
          },
        ],
      },
      { 
        id: 46, 
        title: 'عدم الوهن',
        ahadith: [
          {
            id: 1,
            title: 'عن ثوبان مولى رسول الله صلى الله عليه وسلم قال: قال رسول الله صلى الله عليه وسلم: "يُوشِكُ الأممُ أن تداعَى عليكم كما تداعَى الأكَلةُ إلى قصعتِها" . فقال قائلٌ : ومن قلَّةٍ نحن يومئذٍ ؟ قال : "بل أنتم يومئذٍ كثيرٌ ، ولكنَّكم غُثاءٌ كغُثاءِ السَّيلِ ، ولينزِعنَّ اللهُ من صدورِ عدوِّكم المهابةَ منكم ، وليقذِفَنَّ اللهُ في قلوبِكم الوهْنَ" . فقال قائلٌ : يا رسولَ اللهِ ! وما الوهْنُ ؟ قال : "حُبُّ الدُّنيا وكراهيةُ الموتِ"',
            source: "صحيح أبي داود 4297",
          },
        ],
      },
      { 
        id: 47, 
        title: 'عدم اليأس والقنط',
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ خَلَقَ الرَّحْمَةَ يَومَ خَلَقَها مِائَةَ رَحْمَةٍ، فأمْسَكَ عِنْدَهُ تِسْعًا وتِسْعِينَ رَحْمَةً، وأَرْسَلَ في خَلْقِهِ كُلِّهِمْ رَحْمَةً واحِدَةً، فلوْ يَعْلَمُ الكافِرُ بكُلِّ الذي عِنْدَ اللَّهِ مِنَ الرَّحْمَةِ، لَمْ يَيْئَسْ مِنَ الجَنَّةِ، ولو يَعْلَمُ المُؤْمِنُ بكُلِّ الذي عِنْدَ اللَّهِ مِنَ العَذابِ، لَمْ يَأْمَن مِنَ النَّارِ"',
            source: "صحيح البخاري 6469",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 42,
    title: "سنن عيد الأضحى",
    sunan: [
      {
        id: 1,
        title: "عدم بيع جلد الأضحية أو أي جزء منها",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَنْ باع جلْدَ أُضْحِيَتِهِ ، فلَا أضْحِيَةَ لَهُ"',
            source: "الجامع الصغير 8535",
          },
        ],
      },
      {
        id: 2,
        title: "الذبح بعد صلاة العيد",
        ahadith: [
          {
            id: 1,
            title: 'عن البراء بن عازب رضي الله عنه قال: خَطَبَنَا النبيُّ صلَّى اللهُ عليه وسلَّمَ يَومَ النَّحْرِ، قَالَ: "إنَّ أوَّلَ ما نَبْدَأُ به في يَومِنا هذا أنْ نُصَلِّيَ، ثُمَّ نَرْجِعَ، فَنَنْحَرَ، فمَن فَعَلَ ذلكَ فقَدْ أصابَ سُنَّتَنَا، ومَن ذَبَحَ قَبْلَ أنْ يُصَلِّيَ فإنَّما هو لَحْمٌ عَجَّلَهُ لأهْلِه، ليسَ مِنَ النُّسُكِ في شيءٍ"، فقامَ خالِي أبو بُرْدَةَ بنُ نِيارٍ، فقالَ: يا رَسولَ الله، أنَا ذَبَحْتُ قَبْلَ أنْ أُصَلِّيَ، وعِندِي جَذَعَةٌ خَيْرٌ مِن مُسِنَّةٍ؟ قَالَ: "اجْعَلْهَا مَكَانَهَا -أوْ قَالَ: اذْبَحْها- ولَنْ تَجْزِيَ جَذَعَةٌ عن أحَدٍ بَعْدَكَ"',
            source: "صحيح البخاري 968,"
          },
        ],
      },
      {
        id: 3,
        title: "حد السكين قبل الذبح",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: ثِنْتَانِ حَفِظْتُهُما عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، قالَ: "إنَّ الله كَتَبَ الإحْسَانَ علَى كُلِّ شيءٍ، فَإِذَا قَتَلْتُمْ فأحْسِنُوا القِتْلَةَ، وإذَا ذَبَحْتُمْ فأحْسِنُوا الذَّبْحَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، فَلْيُرِحْ ذَبِيحَتَهُ"',
            source: "صحيح مسلم 1955",
          },
        ],
      },
      {
        id: 4,
        title: "عدم حد السكين أمام الأضحية",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: مرَّ رسولُ اللهِ صلَّى اللهُ عليْهِ وسلَّمَ على رجُلٍ واضِعٍ رِجْلَه على صَفحةِ شاةٍ وهوَ يُحدُّ شفرتَه وهيَ تلحَظُ إليه ببصَرِها قال : "أفلا قَبلَ هذا ؟ . أو تريدُ أن تُمِيتَها مَوتاتٍ ؟ !"',
            source: "صحيح الترغيب 1090",
          },
        ],
      },
      {
        id: 5,
        title: "التسمية والتكبير عند الذبح",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "ضَحَّى النبيُّ صَلَّى اللهُ عليه وسلَّمَ بكَبْشينِ أمْلَحَيْنِ أقْرَنَيْنِ، ذَبَحَهُما بيَدِهِ، وسَمَّى وكَبَّرَ، ووَضَعَ رِجْلَهُ علَى صِفَاحِهِمَا"',
            source: "صحيح البخاري 5565",
          },
        ],
      },
      {
        id: 6,
        title: "عدم ذبح الأضحية أمام غيرها من الأضاحي",
        ahadith: [
          {
            id: 1,
            title: 'عن شداد بن أوس رضي الله عنه قال: ثِنْتَانِ حَفِظْتُهُما عن رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ، قالَ: "إنَّ الله كَتَبَ الإحْسَانَ علَى كُلِّ شيءٍ، فَإِذَا قَتَلْتُمْ فأحْسِنُوا القِتْلَةَ، وإذَا ذَبَحْتُمْ فأحْسِنُوا الذَّبْحَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، فَلْيُرِحْ ذَبِيحَتَهُ"',
            source: "صحيح مسلم 1955",
          },
        ],
      },
      {
        id: 7,
        title: "عدم إزالة المضحي شيئا من شعره وأظافره خلال العشر",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: "مَن كانَ له ذِبْحٌ يَذْبَحُهُ فإذا أُهِلَّ هِلالُ ذِي الحِجَّةِ، فلا يَأْخُذَنَّ مِن شَعْرِهِ، ولا مِن أظْفارِهِ شيئًا حتَّى يُضَحِّيَ"',
            source: "صحيح مسلم 1977",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 43,
    title: "سنن في الخارج",
    sunan: [
      {
        id: 1,
        title: "كشف بعض البدن ليصيبه المطر",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: أَصَابَنَا وَنَحْنُ مع رَسولِ اللهِ صَلَّى الله عليه وسلَّمَ مَطَرٌ، قالَ: فَحَسَرَ رَسولُ اللهِ صَلَّى الله عليه وسلَّمَ ثَوْبَهُ، حتَّى أَصَابَهُ مِنَ المَطَرِ، فَقُلْنَا: يا رَسولَ اللهِ، لِمَ صَنَعْتَ هذا؟ قالَ: "لأنَّهُ حَديثُ عَهْدٍ برَبِّهِ تَعَالَى"',
            source: "صحيح مسلم 898",
          },
        ],
      },
      {
        id: 2,
        title: "النظر إلى السماء والدعاء عند الخروج من البيت",
        ahadith: [
          {
            id: 1,
            title: 'عن أم سلمة أم المؤمنين رضي الله عنها قالت: "ما خرج النبيُّ صلَّى اللهُ عليهِ وسلَّم من بيتي قَطُّ إلا رفع طَرْفَه إلى السماءِ فقال اللهم أعوذُ بك أن أَضِلَّ أو أُضَلَّ أو أَزِلَّ أو أُزَلَّ أو أَظْلِمَ أو أُظْلَمَ أو أَجْهَلَ أو يُجْهَلَ عَلَيَّ"',
            source: "صحيح أبي داود 5094",
          },
        ],
      },
      {
        id: 3,
        title: "إزالة الأذى عن الطريق",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "بيْنَما رَجُلٌ يَمْشِي بطَرِيقٍ وجَدَ غُصْنَ شَوْكٍ علَى الطَّرِيقِ فأخَّرَهُ، فَشَكَرَ الله له فَغَفَرَ له. ثُمَّ قَالَ: الشُّهَدَاءُ خَمْسَةٌ: المَطْعُونُ، والمَبْطُونُ، والغَرِيقُ، وصَاحِبُ الهَدْمِ، والشَّهِيدُ في سَبيلِ اللَّهِ، وقَالَ: لو يَعْلَمُ النَّاسُ ما في النِّدَاءِ والصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إلَّا أنْ يَسْتَهِمُوا لَاسْتَهَمُوا عليه. ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إلَيْهِ ولو يَعْلَمُونَ ما في العَتَمَةِ والصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
            source: "صحيح البخاري 652",
          },
          {
            id: 2,
            title: 'عن أبي برزة الأسلمي نضلة بن عبيد رضي الله عنه قال: يا رسولَ الله ، دُلَّني على عملٍ أنتفعُ بِهِ ، قالَ : "اعزلِ الأذى عن طريقِ المسلِمينَ"',
            source: "صحيح ابن ماجه 2983",
          },
        ],
      },
      {
        id: 4,
        title: "غض البصر في الشارع والطرقات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِيَّاكُمْ وَالجُلُوسَ علَى الطُّرُقَاتِ"، فَقالوا: ما لَنَا بُدٌّ، إنَّما هي مَجَالِسُنَا نَتَحَدَّثُ فِيهَا، قالَ: "فَإِذَا أَبَيْتُمْ إِلَّا المَجَالِسَ، فأعْطُوا الطَّرِيقَ حَقَّهَا"، قالوا: وَما حَقُّ الطَّرِيقِ؟ قالَ: "غَضُّ البَصَرِ، وَكَفُّ الأذَى، وَرَدُّ السَّلَامِ، وَأَمْرٌ بالمَعروفِ، وَنَهْيٌ عَنِ المُنْكَرِ."',
            source: "صحيح البخاري 2465",
          },
        ],
      },
      {
        id: 5,
        title: "كف الأذى في الشارع والطرقات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِيَّاكُمْ وَالجُلُوسَ علَى الطُّرُقَاتِ"، فَقالوا: ما لَنَا بُدٌّ، إنَّما هي مَجَالِسُنَا نَتَحَدَّثُ فِيهَا، قالَ: "فَإِذَا أَبَيْتُمْ إِلَّا المَجَالِسَ، فأعْطُوا الطَّرِيقَ حَقَّهَا"، قالوا: وَما حَقُّ الطَّرِيقِ؟ قالَ: "غَضُّ البَصَرِ، وَكَفُّ الأذَى، وَرَدُّ السَّلَامِ، وَأَمْرٌ بالمَعروفِ، وَنَهْيٌ عَنِ المُنْكَرِ."',
            source: "صحيح البخاري 2465",
          },
        ],
      },
      {
        id: 6,
        title: "رد السلام في الشارع والطرقات",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِيَّاكُمْ وَالجُلُوسَ علَى الطُّرُقَاتِ"، فَقالوا: ما لَنَا بُدٌّ، إنَّما هي مَجَالِسُنَا نَتَحَدَّثُ فِيهَا، قالَ: "فَإِذَا أَبَيْتُمْ إِلَّا المَجَالِسَ، فأعْطُوا الطَّرِيقَ حَقَّهَا"، قالوا: وَما حَقُّ الطَّرِيقِ؟ قالَ: "غَضُّ البَصَرِ، وَكَفُّ الأذَى، وَرَدُّ السَّلَامِ، وَأَمْرٌ بالمَعروفِ، وَنَهْيٌ عَنِ المُنْكَرِ."',
            source: "صحيح البخاري 2465",
          },
        ],
      },
      {
        id: 7,
        title: "الأمر بالمعروف والنهي عن المنكر",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إِيَّاكُمْ وَالجُلُوسَ علَى الطُّرُقَاتِ"، فَقالوا: ما لَنَا بُدٌّ، إنَّما هي مَجَالِسُنَا نَتَحَدَّثُ فِيهَا، قالَ: "فَإِذَا أَبَيْتُمْ إِلَّا المَجَالِسَ، فأعْطُوا الطَّرِيقَ حَقَّهَا"، قالوا: وَما حَقُّ الطَّرِيقِ؟ قالَ: "غَضُّ البَصَرِ، وَكَفُّ الأذَى، وَرَدُّ السَّلَامِ، وَأَمْرٌ بالمَعروفِ، وَنَهْيٌ عَنِ المُنْكَرِ."',
            source: "صحيح البخاري 2465",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 44,
    title: "سنن الزواج",
    sunan: [
      {
        id: 1,
        title: "وجوب الغسل بعد الجماع",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا جَلَسَ بيْنَ شُعَبِها الأرْبَعِ، ثُمَّ جَهَدَها فقَدْ وجَبَ الغَسْلُ"',
            source: "صحيح البخاري 291",
          },
        ],
      },
      {
        id: 2,
        title: "دعاء قبل الجماع",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنه قال: قال رسول الله صلى الله غليه وسلم: " أَمَا لو أنَّ أحَدَهُمْ يَقولُ حِينَ يَأْتي أهْلَهُ: باسْمِ الله، اللَّهُمَّ جَنِّبْنِي الشَّيْطانَ، وجَنِّبِ الشَّيْطانَ ما رَزَقْتَنا، ثُمَّ قُدِّرَ بيْنَهُما في ذلكَ، أوْ قُضِيَ ولَدٌ؛ لَمْ يَضُرَّهُ شَيطانٌ أبَدًا."',
            source: "صحيح البخاري 5165",
          },
        ],
      },
      {
        id: 3,
        title: "لا يجوز الزواج بالمرأة وعمتها أو خالتها في نفس الوقت",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لا يُجْمَعُ بيْنَ المَرْأَةِ وعَمَّتِها، ولا بيْنَ المَرْأَةِ وخالَتِها"',
            source: "صحيح البخاري 5109",
          },
        ],
      },
      {
        id: 4,
        title: "إيقاظ الزوجين لبعضهما للصلاة",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "رحِمَ الله رجلًا قامَ منَ اللَّيلِ فصلَّى وأيقظَ امرأتَهُ فصلَّت فإن أبَت نضحَ في وجهِها الماءَ رحِمَ الله امرأةً قامَت منَ اللَّيلِ فَصلَّت وأيقَظَت زَوجَها فإن أبَى نضَحَت في وجهِهِ الماءَ"',
            source: "صحيح أبي داود 1450",
          },
        ],
      },
    ],
  },
  //done sourced
  {
    id: 45,
    title: "سنن عن القرآن الكريم",
    sunan: [
      {
        id: 1,
        title: "الإكثار من قراءة القرآن الكريم",
        ahadith: [
          {
            id: 1,
            title: 'عن أم المؤمنين عائشة رضي الله عنها قالت: "كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا دَخَلَ العَشْرُ شَدَّ مِئْزَرَهُ، وأَحْيَا لَيْلَهُ، وأَيْقَظَ أهْلَهُ"',
            source: "صحيح البخاري 2024",
          },
        ],
      },
      {
        id: 2,
        title: "تحسين الصوت بقراءة القرآن الكريم",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَمْ يَأْذَنِ الله لِشَيءٍ ما أذِنَ للنَّبيِّ أنْ يَتَغَنَّى بالقُرْآنِ. وقالَ صاحِبٌ له: يُرِيدُ يَجْهَرُ بهِ"',
            source: "صحيح البخاري 5023",
          },
        ],
      },
      {
        id: 3,
        title: "تعلم القرآن الكريم وتعليمه",
        ahadith: [
          {
            id: 1,
            title: 'عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خَيْرُكُمْ مَن تَعَلَّمَ القُرْآنَ وعَلَّمَهُ". قالَ: وأَقْرَأَ أبو عبدِ الرَّحْمَنِ في إمْرَةِ عُثْمانَ، حتَّى كانَ الحَجَّاجُ قالَ: وذاكَ الذي أقْعَدَنِي مَقْعَدِي هذا',
            source: "صحيح البخاري 5027",
          },
        ],
      },
      {
        id: 4,
        title: "حفظ القرآن الكريم",
        ahadith: [
          {
            id: 1, 
            title: 'عن أبي سَعيدٍ الخُدريِّ عنِ النبيِّ صلَّى اللهُ عليه وسلَّم أنَّه قال: "مَن قَرَأَ سورةَ الكَهفِ يومَ الجُمُعةِ أضاءَ له من النورِ ما بَينَ الجُمُعتينِ"',
            source: "صحيح الجامع 6470",
          },
          {
            id: 2,
            title: 'عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ"',
            source: "صحيح مسلم 809",
          },
        ],
      },
    ],
  },
];