export const data = [
  { 
    id: 1,
    title: 'الفجر/الصبح', 
    number: '2', 
    mandatory: 'مفروضة ', 
    type: "جَهْرِيَّة",
    before: "2",
    after: "0",
    info: "صلاة الفجر أو الصبح هي أول الصلوات الخمس المفروضة كل يوم و ليلة. و هي صلاة جهرية تتكون من ركعتين.",
    virtue: [
      {
        title: "الذي يصلي الفجر يكون في حفظ الله و حمايته",
        sayings: [
          "قال رسول الله ﷺ : «من صلَّى الصبح فهو في ذِمَّة الله». «في ذِمَّة الله» يعني: في أمانه و عهده.",
        ],
      },
      {
        title: "الذي يحافظ على صلاة الفجر تشهد له الملائكة يوميا عند الله عز و جل",
        sayings: [
          "قال رسول الله ﷺ : «يتعاقبون فيكم ملائكة بالليل، وملائكة بالنهار، ويجتمعون في صلاة الصبح وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم الله -وهو أعلم بهم-: كيف تركتم عبادي؟ فيقولون: تركناهم وهم يصلون، وأتيناهم وهو يصلون»",
        ],
      },
      {
        title: "من أسباب النظر إلى وجه الله سبحانه في الجنة",
        sayings: [
          "قال رسول الله ﷺ : «إنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كما تَرَوْنَ هذا القَمَرَ، لا تُضَامُّونَ في رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أنْ لا تُغْلَبُوا علَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غُرُوبِهَا فَافْعَلُوا ثُمَّ قَرَأَ: {وَسَبِّحْ بحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ الغُرُوبِ}»",
        ],
      },
      {
        title: "أجر و ثواب كبير",
        sayings: [
          "عنْ عائشةَ رضِيَ اللَّه عنْهَا، عَنِ النبيِّ ﷺ قالَ: «رَكْعتا الفجْرِ خيْرٌ مِنَ الدُّنيا ومَا فِيها» رواه مسلم. قال بعض العلماء: هما سنة الفجر، فإذا كان هذا أجر سنة الفجر (صلاة ركعتين قبل الفجر) فكيف سيكون أجر صلاة الفجر المفروضة و هي أحب إلى الله",
        ],
      },
      {
        title: "أجر قيام الليل",
        sayings: [
          "عن عثمان بن عفان رَضيَ الله عنه، عن الرسول ﷺ : «مَن صَلَّى العِشَاءَ في جَمَاعَةٍ فَكَأنَّما قَامَ نِصْفَ اللَّيْلِ، وَمَن صَلَّى الصُّبْحَ في جَمَاعَةٍ فَكَأنَّما صَلَّى اللَّيْلَ كُلَّهُ».",
        ],
      },
      {
        title: "براءة من النفاق",
        sayings: [
          "عن أبي هريرة رَضيَ الله عنه أن رسول الله ﷺ قال: «ليس صلاة أثقل على المنافقين من الفجر والعشاء، ولو يعلمون ما فيهما لأتوهما ولو حبوًا»",
        ],
      },
      {
        title: "النجاة من النار و البشارة بدخول الجنة",
        sayings: [
          "عن أبي زهير عُمارةُ بنُ رُؤَيْبَةَ رَضيَ الله عنه عن النبي ﷺ : «لَنْ يَلِجَ النَّارَ أَحَدٌ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَ قَبْلَ غُرُوبِهَا»",
        ],
      },
      // {
      //   title: "",
      //   sayings: [
      //     "",
      //   ],
      // },
    ],
  },
  { 
    id: 2,
    title: 'الظهر', 
    number: '4', 
    mandatory: 'مفروضة', 
    type: "سِرِّيَّة",
    before: "4 ركعتان ركعتان",
    after: "2",
    info: "صلاة الظهر هي ثاني الصلوات الخمس المفروضة كل يوم و ليلة. و هي صلاة سرية تتكون من أربع ركعات. و تعقد طوال أيام الأسبوع وقت الظهيرة عدا يوم الجمعة، فتحل مكانها صلاة الجمعة بالنسبة لمن يذهب للمسجد. و هي أول صلاة صلاها النبي محمد صلى الله عليه و سلم بعد فرض الصلوات الخمس.",
  },
  { 
    id: 3,
    title: 'العصر', 
    number: '4', 
    mandatory: 'مفروضة ', 
    type: "سِرِّيَّة",
    before: "0",
    after: "0",
    info: "صلاة العصر هي ثالث الصلوات الخمس المفروضة كل يوم و ليلة. و هي صلاة سرية تتكون من أربع ركعات.",
    virtue: [
      {
        title: "من أسباب النظر إلى وجه الله سبحانه في الجنة",
        sayings: [
          "قال رسول الله ﷺ : «إنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كما تَرَوْنَ هذا القَمَرَ، لا تُضَامُّونَ في رُؤْيَتِهِ، فَإِنِ اسْتَطَعْتُمْ أنْ لا تُغْلَبُوا علَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ غُرُوبِهَا فَافْعَلُوا ثُمَّ قَرَأَ: {وَسَبِّحْ بحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وقَبْلَ الغُرُوبِ}»",
        ],
      },
      {
        title: "الذي يحافظ على صلاة العصر تشهد له الملائكة يوميا عند الله عز و جل",
        sayings: [
          "قال رسول الله ﷺ : «يتعاقبون فيكم ملائكة بالليل، وملائكة بالنهار، ويجتمعون في صلاة الصبح وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم الله -وهو أعلم بهم-: كيف تركتم عبادي؟ فيقولون: تركناهم وهم يصلون، وأتيناهم وهو يصلون»",
        ],
      },
      {
        title: "النجاة من النار و البشارة بدخول الجنة",
        sayings: [
          "عن أبي زهير عُمارةُ بنُ رُؤَيْبَةَ رَضيَ الله عنه عن النبي ﷺ : «لَنْ يَلِجَ النَّارَ أَحَدٌ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَ قَبْلَ غُرُوبِهَا»",
        ],
      },
      // {sayings: 
      //   [
      //     "عن أبي هريرة أن رسول الله قال: «يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار، ويجتمعون في صلاة الفجر وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم وهو أعلم بهم: كيف تركتم عبادي؟ فيقولون: تركناهم وهم يصلون، وأتيناهم وهم يصلون».",
      //     // "عن أبي بكر بن أبي موسى، عن أبيه أن رسول الله قال: «من صلى البردين دخل الجنة».",
      //     // "قال ابن حجر: (البردين) صلاة الفجر وصلاة العصر، سميا بذلك لأنهما يفعلان في بردي النهار وهما طرفاه حين يطيب الهواء.",
      //     // "قال ابن حجر: (البردين) صلاة الفجر وصلاة العصر، سميا بذلك لأنهما يفعلان في بردي النهار وهما طرفاه حين يطيب الهواء.",
      //   ],
      // },
    ],
  },
  { 
    id: 4,
    title: 'المغرب', 
    number: '3', 
    mandatory: 'مفروضة ', 
    type: "جَهْرِيَّة (الركعة الأولى و الثانية فقط)",
    before: "0",
    after: "2",
    info: "صلاة المغرب هي رابع الصلوات الخمس المفروضة كل يوم و ليلة. و هي صلاة جهرية ما عدا الركعة الثالثة، و تتكون من ثلاث ركعات.",
  },
  { 
    id: 5,
    title: 'العشاء', 
    number: '4', 
    mandatory: 'مفروضة ', 
    type: "جَهْرِيَّة (الركعة الأولى و الثانية فقط)",
    info: "صلاة العشاء هي خامس الصلوات الخمس المفروضة كل يوم و ليلة. و هي صلاة جهرية ما عدا الركعة الثالثة و الرابعة، و تتكون من أربع ركعات.",
    before: "0",
    after: "2",
    virtue: [
      {
        title: "أجر قيام نصف الليل",
        sayings: [
          "عن عثمان بن عفان رَضيَ الله عنه، عن الرسول ﷺ : «مَن صَلَّى العِشَاءَ في جَمَاعَةٍ فَكَأنَّما قَامَ نِصْفَ اللَّيْلِ، وَمَن صَلَّى الصُّبْحَ في جَمَاعَةٍ فَكَأنَّما صَلَّى اللَّيْلَ كُلَّهُ».",
        ],
      },
    ],
  },
  { 
    id: 6,
    title: 'الجمعة', 
    number: '2', 
    mandatory: 'مفروضة ', 
    type: "جَهْرِيَّة",
    info: "صلاة الجمعة هي صلاة تقام كل يوم جمعة بعد دخول وقت صلاة الظهر. و هي صلاة جهرية تتكون من ركعتين. و يشترط أن يتقدمها خطبتان قبل الصلاة.", 
    virtue: [
      {
        title: "لكل خطوة إلى المسجد لصلاة الجمعة أجر صيام سنة و قيامها",
        sayings: [
          "عن أوس بن أوس الثقفي عن رسول الله ﷺ قال : ( مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَّلَ ، وَبَكَّرَ وَابْتَكَرَ ، وَدَنَا وَاسْتَمَعَ وَأَنْصَتَ ، كَانَ لَهُ بِكُلِّ خُطْوَةٍ يَخْطُوهَا أَجْرُ سَنَةٍ صِيَامُهَا وَقِيَامُهَا ). رواه الترمذي (496) . وصححه الألباني في صحيح الترمذي (410).",
        ],
      },
      {
        title: "كفارة للذنوب",
        sayings: [
          "عن أَبي هُريرة رضي الله عنه أَنَّ رَسُولِ الله ﷺ قَالَ: «الصَّلواتُ الخَمْسُ، والجُمُعةُ إِلى الجُمُعَةِ، كفَّارةٌ لِمَا بَيْنهُنَّ، مَا لَمْ تُغش الكبَائِرُ» رواه مسلم",
        ],
      },
      {
        title: "مغفرة كبيرة",
        sayings: [
          "وعن أبي هريرة رضي الله عنه: عن النبي ﷺ قال: «مَنْ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ، ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ، ثُمَّ يُصَلِّي مَعَهُ ، غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى وَفَضْلُ ثَلاثَةِ أَيَّامٍ». رواه مسلم (857)",
        ],
      },
    ],
  },
  { 
    id: 7,
    title: 'الشفع', 
    number: '2', 
    mandatory: 'سنة مؤكدة',
    type: "جَهْرِيَّة",
    info: "صلاة الشفع هي صلاة إختيارية تؤدى بعد صلاة العشاء وقبل صلاة الوتر. وهي صلاة جهرية تتكون من ركعتين.",
  },
  { 
    id: 8,
    title: 'الوتر', 
    number: '1', 
    mandatory: 'سنة مؤكدة',
    type: "جَهْرِيَّة",
    info: "صلاة الوتر هي صلاة إختيارية تؤدى بعد صلاة العشاء وقبل صلاة الفجر. وهي صلاة جهرية تتكون من ركعة واحدة.",
    naming: "سميت بذلك لأنها تُصلى وتراً أي ركعة واحدة، أو ثلاثاً أو أكثر أي عدداً فردياً.", 
  },
  { 
    id: 9,
    title: 'قيام الليل',  
    number: ' 2 أو 4 أو 6 أو 8 أو أكثر',  
    mandatory: 'سنة مؤكدة',
    type: "جَهْرِيَّة",
    time: "وقتها من بعد صلاة العشاء إلى قبل صلاة الفجر، و أفضل أوقاتها هو الثلث الأخير من الليل.",
  },
  { 
    id: 10,
    title: 'التراويح',
    number: '8 أو أكثر (عدد زوجي مثل 10, 12, 14 إلخ) ثم الشفع (ركعتان) ثم الوتر (ركعة واحدة)',
    mandatory: 'سنة مؤكدة',
    type: "جَهْرِيَّة",
    info: "صلاة التراويح هي صلاة تؤدى في كل ليلة من رمضان بعد صلاة العشاء و يستمر وقتها إلى قبيل الفجر، و قد حث النبي محمد ﷺ على قيام رمضان فقال: «من قام رمضان إيماناً واحتساباً غفر له ما تقدم من ذنبه».",
    naming: "صلاة التراويح أو صلاة القيام في رمضان أو قيام رمضان، و التراويح جمع ترويحة (جلسة إستراحة) و سميت بذلك لأن الصحابة رضي الله عنهم كانوا يستريحون بين كل أربع ركعات منها (كل تسليمتين)",
    way: "نصلي التراويح مثنى مثنى يعني ركعتين ركعتين بين كل أربع ركعات نرتاح و نذكر الله و لهذا سميت بالتراويح، و بعدها نصلي صلاة الشفع (ركعتان) ثم الوتر (ركعة واحدة).",
    virtue: [
      {
        title: "مغفرة كبيرة",
        sayings: [
          "عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ: «مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ» رواه البخاري (37)، ومسلم (759).",
        ],
      },
      {
        title: "",
        sayings: [
          "لم يثبت في حديث النبي محمد ﷺ شيء عن عدد ركعات صلاة التراويح، إلا أنه ثبت من فعله أنه صلاها إحدى عشرة ركعة كما بينت ذلك أم المؤمنين عائشة رضي الله عنها حين سُئلت عن كيفية صلاة الرسول في رمضان، فقالت: «ما كان رسول الله يزيد في رمضان ولا في غيره على إحدى عشرة ركعة، يصلي أربعًا، فلا تسأل عن حسنهن وطولهن، ثم يصلي أربعًا، فلا تسأل عن حسنهن وطولهن، ثم يصلي ثلاثاً»",
        ],
      }
    ],
  },
  { 
    id: 11,
    title: 'تحية المسجد',  
    number: '2 أو أكثر', 
    mandatory: 'سنة مؤكدة',
    type: "سِرِّيَّة",
    info: "تحية المسجد أو صلاة تحية المسجد صلاة نافلة وهي صلاة ركعتين أو أكثر، يُسَنّ للمسلم أن يُصلّيها إذا دخل مسجداً وأراد الجلوس فيه غير المسجد الحرام. وتُعدّ هذه الصّلاة صلاةً سريّةً سواءً كان دخول المصلي إلى المسجد وصلاته فيه ليلاً أو نهاراً، وله أن يُصليّها في أيّ مكان يريده في المسجد.",
  },
  { 
    id: 12,
    title: 'التهجد',  
    number: ' 2 أو 4 أو 6 أو 8 أو أكثر',  
    mandatory: 'سنة مؤكدة',
    type: "جَهْرِيَّة",
    virtue: [
      {
        title: "",
        sayings: ["قال تعالى: ﴿وَ مِنَ ٱلَّيْلِ فَتَهَجَّدْ بِهِۦ نَافِلَةً لَّكَ عَسَىٰٓ أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا﴾ [الإسراء : 79]",],
      },
    ],
  },
  { 
    id: 13,
    title: 'الضحى', 
    number: '2 أو 4 أو 8 أو 12',  
    mandatory: 'سنة مؤكدة', 
    type: "سِرِّيَّة",
    time: "وقت صلاة الضحى من طلوع الشمس وارتفاعها إلى قبيل وقت صلاة الظهر. (بعد الشروق ب 10 دقائق إلى ما قبل الظهر ب 10 دقائق.) والأفضل صلاتها بعد اشتداد حر الشمس لقول النبي ﷺ: (صلاة الأوابين حين ترمض الفصال) رواه مسلم (748) والفصال هي أولاد الإبل، ومعنى ترمض تشتد عليها الرمضاء وهي حرارة الشمس.   ",
    virtue: [
      {
        title: "أنها وصية النبي ﷺ لبعض أصحابه لأبي ذر و أبي هريرة و أبي الدرداء رضي الله عنهم.",
        sayings: [
          "وعَنْ أَبِي الدَّرْدَاءِ رضي الله عنه قَالَ : ( أَوْصَانِي حَبِيبِي ﷺ بِثَلَاثٍ لَنْ أَدَعَهُنَّ مَا عِشْتُ : بِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ، وَصَلَاةِ الضُّحَى ، وَبِأَنْ لَا أَنَامَ حَتَّى أُوتِرَ ) رواه مسلم (1183) .",
          "عن أبي هريرة رضي الله عنه قال: أَوْصَانِي خَلِيلِي بثَلَاثٍ لا أدَعُهُنَّ حتَّى أمُوتَ: صَوْمِ ثَلَاثَةِ أيَّامٍ مِن كُلِّ شَهْرٍ، وصَلَاةِ الضُّحَى، ونَوْمٍ علَى وِتْرٍ. . رواه البخاري.",
          "عن أبي ذرّ الغفاري رضي الله عنه قال: قال رسول الله ﷺ:( يُصْبِحُ علَى كُلِّ سُلَامَى مِن أَحَدِكُمْ صَدَقَةٌ، فَكُلُّ تَسْبِيحَةٍ صَدَقَةٌ، وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ، وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ، وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ، وَأَمْرٌ بالمَعروفِ صَدَقَةٌ، وَنَهْيٌ عَنِ المُنْكَرِ صَدَقَةٌ، وَيُجْزِئُ مِن ذلكَ رَكْعَتَانِ يَرْكَعُهُما مِنَ الضُّحَى ) رواه مسلم (1181)",
        ],
      },
      {
        title: "حرص النبى ﷺ عليها.",
        sayings: [
          "وعن عائشة رضي الله عنها ، قالت : كَانَ رسولُ اللهِ - ﷺ - يُصَلِّي الضُّحَى أرْبَعاً ، وَيَزِيدُ مَا شَاءَ الله",
        ],
      },
      {
        title: "صلاة الضحى صلاة الأوابين",
        sayings: [
          "عن أبي هريرة رضي الله عنه أن النبي - صلى الله عليه وسلم - قال : صلاة الضحى صلاة الأوابين([14]).",
          "عن أبي هريرة رضي الله عنه أن النبي ﷺ: “لا يحافظ على صلاة الضحى إلا أوَّابٌ ، وهي صلاة الأوَّابين“.",
          "الأوَّابُ: كثير الرجوع إلى الله",
        ],
      },
    ]
  },
  { 
    id: 14,
    title: 'الإستخارة', 
    number: '2', 
    mandatory: 'سنة مؤكدة', 
    time: "صلاة الإستخارة ليس لها وقت محدد ، و لكن يجب تجنب صلاتها في وقت كراهة الصلاة (بعد العصر و حتى آذان المغرب و بعد الفجر و حتى شروق الشمس فهذا الوقت يفضل أن لا يصلى فيه),",
    type: "جهرا في الليل و سرا في الصباح",
    way: "التوضأ و النية ثم يصلي المسلم ركعتين من غير الفريضة و يقرأ في الأولى سورة الفاتحة و الكافرون، و في الثانية الفاتحة و الإخلاص، ثم يختم صلاته و يقرأ التشهد و يسلم ثم يحمد الله و يصلي على النبي ﷺ ثم يدعو بهذا الدعاء: «اللهُمَّ إنِّي أسْتَخيرُكَ بعِلْمِكَ، وأسْتَقْدِرُكَ بقُدْرَتِكَ، وأسْألُكَ مِنْ فضلِكَ العَظِيم، فإنَّكَ تَقْدِرُ ولا أقْدِرُ، وتَعْلَمُ ولا أعْلَمُ، وأنْتَ عَلاَّمُ الغُيوبِ، اللهُمَّ إنْ كُنْتَ تَعْلَمُ أن هذَا الأمرَ (يسمي الشيء الذي يريده) خَيرٌ لي في دِيني ومَعَاشي وعَاقِبَةِ أمْري عَاجِلهِ وآجِلِهِ فاقْدُرْهُ لي ويَسِّرْهُ لي، ثمَّ بَارِكْ لي فيهِ، وإنْ كُنْتَ تَعْلَمُ أنَّ هذا الأمْرَ (يسمي الشيء الذي يريده) شَرٌّ لي في دِينِي ومَعَاشي وعَاقِبَةِ أمري عَاجِلِهِ وآجِلِهِ فَاصْرِفْهُ عَنِّي، وَاصْرِفْنِي عَنْهُ، واقْدُرْ لِيَ الخَيْرَ حَيْثُ كَانَ، ثُمَّ أرْضِنِي بِهِ.»"
  },
  { 
    id: 15, 
    title: 'الكسوف' , 
    number: '2', 
    mandatory: 'سنة مؤكدة',
    time: "يبدأ وقت صلاة الكسوف من تحقق الكسوف، و ينتهي بالإنجلاء.",
    type: "سِرِّيَّة و الله أعلم.",
    info: "صلاة الكسوف أو صلاة الكسوفين هي نوع من أنواع صلاة النفل المؤقت بسبب كسوف الشمس، و يستحب صلاتها في جماعة، و هي سنة مؤكدة و هي ركعتان، في كل ركعة قيامان و قراءتان و ركوعان و سجودان.",
    way: 'يقرأ في الركعة الأولى سورة الفاتحة و سورة طويلة، ثم يركع، ثم يرفع من ركوعه و يقول "سمع الله لمن حمده ربنا و لك الحمد"، لكن لا يسجد، بل يقرأ الفاتحة و سورة طويلة أخرى أو يكمل السورة التي بدأها قبل الركوع، ثم يركع مرة ثانية، ثم يرفع من ركوعه و يقول "سمع الله لمن حمده ربنا و لك الحمد"، ثم يسجد سجدتين، ثم يصلي الركعة الثانية مثل الأولى ثم يتشهد و يسلم.', 
  },
  { 
    id: 16, 
    title: 'الخسوف' , 
    number: '2', 
    mandatory: 'سنة مؤكدة',
    time: "يبدأ وقت صلاة الخسوف من تحقق الخسوف و ينتهي بالإنجلاء.",
    type: "جَهْرِيَّة و الله أعلم.",
    info: "صلاة الخسوف هي نوع من أنواع صلاة النفل المؤقت بسبب خسوف القمر، و يستحب صلاتها في جماعة، و هي سنة مؤكدة و هي ركعتان، في كل ركعة قيامان و قراءتان و ركوعان و سجودان.",
    way: 'يقرأ في الركعة الأولى سورة الفاتحة و سورة طويلة، ثم يركع، ثم يرفع من ركوعه و يقول "سمع الله لمن حمده ربنا و لك الحمد"، لكن لا يسجد، بل يقرأ الفاتحة و سورة طويلة أخرى أو يكمل السورة التي بدأها قبل الركوع، ثم يركع مرة ثانية، ثم يرفع من ركوعه و يقول "سمع الله لمن حمده ربنا و لك الحمد"، ثم يسجد سجدتين، ثم يصلي الركعة الثانية مثل الأولى ثم يتشهد و يسلم.', 
  },
  { id: 17, title: 'الجنازة', number: '4', mandatory: 'جنازة الرجل' },
  { 
    id: 18, 
    title: 'العيد', 
    number: '2', 
    mandatory: 'فرض',
    type: "جَهْرِيَّة",
    info: "صلاة العيد أو صلاة العيدين و المقصود صلاة عيد الفطر و صلاة عيد الأضحى و هي ركعتان جهريتان.", 
  },
  { 
    id: 19, 
    title: 'الإستسقاء', 
    number: '2', 
    mandatory: 'سنة مؤكدة', 
    type: "جَهْرِيَّة",
    info: "صلاة الإستسقاء هي صلاة نافلة تصلى طلبًا لنزول الغيث (المطر) ليقطع الجفاف أو يقضي حاجة أخرى في نية المصلي. وهي ركعتان تصلَّيان جماعةً بإمام.",
  },
  { 
    id: 20, 
    title: 'الرواتب', 
    number: '12', 
    mandatory: 'سنة مؤكدة',
    type: "سِرِّيَّة",
    info: "السنن الرواتب أو صلاة الرواتب هي السنن التابعة للصلوات الخمس المفروضة، و تصلى إما قبل الفريضة أو بعدها، و هي إثنتا عشر ركعة، ركعتان قبل الفجر و أربع ركعات قبل الظهر و ركعتان بعدها و ركعتان بعد المغرب و ركعتان بعد العشاء.", 
    virtue: [
      {
        title: "سنة الفجر أعظم السنن الرواتب قدرا و أجرا",
        sayings: [
          "قال رسول الله ﷺ : «ركعتا الفجر خير من الدنيا و ما فيها»",
        ],
      },
      {
        title: "بيت في الجنة",
        sayings: [
          "عن أم المؤمنين أم حبيبة رملة بنت أبي سفيان ـ رضي الله عنهما ـ قَالَتْ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: (مَا مِنْ عَبْدٍ مُسْلِمٍ يُصَلِّي لِلَّهِ كُلَّ يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا، غَيْرَ فَرِيضَةٍ، إِلَّا بَنَى اللهُ لَهُ بَيْتًا فِي الْجَنَّةِ، أَوْ إِلَّا بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ). رواه مسلم",
        ],
      },
      {
        title: "",
        sayings: [
          "عن أُمِّ حَبِيبَةَ رَضِيَ اللَّه عَنها قَالَتْ: قالَ رسولُ اللَّهِ ﷺ: (منْ حَافظَ عَلى أَرْبَعِ ركعَاتٍ قَبْلَ الظُّهْرِ، وَأَرْبعٍ بَعْدَهَا، حَرَّمهُ اللَّه عَلَى النَّارَ).",
        ],
      },
    ],
  },
  // { id: 21, title: 'النفل', number: '', mandatory: '' },
  // {
  //   id: 21,
  //   title: "",
  //   number: "",
  //   mandtory: "",
  //   type: "",
  //   info: "",
  //   way: "",
  //   naming: "",
  //   virtue: [
  //     {
  //       title: "",
  //       sayings: [
  //         "",
  //       ],
  //     },
  //   ],
  // }
];
