export const data = [
  {
    id: 1,
    title: "سنن السفر",
    sunan: [
      {
        id: 1,
        title: "إختيار أمير في السفر",
      },
      {
        id: 2,
        title: "التكبير عند الصعود والتسبيح عند النزول",
      },
      {
        id: 3,
        title: "الدعاء حين نزول منزل",
      },
      {
        id: 4,
        title: "البدأ بالمسجد إذا قدم من السفر",
      },
    ],
  },
  {
    id: 2,
    title: "سنن اللباس",
    sunan: [
      {
        id: 1,
        title: "التَّيامُنُ عند لُبسِ الثِّيابِ",
        isFavorite: false,
        desc: "من السنة إذا أراد المسلم أن يلبس نعليه أن يبدأ باليمنى ، ومن السنة إذا أراد أن ينزع نعليه أن يبدأ باليسرى.",
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه أن الرسول صلى الله عليه وسلم قال: "إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ باليَمِينِ، وإذَا نَزَعَ فَلْيَبْدَأْ بالشِّمَالِ، لِيَكُنِ اليُمْنَى أَوَّلَهُما تُنْعَلُ، وَآخِرَهُما تُنْزَعُ".',
          },
          {
            title: 'عن عائشةَ رضي الله عنها، قالت: "كان النبيُّ صلَّى اللهُ عليه وسلَّم يُعجِبُه التيَمُّنُ في تنَعُّلِه، وترَجُّلِه، وطُهورِه، وفي شأنِه كُلِّه"', 
          },
          {
            title: 'عن أبي هُريرةَ رضي الله عنه، قال: قال رَسولُ الله صلَّى اللهُ عليه وسلَّم: "إذا لَبِستُم وإذا توضَّأتُم، فابدَؤوا بأيامِنِكم"',
          },
          {
            title: 'عن حارثةَ بنِ وَهبٍ الخُزاعيِّ، قال: "حَدَّثَتْني حَفصةُ زَوجُ النبيِّ صلَّى اللهُ عليه وسلَّم، أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم كان يَجعَلُ يَمينَه لطعامِه وشَرابِه وثِيابِه، ويجعَلُ شِمالَه لِما سِوى ذلك"',
          },
        ],
      },
      {
        id: 2,
        title: "ما يدعو به من لَبِسَ ثوبًا جديدًا",
        isFavorite: false,
      },
      {
        id: 3,
        title: "ما يقولُ مَن رأَى على أخيه ثوبًا جديدًا",
        isFavorite: false,
      },
      {
        id: 4,
        title: "لُبسُ الأبيضِ مِن الثِّيابِ",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "البِسوا من ثيابِكُمُ البياضَ فإنَّها مِن خيرِ ثيابِكُم، وَكَفِّنوا فيها موتاكم"',
          },
  
        ],
      },
      {
        id: 5,
        title: "لُبسُ الثِّيابِ الجَميلةِ والحَسَنةِ بدونِ إسرافٍ",
        isFavorite: false,
      },
      {
        id: 6,
        title: "التجَمُّلُ للوُفودِ وللجمعةِ",
        isFavorite: false,
      },
      {
        id: 7,
        title: "التواضُعُ في الثِّيابِ",
        isFavorite: false,
      },
      {
        id: 8,
        title: "نظافةُ المَلبَسِ",
        isFavorite: false,
      },
      {
        id: 9,
        title: "ألَّا يمشيَ في نَعلٍ واحدةٍ",
        isFavorite: false,
      },
      {
        id: 10,
        title: "ألَّا يشتملَ الصماءَ",
        isFavorite: false,
      },
      {
        id: 11,
        title: "إستعمال الطيب",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "حُبِّبَ إلي منَ الدُّنيا ، النساءُ ، والطِّيبُ ، وجُعِلَ قرةُ عيني في الصلاةِ"',
          },
          {
            title: 'عن عائشة رضي الله عنها قالت: "... وكانَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ يَشْتَدُّ عليه أنْ يُوجَدَ منه الرِّيحُ..."',
          },
          {
            title: 'عن أنس بن مالك رضي الله عنه قال: "أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَرُدُّ الطِّيبَ"',
          },
        ],
      },
    ],
  },
  {
    id: 3,
    title: "سنن الوضوء",
    sunan: [
      {
        id: 1,
        title: "السواك",
        isFavorite: false,
      },
      {
        id: 2,
        title: "التسمية",
        isFavorite: false,
      },
      {
        id: 3,
        title: "غسل الكفين ثلاثا",
        isFavorite: false,
      },
      {
        id: 4,
        title: "التيامن في غسل اليدين والقدمين",
        isFavorite: false,
      },
      {
        id: 5,
        title: "البدء بالمضمضة والاستنشاق",
        isFavorite: false,
      },
      {
        id: 6,
        title: "المبالغة في المضمضة والاستنشاق لغير الصائم",
        isFavorite: false,
      },
      {
        id: 7,
        title: "المضمضة والاستنشاق من كف واحدة",
        isFavorite: false,
      },
      {
        id: 8,
        title: "في مسح الرأس تسن الصفة المسنونة",
        isFavorite: false,
      },
      {
        id: 9,
        title: "التثليث في غسل الأعضاء",
        isFavorite: false,
      },
      {
        id: 10,
        title: "الدعاء الوارد بعد الوضوء",
        isFavorite: false,
      },
    ],
  },
  {
    id: 4,
    title: "سنن الآذان",
    sunan: [
      {
        id: 1,
        title: "متابعة المؤذن",
        isFavorite: false,
        desc: 'من السنة لمن سمع الأذان أن يقول مثل ما يقول المؤذن ، إلا في الحيعلتين ، فيقول "لا حول ولا قوة إلا بالله"',
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
          },
          {
            id: 2,
            title: 'عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا قالَ المُؤَذِّنُ: الله أكْبَرُ الله أكْبَرُ، فقالَ أحَدُكُمْ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، قالَ: أشْهَدُ أنْ لا إلَهَ إلَّا الله، ثُمَّ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ قالَ: أشْهَدُ أنَّ مُحَمَّدًا رَسولُ اللهِ، ثُمَّ قالَ: حَيَّ علَى الصَّلاةِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: حَيَّ علَى الفَلاحِ، قالَ: لا حَوْلَ ولا قُوَّةَ إلَّا بالله، ثُمَّ قالَ: الله أكْبَرُ الله أكْبَرُ، قالَ: الله أكْبَرُ الله أكْبَرُ، ثُمَّ قالَ: لا إلَهَ إلَّا الله، قالَ: لا إلَهَ إلَّا الله ، مِن قَلْبِهِ دَخَلَ الجَنَّةَ"',
          },
        ]
      },
      {
        id: 2,
        title: "قول الذكر المخصوص بعد الشهادتين",
        isFavorite: false,
      },
      {
        id: 3,
        title: "الصلاة على النبي ﷺ بعد الآذان",
        isFavorite: false,
        desc: "من السنة الصلاة على النبي صلى الله عليه وسلم بعد الأذان",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى الله عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ"',
          },
        ],
      },
      {
        id: 4,
        title: "قول الدعاء الوارد بعد الآذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "مَن قالَ حِينَ يَسْمَعُ النِّدَاءَ: اللَّهُمَّ رَبَّ هذِه الدَّعْوَةِ التَّامَّةِ، والصَّلَاةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ والفَضِيلَةَ، وابْعَثْهُ مَقَامًا مَحْمُودًا الذي وعَدْتَهُ، حَلَّتْ له شَفَاعَتي يَومَ القِيَامَةِ"',
          },
        ],
      },
      {
        id: 5,
        title: "الدعاء بعد الآذان",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عمرو بن العاص رضي الله عنهما قال: أن رجلًا قال: يا رسولَ اللهِ، إن المؤذنين يَفْضِلوننا ؟ فقال رسولُ اللهِ صلى الله عليه وسلم: "قلْ كما يقولون، فإذا انتهيتَ فسلْ تُعْطَه"',
          },
        ],
      },
    ],
  },
  {
    id: 5,
    title: "سنن النوم",
    sunan: [
      {
        id: 1,
        title: "النوم على وضوء",
        isFavorite: false,
      },
      {
        id: 2,
        title:
          "قراءة سورة الإخلاص والمعوذتين قبل النوم مع النفث في الكفين ومسح ما تقدم من جسده ثلاثا",
        isFavorite: false,
      },
      {
        id: 3,
        title: "قراءة الآيتين الأخيرتين من سورة البقرة",
        isFavorite: false,
      },
      {
        id: 4,
        title: "قراءة سورة الكافرون",
        isFavorite: false,
      },
      {
        id: 5,
        title: "وضع اليد اليمنى تحت الخد الأيمن مع الدعاء",
        isFavorite: false,
      },
      {
        id: 6,
        title: "الدعاء عند الإنتباه من النوم",
        isFavorite: false,
      },
      {
        id: 7,
        title: "السواك",
        isFavorite: false,
      },
      {
        id: 8,
        title: "مسح أثر النوم من العينين",
        isFavorite: false,
      },
      {
        id: 9,
        title: "دعاء الإستيقاظ",
        isFavorite: false,
      },
      {
        id: 10,
        title: "الدعاء حين الإستيقاظ أثناء النوم",
        isFavorite: false,
      },
      {
        id: 11,
        title: "التكبير والتسبيح عند المنام",
        isFavorite: false,
      },
    ],
  },
  {
    id: 6,
    title: "سنن الطعام",
    sunan: [
      {
        id: 1,
        title: "التسمية قبل الأكل",
        isFavorite: false,
        desc: "من السنة تسمية الله قبل الأكل",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
          },
          {
            id: 2,
            title: 'عن عائشة رضي الله عنها ، أن رسول الله صلى الله عليه وسلم قال: "إذا أكَل أحَدُكم فَلْيذكُرِ اسمَ اللهِ تعالى، فإن نسِي أن يذكُرَ اسمَ اللهِ تعالى في أوَّلِهِ، فليقُلْ: بسمِ اللهِ أوَّلَهُ وآخِرَهُ"',
          },

        ]
      },
      {
        id: 2,
        title: "الأكل باليمين",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
          },
        ],
      },
      {
        id: 3,
        title: "الأكل مما يلي",
        isFavorite: false,
        desc: "من السنة الأكل مما يلي",
        ahadith: [
          {
            id: 1,
            title: 'عن عمر بن أبي سلمة رضي الله عنه قال: كُنْتُ غُلَامًا في حَجْرِ رَسولِ الله صَلَّى اللهُ عليه وسلَّمَ، وكَانَتْ يَدِي تَطِيشُ في الصَّحْفَةِ، فَقالَ لي رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: "يا غُلَامُ، سَمِّ اللَّهَ، وكُلْ بيَمِينِكَ، وكُلْ ممَّا يَلِيكَ" فَما زَالَتْ تِلكَ طِعْمَتي بَعْدُ.',
          },
        ],
      },
      {
        id: 4,
        title: "أخذ اللقمة الساقطة، وإماطة ما بها من أذى، وأكلها",
        isFavorite: false,
        desc: "من السنة أخذ اللقمة الساقطة وإماطة ما بها من أذى وأكلها",
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
          },
        ]
      },
      {
        id: 5,
        title: "لعق الأصابع",
        isFavorite: false,
        desc: "من السنة لعق الأصابع أو إلعاقها",
        ahadith: [
          {
            id: 1,
            title: 'عن عبد الله بن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال: "إذا أكَلَ أحَدُكُمْ فلا يَمْسَحْ يَدَهُ حتَّى يَلْعَقَها أوْ يُلْعِقَها"',
          },
          {
            id: 2,
            title: 'عن جابر بن عبد الله رضي الله عنه قال: سمعت النبي صلى الله عليه وسلم يقول: "إنَّ الشَّيْطانَ يَحْضُرُ أحَدَكُمْ عِنْدَ كُلِّ شيءٍ مِن شَأْنِهِ، حتَّى يَحْضُرَهُ عِنْدَ طَعامِهِ، فإذا سَقَطَتْ مِن أحَدِكُمُ اللُّقْمَةُ، فَلْيُمِطْ ما كانَ بها مِن أذًى، ثُمَّ لِيَأْكُلْها، ولا يَدَعْها لِلشَّيْطانِ، فإذا فَرَغَ فَلْيَلْعَقْ أصابِعَهُ؛ فإنَّه لا يَدْرِي في أيِّ طَعامِهِ تَكُونُ البَرَكَةُ"',
          },
          {
            id: 3,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',         
          },
        ]
      },
      {
        id: 6,
        title: "سلت القصعة",
        isFavorite: false,
      },
      {
        id: 7,
        title: "الأكل بثلاث أصابع",
        isFavorite: false,
        desc: "من السنة الأكل بثلاث أصابع",
        ahadith: [
          {
            id: 1,
            title: 'عن كعب بن مالك رضي الله عنه قال: "كانَ رَسولُ اللهِ صَلَّى الله عليه وَسَلَّمَ يَأْكُلُ بثَلَاثِ أَصَابِعَ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا"',         
          },
        ]
      },
      {
        id: 8,
        title: "التنفس خارج الإناء ثلاثا",
        isFavorite: false,
      },
      {
        id: 9,
        title: "حمد الله تعالى بعد الطعام",
        isFavorite: false,
        desc: "من السنة حمد الله تعالى بعد الطعام",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إنَّ اللَّهَ لَيَرْضَى عَنِ العَبْدِ أَنْ يَأْكُلَ الأكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا"',
          },
        ],
      },
      {
        id: 10,
        title: "الإجتماع على الطعام",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن جابر بن عبد الله رضي الله عنهما قال: سمعت رسول الله صلى الله عليه وسلم يقول: "طَعامُ الرَّجُلِ يَكْفِي رَجُلَيْنِ، وطَعامُ رَجُلَيْنِ يَكْفِي أرْبَعَةً، وطَعامُ أرْبَعَةٍ يَكْفِي ثَمانِيَةً"',
          },
        ]
      },
      {
        id: 11,
        title: "مدح الطعام إذا أعجبه",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
      {
        id: 12,
        title: "الدعاء لصاحب الطعام",
        isFavorite: false,
         ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
      {
        id: 13,
        title: "إستحباب أن يسقي الشارب من على يمينه قبل يساره",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
      {
        id: 14,
        title: "ساقي القوم آخرهم شربا",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
      {
        id: 15,
        title: "تغطية الإناء وذكر اسم الله تعالى عند قدوم الليل",
        isFavorite: false,
         ahadith: [
          {
            id: 1,
            title: ""
          },
        ],
      },
    ],
  },
  {
    id: 7,
    title: "سنن التثاؤب",
    sunan: [
      {
        id: 1,
        title: "كظم الفم عند التثاؤب أو رده باليد",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: عن النبي صلى الله عليه وسلم قال: "إنَّ اللَّهَ يُحِبُّ العُطاسَ، ويَكْرَهُ التَّثاؤُبَ، فإذا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ علَى كُلِّ مُسْلِمٍ سَمِعَهُ أنْ يُشَمِّتَهُ، وأَمَّا التَّثاؤُبُ: فإنَّما هو مِنَ الشَّيْطانِ، فَلْيَرُدَّهُ ما اسْتَطاعَ، فإذا قالَ: ها، ضَحِكَ منه الشَّيْطانُ"',
          }
        ]
      },
      {
        id: 2,
        title: "عدم رفع الصوت في التثائب",
        isFavorite: false,
      },
    ],
  },
  {
    id: 8,
    title: "سنن العطاس",
    sunan: [
      {
        id: 1,
        title: 'يسن للعاطس أن يقول: "الحمد لله"',
        isFavorite: false,
        desc: "من السنة أن يقول العاطس الحمد لله",
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا عَطَسَ أحَدُكُمْ فَلْيَقُلِ: الحَمْدُ لِلَّهِ، ولْيَقُلْ له أخُوهُ -أوْ صاحِبُهُ-: يَرْحَمُكَ اللَّهُ، فإذا قالَ له: يَرْحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ ويُصْلِحُ بالَكُمْ"',
          },
        ]
      },
      {
        id: 2,
        title: "لا يشمت العاطس إذا لم يحمد الله تعالى",
        isFavorite: false,
        desc: "من السنة عدم تشميت العاطس إذا لم يقل الحمد لله",
        ahadith: [
          {
            id: 1,
            title: 'عن أنس بن مالك رضي الله عنه قال: "عطَس رجلانِ عند النَّبيِّ صلَّى اللهُ عليه وسلَّم، فشَمَّت أحدَهما وتَرك الآخَرَ، قال: فقيل: يا رسولَ اللهِ، رجلان عَطَسا فشَمَّتَّ أحدَهما وتركتَ الآخَرَ؟ فقال: إنَّ هذا حَمِدَ الله، وإنَّ هذا لم يحمَدِ اللهَ"',
          },
          {
            id: 2,
            title: 'عن أبي موسى الأشعري رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "إذا عطَسَ أحدُكُم فحمِدَ اللهَ فشمِّتُوهُ ، و إذا لَم يحمَدِ اللهَ فلا تُشمِّتُوهُ"',
          },
        ]
      },
    ],
  },
  {
    id: 9,
    title: "سنن السلام واللقاء والمجالسة",
    sunan: [
      {
        id: 1,
        title: "إلقاء السلام",
        isFavorite: false,
      },
      {
        id: 2,
        title: "تكرار السلام ثلاثا، إن دعت الحاجة لذلك",
        isFavorite: false,
      },
      {
        id: 3,
        title: "تعميم السلام على من تعرف وعلى من لا تعرف",
        isFavorite: false,
      },
      {
        id: 4,
        title: "إبتداء السلام ممن جاءت السنة بابتدائه",
        isFavorite: false,
      },
      {
        id: 5,
        title: "السلام على الصبيان",
        isFavorite: false,
      },
      {
        id: 6,
        title: "السلام عند دخول البيت",
        isFavorite: false,
      },
      {
        id: 7,
        title: "خفض الصوت بالسلام عند الدخول إلى قوم وفيهم نائمون",
        isFavorite: false,
      },
      {
        id: 8,
        title: "تبليغ السلام",
        isFavorite: false,
      },
      {
        id: 9,
        title: "السلام عند دخول المجلس وعند مفارقته",
        isFavorite: false,
      },
      {
        id: 10,
        title: "المصافحة مع السلام عند اللقيا",
        isFavorite: false,
      },
      {
        id: 11,
        title: "التبسم وطلاقة الوجه عند اللقاء",
        isFavorite: false,
      },
      {
        id: 12,
        title: "الكلمة الطيبة فهي صدقة",
        isFavorite: false,
      },
      {
        id: 13,
        title: "ذكر الله تعالى في المجلس",
        isFavorite: false,
      },
      {
        id: 14,
        title: "ختم المجلس بكفارة المجلس",
        isFavorite: false,
      },
    ],
  },
  {
    id: 10,
    title: "سنن الذهاب إلى المسجد",
    sunan: [
      {
        id: 1,
        title: "التبكير بالذهاب إلى المسجد",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
          },
        ]
      },
      {
        id: 2,
        title: "أن يخرج من بيته متطهرا لتكتب خطاه",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "صَلَاةُ الرَّجُلِ في جَمَاعَةٍ تَزِيدُ علَى صَلَاتِهِ في بَيْتِهِ، وَصَلَاتِهِ في سُوقِهِ، بضْعًا وَعِشْرِينَ دَرَجَةً، وَذلكَ أنَّ أَحَدَهُمْ إذَا تَوَضَّأَ فأحْسَنَ الوُضُوءَ، ثُمَّ أَتَى المَسْجِدَ لا يَنْهَزُهُ إلَّا الصَّلَاةُ، لا يُرِيدُ إلَّا الصَّلَاةَ، فَلَمْ يَخْطُ خَطْوَةً إلَّا رُفِعَ له بهَا دَرَجَةٌ، وَحُطَّ عنْه بهَا خَطِيئَةٌ، حتَّى يَدْخُلَ المَسْجِدَ، فَإِذَا دَخَلَ المَسْجِدَ كانَ في الصَّلَاةِ ما كَانَتِ الصَّلَاةُ هي تَحْبِسُهُ، وَالْمَلَائِكَةُ يُصَلُّونَ علَى أَحَدِكُمْ ما دَامَ في مَجْلِسِهِ الذي صَلَّى فيه يقولونَ: اللَّهُمَّ ارْحَمْهُ، اللَّهُمَّ اغْفِرْ له، اللَّهُمَّ تُبْ عليه، ما لَمْ يُؤْذِ فِيهِ، ما لَمْ يُحْدِثْ فِيهِ"',
          },
        ]
      },
      {
        id: 3,
        title: "أن يخرج للصلاة بسكينة ووقار",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي هريرة رضي الله عنه: عن النبي صلى الله عليه وسلم قال: "إذا سمعتُم الإقامةَ فامشُوا إلى الصلاةِ وعليكم السَّكينةَ والوقارَ ولا تُسرِعوا ، فما أدركتُم فصلُّوا ، وما فاتَكم فأتِمُّوا"',
          },
        ],
      },
      {
        id: 4,
        title: "تقديم الرجل اليمنى عند الدخول إلى المسجد وتقديم اليسرى عند الخروج منه",
        isFavorite: false,
        ahadith: [
          {
            title: "",
          }
        ],
      },
      {
        id: 5,
        title: "قول الذكر عند دخول المسجد وعند الخروج منه",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي حميد أو أبي أسيد الساعدي رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: "إذا دَخَلَ أحَدُكُمُ المَسْجِدَ، فَلْيَقُلِ: اللَّهُمَّ افْتَحْ لي أبْوابَ رَحْمَتِكَ، وإذا خَرَجَ، فَلْيَقُلِ: اللَّهُمَّ إنِّي أسْأَلُكَ مِن فَضْلِكَ"',
          }
        ],
      },
      {
        id: 6,
        title: "صلاة ركعتين تحية للمسجد",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن أبي قتادة الحارث بن ربعي رضي الله عنه قال: قال النبي صلى الله عليه وسلم: "إذا دخَل أحدُكم المسجدَ فلا يَجلِسْ حتى يصلِّيَ ركعتَين"',
          }
        ],
      },
      {
        id: 7,
        title: "مبادرة الرجال إلى الصف الأول",
        isFavorite: false,
        ahadith: [
          {
            id: 1,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "خَيْرُ صُفُوفِ الرِّجالِ أوَّلُها، وشَرُّها آخِرُها، وخَيْرُ صُفُوفِ النِّساءِ آخِرُها، وشَرُّها أوَّلُها"',
          },
          {
            id: 2,
            title: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "لَوْ يَعْلَمُ النَّاسُ ما في النِّدَاءِ وَالصَّفِّ الأوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلَّا أَنْ يَسْتَهِمُوا عليه لَاسْتَهَمُوا، ولو يَعْلَمُونَ ما في التَّهْجِيرِ لَاسْتَبَقُوا إِلَيْهِ، ولو يَعْلَمُونَ ما في العَتَمَةِ وَالصُّبْحِ لَأَتَوْهُما ولو حَبْوًا"',
          },
        ],
      },
      {
        id: 8,
        title: "أن يكون المأموم قريبا من إمامه",
        isFavorite: false,
        ahadith: [
          {
            title: 'عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "ليلينِّي منكم أولو الأحلامِ والنُّهى ثمَّ الَّذينَ يلونَهُم ثمَّ الَّذينَ يلونَهُم ولا تختلِفوا فتختلفَ قلوبُكُم وإيَّاكم وَهَيشاتِ الأسواقِ"',
          },
        ],
      },
    ],
  },
  {
    id: 11,
    title: "سنن الصيام",
    sunan: [
      {
        id: 1,
        title: "إجتناب المحرمات",
        isFavorite: false,
      },
      {
        id: 2,
        title: "إجتناب الرفث والصخب",
        isFavorite: false,
      },
      {
        id: 3,
        title: "دعاء الإفطار",
        isFavorite: false,
      },
      {
        id: 4,
        title: "تعجيل الفطور",
        isFavorite: false,
      },
      {
        id: 5,
        title: "السحور",
        isFavorite: false,
      },
      {
        id: 6,
        title: "تأخير السحور",
        isFavorite: false,
      },
      {
        id: 7,
        title: "تفطير الصائمين",
        isFavorite: false,
      },
      {
        id: 8,
        title: "الفطر على تمر",
        isFavorite: false,
      },
      {
        id: 9,
        title: "قيام رمضان",
        isFavorite: false,
      },
      {
        id: 10,
        title: "الإكثار من قراءة القرآن",
        isFavorite: false,
      },
      {
        id: 11,
        title: "الإعتكاف في مسجد في العشر الأواخر",
        isFavorite: false,
      },
      {
        id: 12,
        title: "الإكثار من الدعاء خصوصا في العشر الأواخر",
        isFavorite: false,
      },
      {
        id: 13,
        title: "الإجتهاد في جميع أنواع العبادات",
        isFavorite: false,
      },
      {
        id: 14,
        title: "عدم السب والقتال",
        isFavorite: false,
      },
      {
        id: 15,
        title: "الغمرة في رمضان",
        isFavorite: false,
      },
    ],
  },
  {
    id: 12,
    title: "سنن يوم الجمعة",
    sunan: [
      {
        id: 1,
        title: "التطيب والغسل",
        isFavorite: false,
      },
      {
        id: 2,
        title: "لبس الجميل",
        isFavorite: false,
      },
      {
        id: 3,
        title: "الإنصات إلى الخطبة",
        isFavorite: false,
      },
      {
        id: 4,
        title: "كثرة الصلاة على الرسول ﷺ",
        isFavorite: false,
      },
      {
        id: 5,
        title: "التبكير إلى المسجد",
        isFavorite: false,
      },
      {
        id: 6,
        title: "السواك",
        isFavorite: false,
      },
      {
        id: 7,
        title: "قراءة سورة الكهف",
        isFavorite: false,
      },
      {
        id: 8,
        title: "الدعاء ساعة الإجابة",
        isFavorite: false,
      },
    ],
  },
  {
    id: 14,
    title: "سنن الصلاة",
    sunan: [
      {
        id: 1,
        title: "السترة وسننها",
        isFavorite: false,
      },
      {
        id: 2,
        title: "سنن القيام",
        isFavorite: false,
      },
      {
        id: 3,
        title: "سنن الركوع",
        isFavorite: false,
      },
      {
        id: 4,
        title: "الرفع من الركوع",
        isFavorite: false,
      },
      {
        id: 5,
        title: "سنن السجود",
        isFavorite: false,
      },
      {
        id: 6,
        title: "سنن الجلسة بين السجدتين",
        isFavorite: false,
      },
      {
        id: 7,
        title: "سنن التشهد",
        isFavorite: false,
      },
      {
        id: 8,
        title: "أذكار بعد الصلاة",
        isFavorite: false,
      },
    ],
  },
  {
    id: 15,
    title: "سنن الخلاء",
    sunan: [
      {
        id: 1,
        title: "قول الذكر الوارد عند عند دخول الخلاء والخروج منه",
      },
    ],
  },
  {
    id: 16,
    title: "سنن الدعاء",
    sunan: [
      {
        id: 1,
        title: "الدعاء على طهارة",
        isFavorite: false,
      },
      {
        id: 2,
        title: "إستقبال القبلة",
        isFavorite: false,
      },
      {
        id: 3,
        title: "رفع اليدين",
        isFavorite: false,
      },
      {
        id: 4,
        title: "البدء بالثناء على الله عز وجل والصلاة على رسوله ﷺ",
        isFavorite: false,
      },
      {
        id: 5,
        title: "دعاء الله تعالى بأسمائه الحسنى",
        isFavorite: false,
      },
      {
        id: 6,
        title: "تكرار الدعاء والإلحاح فيه",
        isFavorite: false,
      },
      {
        id: 7,
        title: "إخفاء الدعاء",
        isFavorite: false,
      },
      {
        id: 8,
        title: "ماذا أقول في الدعاء ؟",
        isFavorite: false,
      },
      {
        id: 9,
        title: "الدعوة لأخيه بظهر الغيب",
        isFavorite: false,
      },
    ],
  },
  // {
  //   id: 17,
  //   title: "سنن السفر",
  // },
];
