export const data = [
  {
    id: 1,
    title: "الإسلام",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "كم عدد أركان الإسلام؟",
            options: ["5", "4", "7"],
            answer: "5",
            just: 
              "عدد أركان الإسلام 5"
              + "\n" +
              "عن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: سمعتُ رسول الله -صلى الله عليه وسلم- يقول: «بُني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، والحج، وصوم رمضان»"
          },      
          {
            ques: "كم عدد أركان الإيمان؟",
            options: ["4", "5", "6"],
            answer: "6",
            just:
              "عدد أركان الإيمان 6"
              + "\n" +
              "الإيمان بالله"
              + "\n" +
              "الإيمان بالملائكة"
              + "\n" +
              "الإيمان بالكتب السماوية"
              + "\n" +
              "الإيمان بالأنبياء والرسل"
              + "\n" +
              "الإيمان باليوم الآخر"
              + "\n" +
              "الإيمان بالقضاء وبالقدر خيره وشره"
          },
          {
            ques: "الخبيئة : هي عمل صالح خفي لا يعلم به إلا الله سبحانه وتعالى وحده",
            options: ["صح", "خطأ"],
            answer: "صح",
          },
          {
            ques: "واحد من هذه الاختيارات ليس من سُنن يوم الجمعة فما هو؟",
            options: ["الاغتسال", "التطيّب والسواك", "صلة الرحم"],
            answer: "صلة الرحم",
          },
          {
            ques: "ما هي أعظم فتنة تمر على البشريّة؟",
            options: ["المسيح الدجال", "يأجوج ومأجوج", "الدنيا"],
            answer: "المسيح الدجال",
            just: ""
          },
          {
            ques: 'هل "الساتر" اسم من أسماء الله سبحانه وتعالى أم صفة؟',
            options: ["اسم", "صفة"],
            answer: "صفة",
            just: ""
          },    
          {
            ques: 'أطول الناس أعناقا يوم القيامة؟',
            options: ['المؤذنون', 'الصائمون', 'الصابرون'],
            answer: 'المؤذنون',
            just: ""
          },   
          {
            ques: 'ما حكم رفع اليدين في دعاء يوم الجمعة؟',
            options: ['يجوز والأفضل عدم الرفع', 'لا يجوز مطلقا', 'مستحب'],
            answer: 'يجوز والأفضل عدم الرفع',
          },
          {
            ques: 'من هو أول شخص آمن بالنبي محمد ﷺ؟',
            options: ['أبو بكر الصديق', 'خديجة بنت خويلد', 'معاذ بن جبل'],
            answer: 'خديجة بنت خويلد',
            just: "أول من آمن من النساء والرجال بالنبي محمد ﷺ هي السيدة خديجة بنت خويلد رضي الله عنها."
          },  
          {
            ques: 'المسافة بين الأرض والسماء تقدر بـ:',
            options: ['مئة سنة', 'خمس سنوات', 'خمسمائة سنة'],
            answer: 'خمسمائة سنة',
            just: ""
          }, 
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'ما هي الغزوة التي وقعت في رمضان؟',
            options: ['غزوة بدر', 'غزوة الخندق', 'غزوة بني قينقاع'],
            answer: 'غزوة بدر',
            just: 
              "الغزوة التي وقعت في رمضان هي غزوة بدر الكبرى التي وقعت في صبيحة يوم الجمعة 17 رمضان من العام الثاني للهجرة (2 ه) الموافق ل 13 مارس 624م"
          },   
          {
            ques: 'ما هي الأرض التي سماها الرسول ﷺ بأرض الصدق؟',
            options: ['الحبشة', 'مكة', 'المدينة المنورة'],
            answer: 'الحبشة'
          },
          {
            ques: 'ما اسم خازن جهنم؟',
            options: ['مالك', 'جبرائيل', 'رضوان'],
            answer: 'مالك',
            just: 
              "إسم خازن جهنم هو مالك."
              + "\n" +
              "قال الله تعالى في سورة الزخرف في الآية 77:"
              + "\n" +
              "٦٧۝ وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُم مَّاكِثُونَ ٧٧۝"
          },
          {
            ques: "ما هي الأرض المباركة؟",
            options: ["العراق", "الشام", "مصر"],
            answer: "الشام"
          },
          {
            ques: 'متى هو وقت العشي؟',
            options: [
              'من الظهر إلى المغرب',
              'من الفجر إلى الضحى',
              'من الضحى إلى الظهر'
            ],
            answer: 'من الظهر إلى المغرب'
          },
          {
            ques: 'ما معنى الأنفال؟',
            options: ['الزيادة', 'النقصان', 'العدل'],
            answer: 'الزيادة',
          },
          {
            ques: 'كلمتان خفيفتان على اللِّسَان ثقيلتان فِي الْمِيزَان حبيبتان إِلَى الرَّحْمَن',
            options: [
              'سبحان الله ولا إله إلا الله',
              'الحمد لله والله أكبر',
              'سبحان الله وبحمده سبحان الله العظيم',
            ],
            answer: 'سبحان الله وبحمده سبحان الله العظيم',
            just: 'عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال: "كَلِمَتَانِ خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن: سبحان الله وبحمده، سبحان الله العظيم".'
          },
          {
            ques: 'كم عدد أسماء الله الحسنى المعروفة؟',
            options: ['100', '99', '90'],
            answer: '99'
          },
          {
            ques: 'كم عدد أبواب الجنة؟',
            options: ['8', '7', '6', '5',],
            answer: '8',
            just: 
              "عدد أبواب الجنة 8."
              + "\n" +
              "قال رسول الله صلى الله عليه وسلم: (فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ)"
          },
          {
            ques: 'كم عدد أبواب جهنم؟',
            options: ['8', '7', '6', '5'],
            answer: '7',
            just: 
              "عدد أبواب جهنم 7."
              + "\n" +
              "قال الله عز وجل في سورة الحجر في الآية 43 و 44:"
              + "\n" +
              "٢٤۝ وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ ٣٤۝ لَهَا سَبْعَةُ أَبْوَابٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ ٤٤۝"
          },
        ],
      },
    ],
  },

  {
    id: 2,
    title: "القرآن الكريم",
    img: require("./assets/Quran.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "ما إسم السورة التي في بدايتها ونهايتها تسبيح؟",
            options: [
              "سورة الحشر",
              "سورة النور",
              "سورة الرحمن",
              "سورة الملك"
            ],
            answer: "سورة الحشر",
            just: 
              "السورة التي في بدايتها ونهايتها تسبيح هي سورة الحشر." 
              + "\n" + 
              "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (١)"
              + "\n" + 
              "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (٢٤)"
          },      
          {
            ques: "ما هي أطول سورة في القرآن الكريم؟",
            options: [
              "سورة آل عمران",
              "سورة الأعراف",
              "سورة الشعراء",
              "سورة البقرة",
            ],
            answer: "سورة البقرة",
            just: 
              "أطول سورة في القرآن الكريم هي سورة البقرة." 
              + "\n" + 
              "عدد آياتها: 286"
              + "\n" + 
              "عدد كلماتها: 6144" 
              + "\n" + 
             "عدد حروفها: 25613"
          },
          {
            ques: "ما هي أصغر سورة في القرآن الكريم؟",
            options: [
              "سورة الإخلاص", 
              "سورة الكوثر", 
              "سورة العصر",
            ],
            answer: "سورة الكوثر",
            just: 
              "أصغر سورة في القرآن الكريم هي سورة الكوثر."
              + "\n" + 
              "إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ ١۝ فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ ٢۝ إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ ٣۝"
              + "\n" + 
              "عدد آياتها: 3"
              + "\n" + 
              "عدد كلماتها: 10"
              + "\n" + 
              "عدد حروفها: 42"
          },
          {
            ques: "ما هي السورة التي ذكر فيها شهر رمضان؟",
            options: [
              "سورة البقرة", 
              "سورة الأنعام", 
              "سورة المائدة", 
              "سورة النساء",
            ],
            answer: "سورة البقرة",
            just:
              "السورة التي ذكر فيها شهر رمضان هي سورة البقرة في الآية 185"
              + "\n" + 
              "شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ﴿١٨٥﴾"
          },      
          {
            ques: "ما هي السورة التي ذكر فيها الله في كل آياتها؟",
            options: [
              "سورة الأنفال", 
              "سورة المجادلة", 
              "سورة التوبة",
              "سورة يونس",
            ],
            answer: "سورة المجادلة",
            just: "السورة التي ذكر فيها الله في كل آياتها هي سورة المجادلة، حيث ذكرت كلمة الله في كل من الواحد والعشرين آية",
          },
          {
            ques: "ما هي السورة التي فيها سجدتين؟",
            options: [
              "سورة يوسف",
              "سورة الرعد",
              "سورة هود",
              "سورة الحج",
            ],
            answer: "سورة الحج",
            just: "السورة التي فيها سجدتين هي سورة الحج، في الآية 18 والآية 77"
              + "\n" + 
              "الآية 18"
              + "\n" + 
              "﴿ أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَن فِي السَّمَاوَاتِ وَمَن فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِّنَ النَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ ۗ وَمَن يُهِنِ اللَّهُ فَمَا لَهُ مِن مُّكْرِمٍ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ۩﴾ "
              + "\n" + 
              "الآية 77"
              + "\n" + 
              "﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ ۩﴾"
          },
          {
            ques: "ما هي السورة التي لا يوجد فيها حرف الميم ؟",
            options: [
              "سورة إبراهيم", 
              "سورة النحل", 
              "سورة الكوثر", 
              "سورة الحجر",
            ],
            answer: "سورة الكوثر",
            just: "السورة التي لا يوجد فيها حرف الميم هي سورة الكوثر" 
            + "\n" + 
            "إِنَّآ أَعۡطَيۡنَٰكَ ٱلۡكَوۡثَرَ ١۝ فَصَلِّ لِرَبِّكَ وَٱنۡحَرۡ ٢۝ إِنَّ شَانِئَكَ هُوَ ٱلۡأَبۡتَرُ ٣۝"
          },      
          {
            ques: "من أكثر نبي ذكر في القرآن الكريم؟",
            options: [
              "آدم عليه السلام", 
              "عيسى عليه السلام", 
              "موسى عليه السلام", 
              "محمد ﷺ",
            ],
            answer: "موسى عليه السلام",
            just: 'أكثر نبي ذكر في القرآن الكريم هو موسى عليه السلام حيث ذكر إسم "موسى" 136 مرة في القرآن الكريم'
          },      
          {
            ques: "كم عدد سور القرآن الكريم؟",
            options: [
              "114", 
              "113", 
              "115",
              "112",
            ],
            answer: "114",
            just: "عدد سور القرآن الكريم 114 سورة" 
          },      
          {
            ques: "أول نبي ذُكرت قصته في القرآن الكريم",
            options: [
              "هود عليه السلام", 
              "نوح عليه السلام", 
              "آدم عليه السلام",
            ],
            answer: "آدم عليه السلام",
            just: "أول نبي ذكرت قصته في القرآن هو آدم عليه السلام",
          }, 
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'ما هي السورة التي فيها سجدتين؟',
            options: [
              'سورة السجدة',    
              'سورة الحج', 
              'سورة آل عمران',
              'سورة الإسراء', 
            ],
            answer: 'سورة الحج',
          },  
          {
            ques: "ما هي السورة التي لا تبدأ بالبسملة؟",
            options: [
              "سورة التوبة", 
              "سورة الأنبياء", 
              "سورة المؤمنون",
              "سورة النور",
            ],
            answer: "سورة التوبة",
            just: 
            "السورة الوحيدة التي لا تبدأ بالبسملة هي سورة التوبة، حيث تبدأ سورة التوبة هكذا:"
              + "\n\n" + 
              "بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ ١۝"
          },
          {
            ques: "ما هي السورة التي تعدل ثلث القرآن؟",
            options: [
              "سورة الشعراء", 
              "سورة الفرقان", 
              "سورة الإخلاص",
              "سورة البقرة", 
            ],
            answer: "سورة الإخلاص",
            just: "السورة التي تعدل ثلث القرآن هي سورة الإخلاص, حيث أخبر رسول الله ﷺ في العديد من أحاديثه أنّ قراءة سورة الإخلاص تعدل ثلث القرآن، ومن هذه الأحاديث ما يأتي:"
              + "\n\n" + 
              "ما ثبت عن أبي سعيد الخدري رضي الله عنه قال: (أنَّ رَجُلًا سَمِعَ رَجُلًا يَقْرَأُ {قُلْ هُوَ اللَّهُ أَحَدٌ} يُرَدِّدُها، فَلَمَّا أصْبَحَ جاءَ إلى رَسولِ اللَّهِ ﷺ، فَذَكَرَ ذلكَ له، وكَأنَّ الرَّجُلَ يَتَقالُّها، فقالَ رَسولُ اللَّهِ ﷺ: والذي نَفْسِي بيَدِهِ، إنَّها لَتَعْدِلُ ثُلُثَ القُرْآنِ)."
              + "\n\n" + 
              "قول رسول الله ﷺ: (احْشُدُوا، فإنِّي سَأَقْرَأُ علَيْكُم ثُلُثَ القُرْآنِ، فَحَشَدَ مَن حَشَدَ، ثُمَّ خَرَجَ نَبِيُّ اللهِ ﷺ، فَقَرَأَ: {قُلْ هو اللَّهُ أحَدٌ}، ثُمَّ دَخَلَ، فقالَ بَعْضُنا لِبَعْضٍ: إنِّي أُرَى هذا خَبَرٌ جاءَهُ مِنَ السَّماءِ فَذاكَ الذي أدْخَلَهُ، ثُمَّ خَرَجَ نَبِيُّ اللهِ ﷺ، فقالَ: إنِّي قُلتُ لَكُمْ سَأَقْرَأُ علَيْكُم ثُلُثَ القُرْآنِ، ألا إنَّها تَعْدِلُ ثُلُثَ القُرْآنِ)"
          },      
          {
            ques: "ما هي السورة التي أمر فيها النبي بالدعوة؟",
            options: [
              "سورة المدثر", 
              "سورة الروم", 
              "سورة القصص",
              "سورة العنكبوت",
            ],
            answer: "سورة المدثر",
          },     
          {
            ques: "ما هي السورة التي ذكرت فيها البسملة مرتين ؟",
            options: [
              "سورة الأنعام", 
              "سورة التوبة", 
              "سورة النمل",
              "سورة لقمان",
            ],
            answer: "سورة النمل",
            just: "السورة التي ذكرت فيها البسملة مرتين هي سورة النمل، حيث توجد البسملة في بداية السورة وفي وسطها في الآية 30."
              + "\n\n" + 
              "٩٢۝ إِنَّهُ مِنْ سُلَيْمَانَ وَإِنَّهُ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ ٠٣۝"
          },
          {
            ques: "في أي شهر نزل القرآن الكريم؟",
            options: ["رجب", "رمضان", "شعبان"],
            answer: "رمضان",
            just: "نزل القرآن الكريم في شهر رمضان، حيث قال الله تعالى في سورة البقرة في الآية 185:"
             + "\n\n" + 
             "٤٨١۝ شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ٥٨١۝"
             + "\n\n" + 
             "وقال الله عز وجل في سورة القدر في الآية 1:"
             + "\n" + 
             "إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ ١۝"
             + "\n\n" + 
             "وقال الله عز وجل في سورة الدخان من الآية 1 إلى 3:"
             + "\n" + 
             "حم ١۝ وَالْكِتَابِ الْمُبِينِ ٢۝ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ ٣۝"
          },
          {
            ques: 'كم مرة ذكر شهر رمضان في القرآن الكريم؟',
            options: ['مرة', 'مرتان', 'خمسة مرات'],
            answer: 'مرة',
            just: "ذكر شهر رمضان مرة واحدة في القرآن الكريم في سورة البقرة في الآية 185:"
              + "\n\n" + 
              "٤٨١۝ شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ ۚ فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ ۖ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ ۗ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ٥٨١۝"
          }, 
          {
            ques: 'ما أول سورة نزلت بعد الهجرة؟',
            options: [
              'سورة البقرة', 
              'سورة فاطر', 
              'سورة الأحزاب',
              'سورة سبأ',
            ],
            answer: 'سورة البقرة'
          },
          {
            ques: 'ما هي السورة التي فيها تقسيم الميراث؟',
            options: [
              'سورة يس', 
              'سورة النساء', 
              'سورة الصافات',
              'سورة ص',
            ],
            answer: 'سورة النساء',
          },
          {
            ques: 'ما هي أطول آية في القرآن الكريم؟',
            options: ['آية الدين', 'آية الكرسي'],
            answer: 'آية الكرسي',
            just: "أطول آية في القرآن الكريم هي آية الكرسي وهي الآية 255 من سورة البقرة:" 
              + "\n\n" + 
              "٤٥٢۝ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢۝"
          },
        ],
      },
      {
        title: "إختبار 3",
        id: 3,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "ما هو اليوم المشهود الذي ذكر في القرآن الكريم؟",
            options: ["يوم عرفة", "يوم الجمعة", "يوم القيامة"],
            answer: "يوم القيامة",
          },
          {
            ques: 'في أي سورة ذكر الغراب في القرآن الكريم؟',
            options: [
              'سورة الزخرف', 
              'سورة المائدة', 
              'سورة الدخان',
              'سورة غافر',
            ],
            answer: 'سورة المائدة',
            just: "ذكر الغراب في سورة المائدة في الآية 31:"
              + "\n\n" + 
              "٠٣۝ فَبَعَثَ اللهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ ۚ قَالَ يَا وَيْلَتَا أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي ۖ فَأَصْبَحَ مِنَ النَّادِمِينَ ١٣۝"
          },
          {
            ques: 'ما هي السورة التي ورد فيها لفظ البصل في القرآن الكريم؟',
            options: [
              'سورة البقرة', 
              'سورة آل عمران', 
              'سورة المائدة',
            ],
            answer: 'سورة البقرة',
            just: "السورة التي ورد فيها لفظ البصل في القرآن الكريم هي سورة البقرة في الآية 61:"
              + "\n\n" + 
              "٠٦۝ وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ مِن بَقْلِهَا وَقِثَّائِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَىٰ بِالَّذِي هُوَ خَيْرٌ ۚ اهْبِطُوا مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَاءُوا بِغَضَبٍ مِّنَ اللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ الْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا وَّكَانُوا يَعْتَدُونَ ١٦۝"
          },
          {
            ques: 'معنى الفَلَق في قوله تعالى: { قُل أَعوذُ بِرَبِّ الفَلَقِ(١) مِن شَرِّ ما خَلَقَ }؟',
            options: ['النجوم', 'الصبح', 'السفن'],
            answer: 'الصبح',
          },
          {
            ques: 'ما معنى ( وَنَمَارِقُ مَصْفُوفَةٌ ) ؟',
            options: ['سرائر', 'أباريق', 'وسائد'],
            answer: 'أباريق',
          },
          {
            ques: 'كم مرة تم فيها ذكر حيوان "العجل" في سورة البقرة؟',
            options: [
              '4 مرات',
              '6 مرات',
              '3 مرات',
            ],
            answer: '4 مرات',
            just: 'تم ذكر حيوان "العجل" في سورة البقرة أربع مرات، في الآيات 51، 54, 92, 93',
          },
          {
            ques: 'كم مرة تم فيها ذكر حيوان "العجل" في القرآن الكريم؟',
            options: [
              '4 مرات',
              '6 مرات',
              '3 مرات'
            ],
            answer: '6 مرات',
            just: 'تم ذكر حيوان "العجل" في القرآن الكريم ست مرات، أربع مرات في سورة البقرة في الآيات 51 و 54 و 92 و 93، ومرة في سورة النساء في الآية 153، ومرة في سورة الأعراف في الآية 152'
          },
          {
            ques: 'كم عدد حملة العرش كما ذكر في القرآن الكريم؟',
            options: [
              '8',
              '4',
              '7',
              '6'
            ],
            answer: '8',
            just: "عدد حملة العرش كما ذكر في القرآن الكريم هو 8، حيث قال الله عز وجل في سورة الحاقة الآية 17:"
              + "\n\n" + 
              "٦١۝ وَالْمَلَكُ عَلَىٰ أَرْجَائِهَا ۚ وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍ ثَمَانِيَةٌ ٧١۝"
          },
          {
            ques: 'ما أول رقم تم ذكره في القرآن الكريم ؟',
            options: [
              '7',
              '1',
              '5'
            ],
            answer: '7',
            just: "أول رقم تم ذكره في القرآن الكريم هو الرقم 7 حيث ذكر في سورة البقرة في الآية 29:"
              + "\n\n" + 
              "٨٢۝ هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ ۚ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ ٩٢۝"
          },
          {
            ques: 'ما هي الألوان التي تم ذكرها في سورة البقرة ؟',
            options: [
              'اللون الأسود والأصفر والأبيض.',
              'اللون الأسود والأحمر والأبيض.',
              'اللون الأسود والأزرق والأبيض.',
            ],
            answer: 'اللون الأسود والأصفر والأبيض.',
            just: "الألوان التي تم ذكرها في سورة البقرة هي الأسود والأصفر والأبيض."
              + "\n\n" + 
                "ذكر اللون الأسود والأبيض في الآية 187:"
              + "\n\n" + 
              "٦٨١۝ أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ ۚ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ ۗ عَلِمَ اللَّهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ ۖ فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ ۚ وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ ۖ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ ۚ وَلَا تُبَاشِرُوهُنَّ وَأَنتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ ۗ تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ ٧٨١۝"
              + "\n\n" + 
              "وذكر اللون الأصفر في الآية 69:"
              + "\n\n" + 
              "٨٦۝ قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ النَّاظِرِينَ ٩٦۝"
          },
        ],
      }
    ],
  },

  {
    id: 3,
    title: "الرسول ﷺ",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "متى ولد النبي محمد ﷺ؟",
            options: [
              "يوم الإثنين 12 ربيع الأول",
              "يوم الجمعة 17 رمضان",
              "يوم الأحد 27 رجب",
              "يوم الأربعاء 22 صفر"
            ],
            answer: "يوم الإثنين 12 ربيع الأول",
            
          },      
          {
            ques: 'ما اسم العام الذي ولد فيه رسول الله ﷺ؟',
            options: [
              'عام الحزن', 
              'عام الفتح',
              'عام الفيل', 
            ],
            answer: 'عام الفيل',
          },  
          {
            ques: 'ما هو مكان ميلاد الرسول صلى الله عليه وسلم؟',
            options: [
              'مكة المكرمة',
              'المدينة المنورة',
            ],
            answer: 'مكة المكرمة',
          },      
          {
            ques: 'كم كان عمر النبي عندما بعث؟',
            options: ['40', '43', '48'],
            answer: '40',
          },
          {
            ques: 'في أي بيت من بيوت زوجات رسول الله صلى الله عليه وسلم توفي؟',
            options: [
              'عائشة بنت أبي بكر رضي الله عنها', 
              'مارية القبطية رضي الله عنها', 
              'أم حبيبة رضي الله عنها',
              'حفصة بنت عمر بن الخطاب رضي الله عنها'
            ],
            answer: 'عائشة بنت أبي بكر رضي الله عنها',
          },
          {
            ques: "من هى أم النبي صلى الله عليه وسلم؟",
            options: ["حليمة السعدية", "آمنة بنت وهب"],
            answer: "آمنة بنت وهب"
          },
          {
            ques: "من هو أب النبي صلى الله عليه وسلم؟",
            options: [
              "عبد الله بن عبد المطلب",
              "أبو طالب بن عبد المطلب",
              "هاشم بن عبد مناف",
              "عبد مناف بن قصي"
            ],
            answer: "عبد الله بن عبد المطلب"
          },  
          {
            ques: "من هي أكبر بنات رسول الله صلى الله عليه وسلم؟",
            options: [
              "فاطمة الزهراء بنت محمد",
              "رقية بنت محمد",
              "أم كلثوم بنت محمد",
              "زينب بنت محمد",
            ],
            answer: "زينب بنت محمد"
          },
          {
            ques: "كم عدد أبناء الرسول صلى الله عليه وسلم؟",
            options: ["3", "4", "7"],
            answer: "7"
          },      
          {
            ques: "ما إسم الغزوة التي جرح فيها النبي محمد ﷺ ؟",
            options: ["غزوة بدر", "غزوة الخندق", "غزوة أحد"],
            answer: "غزوة أحد",
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "من هي من بنات رسول الله صلى الله عليه وسلم أشبه بالرسول؟",
            options: ["فاطمة الزهراء", "زينب", "رقية", "أم كلثوم"],
            answer: "فاطمة الزهراء"
          },
          {
            ques: 'ما هو الملجأ الذي اتخذه الرسول صلى الله عليه وسلم مكانا سريا من أجل الدعوة في مكة؟',
            options: [
            'غار حراء',
            'دار الأرقم بن أبي الأرقم',
            'غار حراء',
            ],
            answer: 'دار الأرقم بن أبي الأرقم',
          },
          {
            ques: 'من هي أول من تزوجها الرسول صلى الله عليه وسلم؟',
            options: [
              'خديجة بنت خويلد رضي الله عنها',
              'سودة بنت زمعة رضي الله عنها',
              'عائشة بنت أبي بكر رضي الله عنها',
              'حفصة بنت عمر بن الخطاب رضي الله عنها',
            ],
            answer: 'خديجة بنت خويلد رضي الله عنها',
          },
          {
            ques: 'كم كان عمر السيدة خديجة بنت خويلد رضي الله عنها حين تزوجت الرسول ﷺ؟',
            options: [
              '40 عاما',
              '20 عاما',
              '30 عاما',
              '35 عاما',
            ],
            answer: '40 عاما',
          },
          {
            ques: 'كم كان عمر النبي ﷺ حينما تزوج السيدة خديجة بنت خويلد رضي الله عنها؟',
            options: [
              '20 عاما',
              '30 عاما',
              '40 عاما',
              '25 عاما',
            ],
            answer: '40 عاما',
          },
          {
            ques: 'من هو الذي تولى رعاية النبي صلى الله عليه وسلم عندما كان طفلاً؟',
            options: [
              'عمه العباس بن عبد المطلب',
              'عمه حمزة بن عبد المطلب',
              'جده عبد المطلب',
            ],
            answer: 'جده عبد المطلب'
          },
          {
            ques: 'من هو الذي سمى النبي محمد صلى الله عليه وسلم؟',
            options: [
              'أمه آمنة بنت وهب',
              'أبوه عبد الله بن عبد المطلب',
              'جده عبد المطلب',
              'عمه حمزة بن عبد المطلب',
            ],
            answer: 'جده عبد المطلب'
          },
          {
            ques: 'من هو أول أعمام النبي إسلاما؟',
            options: [
              'حمزة بن عبد المطلب',
              'العباس بن عبد المطلب'
            ],
            answer: 'حمزة بن عبد المطلب'
          },
          {
            ques: 'كم عدد عمات النبي ﷺ؟',
            options: [
              '6',
              '4',
              '8',
              '2'
            ],
            answer: '6'
          },
          {
            ques: 'كم عدد خالات النبي ﷺ؟',
            options: [
              '1',
              '2',
              '3',
              '4'
            ],
            answer: '2',
          },
        ],
      },
    ],
  },

  {
    id: 4,
    title: "الأنبياء والرسل",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'من هو الذي يقتل المسيح الدجال؟',
            options: [
              'عيسى عليه السلام', 
              'موسى عليه السلام',
              'محمد ﷺ',
              'ذو الكفل عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: "الذي يقتل المسيح الدجال هو النبي عيسى عليه السلام"
              + "\n\n" +
              "عن أَبي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: (وَالَّذِي نَفْسِي بِيَدِهِ، لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمْ ابْنُ مَرْيَمَ حَكَمًا عَدْلًا، فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الخِنْزِيرَ، وَيَضَعَ الجِزْيَةَ، وَيَفِيضَ المَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ، حَتَّى تَكُونَ السَّجْدَةُ الوَاحِدَةُ خَيْرًا مِنَ الدُّنْيَا وَمَا فِيهَا. ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: وَاقْرَءُوا إِنْ شِئْتُمْ: (وَإِنْ مِنْ أَهْلِ الكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ، وَيَوْمَ القِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا))."
          },
          {
            ques: "من هو أول رسول أُرسِل إلى الأرض؟",
            options: [
              "إدريس عليه السلام", 
              "محمد ﷺ", 
              "نوح عليه السلام",
              "هود عليه السلام",
            ],
            answer: "نوح عليه السلام",
            just: 
              'أول رسول أُرسِل إلى الأرض هو نوح عليه السلام'
          },
          {
            ques: "إلى من أرسل النبي صالح عليه السلام؟",
            options: ["قوم مدين", "قوم ثمود", "قوم عاد", "قوم فرعون",],
            answer: "قوم ثمود",
            just: 
              "أرسل النبي صالح عليه السلام إلى قوم ثمود."
              + "\n\n" +
              "قال الله عز وجل في سورة الأعراف في الآية 73:"
              + "\n\n" +
              "٢٧۝ وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ ٣٧۝"
          },
          {
            ques: "من هو النبي الذي بُعث إلى قوم مدين؟",
            options: [
              "هود عليه السلام", 
              "شعيب عليه السلام", 
              "موسى عليه السلام",
              "اليسع عليه السلام",
            ],
            answer: "شعيب عليه السلام",
            just: 
              "النبي الذي بُعث إلى قوم مدين هو شعيب عليه السلام."
              + "\n\n" +
              "قال الله عز وجل في سورة الأعراف في الآية 85:"
              + "\n\n" +
              "٤٨۝ وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ قَدْ جَاءَتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ ۖ فَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ ٥٨۝"
          }, 
          {
            ques: "قال أهل العلم أن معجزة نوح وهود عليهما السلام هي؟",
            options: ["الصبر", "التحدي", "المُلك"],
            answer: "الصبر"
          },
          {
            ques: 'كم عدد الأنبياء الذين ذكروا في القرآن الكريم؟',
            options: ['10', '15', '25'],
            answer: '25',
            just: 
              "عدد الأنبياء الذين ذكروا في القرآن الكريم هو 25 وهم:"
              + "\n" +
              "آدم عليه السلام"
              + "\n" +
              "إدريس عليه السلام"
              + "\n" +
              "نوح عليه السلام"
              + "\n" +
              "هود عليه السلام"
              + "\n" +
              "صالح عليه السلام"
              + "\n" +
              "إبراهيم عليه السلام"
              + "\n" +
              "لوط عليه السلام"
              + "\n" +
              "إسماعيل عليه السلام"
              + "\n" +
              "إسحاق عليه السلام"
              + "\n" +
              "يعقوب عليه السلام"
              + "\n" +
              "يوسف عليه السلام"
              + "\n" +
              "أيوب عليه السلام"
              + "\n" +
              "شعيب عليه السلام"
              + "\n" +
              "موسى عليه السلام"
              + "\n" +
              "هارون عليه السلام"
              + "\n" +
              "ذو الكفل عليه السلام"
              + "\n" +
              "داود عليه السلام"
              + "\n" +
              "سليمان عليه السلام"
              + "\n" +
              "إلياس عليه السلام"
              + "\n" +
              "اليسع عليه السلام"
              + "\n" +
              "يونس عليه السلام"
              + "\n" +
              "زكريا عليه السلام"
              + "\n" +
              "يحيى عليه السلام"
              + "\n" +
              "عيسى عليه السلام"
              + "\n" +
              "محمد صلى الله عليه وسلم"
            
          },
          {
            ques: 'من أول من قال السلام عليكم ورحمة الله وبركاته؟',
            options: [
              'آدم عليه السلام', 
              'موسى عليه السلام', 
              'عيسى عليه السلام',
              'محمد ﷺ',
            ],
            answer: 'آدم عليه السلام',
            just: 
              "أول من قال السلام عليكم ورحمة الله وبركاته هو أبونا آدم عليه السلام." 
              + "\n" +
              "قال رسول الله ﷺ: خلق اللهُ آدمَ على صُورتِه ، وطُولُه سِتُّونَ ذِراعًا ، ثُم قال : اذْهبْ فَسَلِّم على أُولئِكَ النَّفَرِ – وهُم نَفَرٌ من الملائِكةِ جُلُوسٌ – فاسْتمِعْ ما يُحَيُّونَك ؛ فإِنَّها تَحَيَُّتُك وتَحيةُ ذُرِّيَّتِكَ ، فذَهبَ فقال : السَّلامُ عليكم ، فقالُوا : السَّلامُ عليكَ ورحمةُ اللهِ ، فزَادُوهُ ( ورَحمةُ اللهِ ) فكُلُّ مَن يَدخلُ الجنةَ على صورةِ آدمَ في طُولِه سِتُّونَ ذِراعًا ، فلمْ تَزلْ الخَلْقُ تَنقُصُ بعدَه حتى الآنَ"
          },
          {
            ques: 'من النبي الذي طلب منه قومه أن ينزل لهم مائدة من السماء؟',
            options: [
              'محمد ﷺ',
              'موسى عليه السلام', 
              'عيسى عليه السلام', 
              'إبراهيم عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
            just: "النبي الذي طلب منه قومه أن ينزل لهم مائدة من السماء هو عيسى عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة المائدة في الآية 112:"
              + "\n" +
              "١١١۝ إِذْ قَالَ الْحَوَارِيُّونَ يَا عِيسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ ۖ قَالَ اتَّقُوا اللَّهَ إِن كُنتُم مُّؤْمِنِينَ ٢١١۝"
          },
          // {
          //   ques: 'من النبي الذي بعث إلى مدين؟',
          //   options: [
          //     'شعيب عليه السلام', 
          //     'نوح عليه السلام', 
          //     'صالح عليه السلام',
          //     'محمد ﷺ',
          //   ],
          //   answer: 'شعيب عليه السلام',
          //   just: ""
          // },
          {
            ques: 'من النبي الذي قتل جالوت؟',
            options: [
              'داود عليه السلام', 
              'محمد ﷺ',
              'يعقوب عليه السلام', 
              'لوط عليه السلام',
            ],
            answer: 'داود عليه السلام',
            just: "النبي الذي قتل جالوت هو داود عليه السلام."
              + "\n" +
              "قال الله عز وجل في سورة البقرة في الآية 251:"
              + "\n" +
              "٠٥٢۝ فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ ۗ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُم بِبَعْضٍ لَّفَسَدَتِ الْأَرْضُ وَلَٰكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعَالَمِينَ ١٥٢۝"
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'من هو النبي الملقب بشيخ المرسلين؟',
            options: [
              'النبي نوح عليه السلام',
              'النبي إبراهيم عليه السلام', 
              'آدم عليه السلام',
              'النبي محمد ﷺ',
            ],
            answer: 'نوح عليه السلام',
          }, 
          {
            ques: 'من هو النبي الملقب بأبو الأنبياء؟',
            options: [
              'النبي نوح عليه السلام',
              'النبي إبراهيم عليه السلام',
              'النبي آدم عليه السلام',
              'النبي محمد ﷺ'
            ],
            answer: 'النبي إبراهيم عليه السلام'
          },  
          {
            ques: 'من هو النبي الذي لقب بكليم الله؟',
            options: [
              'عيسى عليه السلام',
              'النبي محمد ﷺ',
              'آدم عليه السلام',
              'موسى عليه السلام',
            ],
            answer: 'موسى عليه السلام',
          },
          {
            ques: 'من هو خليل الله؟',
            options: [
            'إبراهيم عليه السلام',
            'صالح عليه السلام',
            'شعيب عليه السلام',
            'النبي محمد ﷺ',
          ],
            answer: 'إبراهيم عليه السلام',
          },
          {
            ques: 'من هو خطيب الأنبياء؟',
            options: [
            'هارون عليه السلام',
            'داود عليه السلام',
            'النبي محمد ﷺ',
            'شعيب عليه السلام'
            ],
            answer: 'شعيب عليه السلام',
          },
          {
            ques: 'من هو النبي الملقب بالصديق؟',
            options: [
              'يوسف عليه السلام',
              'يونس عليه السلام',
              'النبي محمد ﷺ',
              'ذو الكفل عليه السلام',
            ],
            answer: 'يونس عليه السلام',
          },
          {
            ques: 'من هو النبي الملقب بالمسيح؟',
            options: [
              'موسى عليه السلام',
              'النبي محمد ﷺ',
              'عيسى عليه السلام',
              'لوط عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
          },
          {
            ques: 'من هو النبي الملقب بسيد الأولين وسيد الآخرين؟',
            options: [
              'آدم عليه السلام',
              'موسى عليه السلام',
              'نوح عليه السلام',
              'النبي محمد ﷺ',
            ],
            answer: 'النبي محمد ﷺ',            
          },
          {
            ques: 'من هو النبي الذي لقب بخليفة الله؟',
            options: [
              'النبي يوسف عليه السلام',
              ' النبيعيسى عليه السلام',
              'النبي محمد ﷺ',
              'النبي داود عليه السلام',
            ],
            answer: 'النبي داود عليه السلام',
          },
          {
            ques: 'من هو النبي الملقب بالنبي الملك؟',
            options: [
            'النبي سليمان عليه السلام',
            'النبي إبراهيم عليه السلام',
            'النبي آدم عليه السلام',
            'النبي محمد ﷺ',
            ],
            answer: 'النبي سليمان عليه السلام',
          },
        ],
      },
      {
        title: "إختبار 3",
        id: 3,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'ما نوع العذاب الذي عذب الله به قوم نوح؟',
            options: [
              'الحريق',
              'الزلزال',
              'الجفاف',
              'الطوفان',
            ],
            answer: 'الطوفان',
            just: 
              "عذب الله قوم نوح بالطوفان."
              + "\n" +
              "قال الله تعالى في سورة العنكبوت في الآية 14:"
              + "\n" +
              "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ ٤١۝"
          },
          {
            ques: 'من هما النبيان اللذان إشتركا في بناء الكعبة؟',
            options: [
              'نوح وهود عليهما السلام',
              'إبراهيم وإسحاق عليهما السلام',
              'إبراهيم وإسماعيل عليهما السلام',
              'يعقوب ويوسف عليهما السلام',
            ],
            answer: 'إبراهيم وإسماعيل عليهما السلام',
            just: 
              "النبيان اللذان إشتركا في بناء الكعبة هما إبراهيم وإسماعيل عليهما السلام."
              + "\n" +
              "قال الله تعالى في سورة البقرة في الآية 127:"
              + "\n" +
              "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ ٧٢١۝"
          },
          {
            ques: 'من هو النبي الذي خُلق من دون أب أو أم؟',
            options: [
              'عيسى عليه السلام',
              'آدم عليه السلام',
              'موسى عليه السلام',
              'محمد صلى الله عليه وسلم',
            ],
            answer: 'آدم عليه السلام',
          },
          {
            ques: 'من هو النبي الذي تآمر عليه اخوته؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'إسحاق عليه السلام',
              'يوسف عليه السلام',
              'يعقوب عليه السلام',
            ],
            answer: 'يوسف عليه السلام',
          },      
          {
            ques: 'من هو النبي الذي إبتلعه الحوت؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'يوسف عليه السلام',
              'يونس عليه السلام',
              'نوح عليه السلام',
            ],
            answer: 'يونس عليه السلام',
            just: 
              "النبي الذي إبتلعه الحوت هو يونس عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة الصافات من الآية 139 إلى 142:"
              + "\n" +
              "وَإِنَّ يُونُسَ لَمِنَ الْمُرْسَلِينَ ٩٣١۝ إِذْ أَبَقَ إِلَى الْفُلْكِ الْمَشْحُونِ ٠٤١۝ فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِينَ ١٤١۝ فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ ٢٤١۝"
          },     
          {
            ques: 'من هو النبي الذي طمع بأن يرى الله عز وجل؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'موسى عليه السلام',
              'عيسى عليه السلام',
              'إبراهيم عليه السلام',
            ],
            answer: 'موسى عليه السلام',
          },
          // {
          //   ques: 'من هو النبي الذي ألقي في النار؟',
          //   options: [
          //     'إبراهيم عليه السلام',
          //     'محمد صلى الله عليه وسلم',
          //     'يعقوب عليه السلام',
          //     'إسحاق عليه السلام',
          //   ],
          //   answer: 'إبراهيم عليه السلام',
          //   just: "",
          // },
          {
            ques: 'من هو النبي الذي سخر له الله الجن والطير وعلمه لغة الطير؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'عيسى عليه السلام',
              'يعقوب عليه السلام',
              'سليمان عليه السلام',
            ],
            answer: 'سليمان عليه السلام',
            just: "",
          },
          {
            ques: 'كم عدد المرات التي ورد فيها اسم الرسول في القرآن؟',
            options: [
              '4 مرات',
              '3 مرات',
              '5 مرات',
              '2 مرات',
            ],
            answer: '4 مرات',
            just: "",
          },
          {
            ques: 'ما هو اليوم الذي خلق الله فيه سيدنا آدم عليه السلام؟',
            options: [
              'الجمعة',
              'الإثنين',
              'الثلثاء',
              'الأربعاء',
            ],
            answer: 'الجمعة',
            just: "",
          },
        ],
      },
      {
        title: "إختبار 4",
        id: 4,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'ما هي الحشرة التي تحدثت مع النبي سليمان عليه السلام؟',
            options: [
              'النحلة',
              'النملة',
            ],
            answer: 'النملة',
            just: 
              "الحشرة التي تحدث مع النبي سليمان عليه السلام هي النملة."
              + "\n" +
              "قال الله تعالى في سورة النمل من الآية 18 إلى 19:"
              + "\n" +
              "٧١۝ حَتَّىٰ إِذَا أَتَوْا عَلَىٰ وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ ٨١۝ فَتَبَسَّمَ ضَاحِكًا مِّن قَوْلِهَا وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ ٩١۝"
          },
          {
            ques: 'ما هو الطائر الذي تكلم مع النبي سليمان عليه السلام؟',
            options: ['العقاب', 'البومة', 'الهدهد', 'النسر',],
            answer: 'الهدهد',
            just: 
              "الطائر الذي تكلم مع النبي سليمان عليه السلام هو الهدهد."
              + "\n" +
              "قال الله تعالى في سورة النمل من الآية 20 إلى 22:"
              + "\n" +
              "٩١۝ وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ ٠٢۝ لَأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُّبِينٍ ١٢۝ فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ ٢٢۝"
          },
          {
            ques: 'كم عدد أبناء سيدنا إبراهيم عليه السلام في القرآن الكريم؟',
            options: ['2', '3', '5', '1'],
            answer: '2',
            just: 
              "ورد في القرآن الكريم وجود ولدين لسيدنا إبراهيم عليه السلام وكلاهما من الأنبياء وهما:"
              + "\n" +
              "إسماعيل عليه السلام"
              + "\n" +
              "إسحاق عليه السلام"
          },
          // {
          //   ques: 'ما إسم ناقة النبي صالح عليه السلام؟',
          //   options: ['العانقة', 'القصواء', 'الشيبانية', 'الأمراء'],
          //   answer: 'القصواء',
          //   just: ""
          // },
          {
            ques: 'من هو النبي الذي صام عن الكلام لمدة ثلاثة أيام؟',
            options: [
              'موسى عليه السلام', 
              'إبراهيم عليه السلام', 
              'زكريا عليه السلام', 
              'هارون عليه السلام'
            ],
            answer: 'زكريا عليه السلام', 
            just: 
              "النبي الذي صام عن الكلام لمدة ثلاثة أيام هو النبي زكريا عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة مريم من الآية 7 إلى 11:"
              + "\n" +
              "يَـٰزَڪَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُ مِن قَبۡلُ سَمِيًّا ٧۝ قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌ  وَڪَانَتِ ٱمۡرَأَتِى عَاقِرًا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡڪِبَرِ عِتِيًّا ٨۝ قَالَ كَذَالِكَ قَالَ رَبُّكَ هُوَ عَلَىَّ هَيِّنٌ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـًٔا ٩۝ قَالَ رَبِّ ٱجۡعَل لِّىٓ ءَايَةً قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَـٰثَ لَيَالٍ سَوِيًّا ٠١۝ فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡہِمۡ أَن سَبِّحُواْ بُكۡرَةً وَعَشِيًّا ١١۝"
              + "\n\n" +
              "قال الله تعالى في سورة آل عمران من الآية 38 إلى 41:"
              + "\n" +
              "هُنَالِكَ دَعَا زَڪَرِيَّا رَبَّهُ ۥ‌ۖ قَالَ رَبِّ هَبۡ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً‌ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ ٨٣۝ فَنَادَتۡهُ ٱلۡمَلَـٰٓٮِٕكَةُ وَهُوَ قَآٮِٕمٌ يُصَلِّى فِى ٱلۡمِحۡرَابِ أَنَّ ٱللَّهَ يُبَشِّرُكَ بِيَحۡيَىٰ مُصَدِّقَۢا بِكَلِمَةٍ مِّنَ ٱللَّهِ وَسَيِّدًا وَحَصُورًا وَنَبِيًّا مِّنَ ٱلصَّـٰلِحِينَ ٩٣۝ قَالَ رَبِّ أَنَّىٰ يَكُونُ لِى غُلَـٰمٌ وَقَدۡ بَلَغَنِىَ ٱلۡڪِبَرُ وَٱمۡرَأَتِى عَاقِرٌ قَالَ كَذَالِكَ ٱللَّهُ يَفۡعَلُ مَا يَشَآءُ ٠٤۝ قَالَ رَبِّ ٱجۡعَل لِّىٓ ءَايَةً قَالَ ءَايَتُكَ أَلَّا تُڪَلِّمَ ٱلنَّاسَ ثَلَـٰثَةَ أَيَّامٍ إِلَّا رَمۡزًا‌ۗ وَٱذۡكُر رَّبَّكَ ڪَثِيرًا وَسَبِّحۡ بِٱلۡعَشِىِّ وَٱلۡإِبۡڪَـٰرِ ١٤۝"
          },
          {
            ques: 'من هو النبي الذي كان قومه يعبدون الأيكة؟',
            options: [
              'النبي إدريس عليه السلام', 
              'النبي هود عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي شعيب عليه السلام',
            ],
            answer: 'النبي شعيب عليه السلام',
            just: "النبي الذي كان قومه يعبدون الأيكة هو النبي شعيب عليه السلام"
          },
          {
            ques: 'من هو النبي الذي أمره الله بأن يصنع سفينة؟',
            options: [
              "يوسف عليه السلام",
              "نوح عليه السلام",
              "زكريا عليه السلام",
              "اليسع عليه السلام",
            ],
            answer: "نوح عليه السلام",
            just: 
              "النبي الذي أمره الله بأن يصنع سفينة هو النبي نوح عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة هود في الآية 36 و 37:"
              + "\n" +
              "٥٣۝ وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ ٦٣۝ وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ ٧٣۝"
          },
          {
            ques: 'كيف أهلك الله قوم عاد؟',
            options: [
              'بزلزال',
              'بالجفاف',
              'بالغرق',
              'بريح صرصر عاتية', 
            ],
            answer: 'بريح صرصر عاتية',
            just: 
              "أهلك الله قوم عاد بريح صرصر عاتية."
              + "\n" +
              "قال الله تعالى في سورة الحاقة في الآية 6:"
              + "\n" +
              "٥۝ وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ ٦۝"
          },
          {
            ques: 'من هو النبي الذي ألان الله له الحديد؟',
            options: [
              'نوح عليه السلام', 
              'موسى عليه السلام', 
              'داود عليه السلام', 
              'يوسف عليه السلام'
            ],
            answer: 'داود عليه السلام',
            just: 
              "النبي الذي ألان الله له الحديد هو داود عليه السلام"
              + "\n" +
              "قال الله تعالى في سورة سبأ في الآية 10:"
              + "\n" +
              "٩۝ وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلًا ۖ يَا جِبَالُ أَوِّبِي مَعَهُ وَالطَّيْرَ ۖ وَأَلَنَّا لَهُ الْحَدِيدَ ٠١۝"
          },
          // {
          //   ques: 'كم حج النبي محمد واعتمر؟',
          //   options: [
          //     'حج مرتين واعتمر مرة', 
          //     'حج مرة واحدة وإعتمر 3 مرات', 
          //     'حج مرة واحدة وإعتمر مرتين', 
          //     'حج مرة واحدة وإعتمر 4 مرات',
          //   ],
          //   answer: 'حج مرة واحدة وإعتمر 4 مرات',
          //   just: ""
          // },
          {
            ques: 'من هو كفيل السيدة مريم؟',
            options: [
              "موسى عليه السلام",
              "زكريا عليه السلام",
              "عيسى عليه السلام",
              "يحيى عليه السلام",
            ],
            answer: "زكريا عليه السلام",
            just: 
              "كفيل السيدة مريم هو النبي زكريا عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة آل عمران في الآية 37:"
              + "\n" +
              "٦٣۝ فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ وَجَدَ عِندَهَا رِزْقًا ۖ قَالَ يَا مَرْيَمُ أَنَّىٰ لَكِ هَٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ اللَّهِ ۖ إِنَّ اللَّهَ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ ٧٣۝"
          },
          // {
          //   ques: 'من أول من قاتل بالسيف من الأنبياء؟',
          //   options: [
          //     'إدريس عليه السلام', 
          //     'داود عليه السلام', 
          //     'يوشع عليه السلام', 
          //     'إبراهيم عليه السلام',  
          //   ],
          //   answer: 'إبراهيم عليه السلام',
          //   just: ""
          // },
          // {
          //   ques: 'من هو الملك الذي أمر بحرق سيدنا إبراهيم؟',
          //   options: [
          //     'فرعون', 
          //     'نمرود', 
          //     'جالوت',
          //   ],
          //   answer: 'نمرود',
          //   just: ""
          // },
          {
            ques: 'من هو النبي الذي تعرض لسخرية من قومه؟',
            options: [
              'عيسى عليه السلام', 
              'داود عليه السلام', 
              'موسى عليه السلام', 
              'نوح عليه السلام',
            ],
            answer: 'نوح عليه السلام',
            just: 
              "النبي الذي تعرض لسخرية من قومه هو النبي نوح عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة هود من الآيات 36 إلى 38:"
              + "\n" +
              "٥٣۝ وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ ٦٣۝ وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ ٧٣۝ وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِّن قَوْمِهِ سَخِرُوا مِنْهُ ۚ قَالَ إِن تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنكُمْ كَمَا تَسْخَرُونَ ٨٣۝"
          },
        ],
      },
      {
        title: "إختبار 5",
        id: 5,
        score: 0,
        taken: false,
        questions: [   
          {
            ques: 'من هو النبي النجار؟',
            options: ['نوح عليه السلام', 'زكريا عليه السلام', 'إدريس عليه السلام'],
            answer: 'زكريا عليه السلام',
          },
          {
            ques: 'من هو النبي الحداد؟',
            options: ['داود عليه السلام', 'صالح عليه السلام', 'يوسف عليه السلام'],
            answer: 'داود عليه السلام',
          },
          {
            ques: 'ما مهنة رسولنا الكريم قبل أن يُبعث؟',
            options: ['الرعي والتجارة', 'الزراعة والصيد', 'البناء والحرف اليدوية'],
            answer: 'الرعي والتجارة',
          },
          {
            ques: 'من هو النبي الخياط؟',
            options: ['آدم عليه السلام', 'إدريس عليه السلام', 'يوسف عليه السلام'],
            answer: 'إدريس عليه السلام',
          },
          {
            ques: 'ما مهنة النبي موسى؟',
            options: ['راعي', 'صياد', 'حرفي'],
            answer: 'راعي',
          },
          {
            ques: 'ما مهنة سيدنا آدم؟',
            options: ['فلاح', 'حرفي', 'تاجر'],
            answer: 'فلاح',
          },
          {
            ques: 'ما مهنة إلياس عليه السلام؟',
            options: ['حداد', 'نساج', 'خياط'],
            answer: 'نساج',
          },
          {
            ques: 'ما مهنة إبراهيم عليه السلام؟',
            options: ['تاجر أقمشة', 'حرفي', 'صياد'],
            answer: 'تاجر أقمشة',
          },
          {
            ques: 'ما مهنة النبي إسحاق عليه السلام؟',
            options: [
              'حرفي', 
              'راعي', 
              'نجار'
            ],
            answer: 'راعي',
          },
          {
            ques: 'ما مهنة نوح عليه السلام؟',
            options: ['نجار', 'حداد', 'صياد'],
            answer: 'نجار',
          },
        ],
      },
      {
        title: "إختبار 6",
        id: 6,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'من هي أول إمرأة تزوجها النبي إبراهيم عليه السلام؟',
            options: [
              'هاجر عليها السلام', 
              'سارة عليها السلام', 
            ],
            answer: 'سارة عليها السلام',
            just: "أول إمرأة تزوجها النبي إبراهيم عليه السلام هي سارة عليها السلام"
          },
          {
            ques: 'من هو النبي الذي بقي حياً حتى الآن؟',
            options: [
              'إدريس عليه السلام', 
              'عيسى عليه السلام', 
              'إسماعيل عليه السلام', 
              'شعيب عليه السلام',
            ],
            answer: 'عيسى عليه السلام',
          },
          {
            ques: 'ما إسم أم النبي إسماعيل عليه السلام؟',
            options: [
              'سارة عليها السلام', 
              'هاجر عليها السلام', 
            ],
            answer: 'هاجر عليها السلام',
            just: "إسم أم النبي إسماعيل عليه السلام هو هاجر عليها السلام"
          },      
          {
            ques: 'من هو النبي الذي خرجت ناقته من الصخر؟',
            options: [
              'النبي إسماعيل عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي صالح عليه السلام',
            ],
            answer: 'النبي صالح عليه السلام',
            just: "النبي الذي خرجت ناقته من الصخر هو صالح عليه السلام."
          },
          {
            ques: 'من هو النبي الذي لم تحرقه النار؟',
            options: [
              'النبي نوح عليه السلام', 
              'النبي إبراهيم عليه السلام', 
              'النبي لوط عليه السلام',
            ],
            answer: 'النبي إبراهيم عليه السلام',
            just: 
              "النبي الذي لم تحرقه النار هو إبراهيم عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة الأنبياء في الآية 69:"
              + "\n" +
              "النبي الذي لم تحرقه النار هو إبراهيم عليه السلام."
          },
          {
            ques: 'من هو النبي الذي أعطاه الله ملكاً لم يعطه لأحد بعده؟',
            options: [
              'النبي داوود عليه السلام', 
              'النبي سليمان عليه السلام', 
              'النبي يوسف عليه السلام',
            ],
            answer: 'النبي سليمان عليه السلام',
            just: 
              "النبي الذي أعطاه الله ملكاً لم يعطه لأحد بعده هو النبي سليمان عليه السلام."
              + "\n" +
              "قال الله تعالى في سورة ص في الآيات 34 و 35:"
              + "\n" +
              "٣٣۝ وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ ٤٣۝ قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ ٥٣۝"
          },
          {
            ques: 'ما هي معجزة نبينا محمد عليه الصلاة والسلام؟',
            options: [
              'كلامه في المهد', 
              'القرآن الكريم', 
              'تأويل الرؤى',
            ],
            answer: 'القرآن الكريم',
            just: ""
          }, 
          {
            ques: 'ما اسم النبي الذي أمره الله بأن يصنع سفينة؟',
            options: [
              'محمد صلى الله عليه وسلم',
              'يونس عليه السلام',
              'نوح عليه السلام',
              'يوسف عليه السلام',
            ],
            answer: 'نوح عليه السلام',
            just: ""
          }, 
          {
            ques: 'من هو أول من خط بالقلم؟',
            options: [
              'نوح عليه السلام', 
              'آدم عليه السلام', 
              'إدريس عليه السلام', 
              'موسى عليه السلام'
            ],
            answer: 'إدريس عليه السلام',
          },
          {
            ques: 'كم لبث النبي نوح عليه السلام بدعوة قومه لعبادة الله؟',
            options: [
              '1000 عام',
              '950 عاماً',
              '900 عام',
              '800 عام'
            ],
            answer: '950 عاماً',
            just: 
              "لبث النبي نوح عليه السلام بدعوة قومه لعبادة الله 950 عاما"
              + "\n" +
              "قال الله تعالى في سورة العنكبوت في الآية 14:"
              + "\n" +
              "٣١۝ وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ ٤١۝"
          },
        ],
      },
    ],
  },



  {
    id: 5,
    title: "الصحابة",
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'من أول من استضاف الرسول صلى الله عليه وسلم في بيته عندما وصل المدينة ؟',
            options: [
              'أبو أيوب الأنصاري رضي الله عنه',
              'سعد بن معاذ الأنصاري رضي الله عنه',
              'عمر بن الخطاب رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
            ],
            answer: 'أبو أيوب الأنصاري رضي الله عنه',
            just: "أول من استضاف الرسول صلى الله عليه وسلم في بيته عندما وصل المدينة هو أبو أيوب الأنصاري رضي الله عنه."
          },
          {
            ques: "من هو الصحابي الذي كانت تسلم عليه الملائكة؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "عثمان بن عفان رضي الله عنه",
              "عمران بن حصين رضي الله عنه",
            ],
            answer: "عمران بن حصين رضي الله عنه",
            just: ""
          },      
          {
            ques: "من هو أول من عقدت له راية في الإسلام؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه",
              "حمزة بن عبد المطلب رضي الله عنه",
              "خالد بن الوليد رضي الله عنه",
            ],
            answer: "حمزة بن عبد المطلب رضي الله عنه"
          },
          {
            ques: "من هو أول من سل سيفه في سبيل الله؟",
            options: [
              "خالد بن الوليد رضي الله عنه",
              "سعد بن أبي وقاص رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "الزبير بن العوام رضي الله عنه"
            ],
            answer: "الزبير بن العوام رضي الله عنه"
          },      
          {
            ques: "من هو الصحابي الذي اهتزّ لموته عرش الرحمن؟",
            options: [
              "سعد بن معاذ رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه"
            ],
            answer: "سعد بن معاذ رضي الله عنه"
          },      
          {
            ques: "من الذي قد قال فيه عمر بن الخطاب يوم وفاته، لقد مات اليوم سيد المسلمين؟",
            options: [
              "أُبَيّ بن كعب رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "خالد بن الوليد رضي الله عنه",
            ],
            answer: "أُبَيّ بن كعب رضي الله عنه",
          },
          {
            ques: "ما هي أول غزوة شارك فيها الصحابي عبد الله بن عمر؟",
            options: [
              "غزوة بدر",
              "غزوة الخندق",
              "فتح مكة",
              "غزوة تبوك"
            ],
            answer: "غزوة الخندق",
          },      
          {
            ques: "من هو أول صحابي قرأ القرآن الكريم جهراً؟",
            options: [
              "عمر بن الخطاب رضي الله عنه", 
              "علي بن أبي طالب رضي الله عنه", 
              "عبدالله بن مسعود رضي الله عنه", 
              "أبو بكر الصديق رضي الله عنه"
            ],
            answer: "عبدالله بن مسعود رضي الله عنه"
          },      
          {
            ques: "من هو الصحابي الملقب بذي النورين؟",
            options: [
              "أبو بكر الصديق رضي الله عنه", 
              "عمر بن الخطاب رضي الله عنه", 
              "علي بن أبي طالب رضي الله عنه", 
              "عثمان بن عفان رضي الله عنه"
            ],
            answer: "عثمان بن عفان رضي الله عنه"
          },      
          {
            ques: 'من هو الصحابي المُلقب بـ"حيدرة"؟',
            options: [
              'أسامة بن زيد رضي الله عنه',
              'معاوية بن أبي سفيان رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه'
            ],
            answer: 'علي بن أبي طالب رضي الله عنه',
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'من هو سيف الله المسلول؟',
            options: ['معاذ بن جبل رضي الله عنه', 'علي بن أبي طالب رضي الله عنه', 'خالد بن الوليد رضي الله عنه'],
            answer: 'خالد بن الوليد رضي الله عنه',
          },
          {
            ques: 'من الذي عندما قتل رفع بين السماء والأرض؟',
            options: [
              'عامر بن فهيرة رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
              'خالد بن الوليد رضي الله عنه',
              'زيد بن حارثة رضي الله عنه',
            ],
            answer: 'عامر بن فهيرة رضي الله عنه',
          },
          {
            ques: 'من هو أول من ولد في الإسلام في أرض الحبشة؟',
            options: [
              'عبد الله بن جعفر بن أبي طالب رضي الله عنهما',
              'جعفر بن أبي طالب رضي الله عنه',
              'علي بن أبي طالب رضي الله عنه',
              'عبد الله بن عبد المطلب رضي الله عنه',
            ],
            answer: 'عبد الله بن جعفر بن أبي طالب رضي الله عنهما',
          },
          {
            ques: 'أين توفي الصحابي عبد الله بن حُذافة السُهمي رضي الله عنه؟',
            options: [
              'في مصر',
              'في المدينة',
              'في مكة المكرمة',
            ],
            answer: 'في مصر',
          },
          {
            ques: "من الذي قد قَبّل رأس ملك الروم حتي يقوم بإطلاق سراح أسرى المسلمين؟",
            options: [
              "خالد بن الوليد رضي الله عنه",
              "سعد بن أبي وقاص رضي الله عنه",
              "زيد بن حارثة رضي الله عنه",
              "عبد الله بن حذافة السُهمي رضي الله عنه",
            ],
            answer: "عبد الله بن حذافة السُهمي رضي الله عنه",
          },
          {
            ques: "من الذي رأى الأذان في المنام؟",
            options: [
              "أبو بكر الصديق رضي الله عنه",
              "عبد الله بن زيد الأنصاري رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "عثمان بن عفان رضي الله عنه",
            ],
            answer: "عبد الله بن زيد الأنصاري رضي الله عنه",
          },
          {
            ques: "من هو أول من قام بإستقبال القبلة في حياته وفي مماته؟",
            options: [
              "البراء بن معرور الأنصاري رضي الله عنه",
              "عمر بن الخطاب رضي الله عنه",
              "أبو بكر الصديق رضي الله عنه",
              "علي بن أبي طالب رضي الله عنه"
            ],
            answer: "البراء بن معرور الأنصاري رضي الله عنه"
          },
          {
            ques: "ما هي أول غزوة شارك فيها الصحابي عبد الله بن عمر رضي الله عنه؟",
            options: ["غزوة الخندق", "غزوة بدر", "غزوة أحد", "غزوة خيبر"],
            answer: "غزوة الخندق",
          },
          {
            ques: 'من هو الصحابي الملقب بأبو المساكين؟',
            options: [
              'جعفر بن أبي طالب رضي الله عنه',
              'عبدالله بن مسعود رضي الله عنه',
              'سعد بن أبي وقاص رضي الله عنه',
              'زيد بن حارثة رضي الله عنه'
            ],
            answer: 'جعفر بن أبي طالب رضي الله عنه',
          },
          {
            ques: 'من هو الصحابي الملقب بذو الجناحين؟',
            options: [
              'خالد بن الوليد رضي الله عنه',
              'زيد بن حارثة رضي الله عنه',
              'عمرو بن العاص رضي الله عنه',
              'جعفر بن أبي طالب رضي الله عنه',
            ],
            answer: 'جعفر بن أبي طالب رضي الله عنه'
          },
        ],
      }
    ],
  },



  {
    id: 6,
    title: "الصوم والصلاة",    
    img: require("./assets/محمد_صلى_الله_عليه_وسلم.png"),
    tests: [
      {
        title: "إختبار 1",
        id: 1,
        score: 0,
        taken: false,
        questions: [
          {
            ques: "ما هي الصلاة التي تعتبر سنة مؤكدة في شهر رمضان؟",
            options: ["صلاة التراويح", "صلاة الضحى", "صلاة الوتر", "صلاة الاستخارة"],
            answer: "صلاة التراويح"
          },
          {
            ques: "ما هي صلاة الأوابين؟",
            options: ["صلاة الضحى", "صلاة الظهر", "صلاة العشاء",],
            answer: "صلاة الضحى",
          },
          {
            ques: "ما هي أول صلاة فرضت على النبي صلى الله عليه وسلم؟",
            options: ["صلاة الفجر", "صلاة العصر", "صلاة المغرب", "صلاة الظهر",],
            answer: "صلاة الظهر"
          },
          {
            ques: "ما هي الصلاة التي نكرر فيها الركوع مرتين في كل ركعة؟",
            options: ["صلاة العيد", "صلاة الخسوف والكسوف", "صلاة الاستسقاء",],
            answer: "صلاة الخسوف والكسوف",
          },
          {
            ques: "كل عمل ابن آدم له إلا ......... فإنه لي وأنا أجزي به",
            options: ["الصلاة", "الصوم", "الحج"],
            answer: "الصوم",
          },
          {
            ques: "ركعتان خير من الدنيا وما فيها ؟",
            options: ["سنة الفجر", "سنة العشاء", "صلاة الضحى"],
            answer: "سنة الفجر",
          },
          {
            ques: 'هل يجب تكرار نيّة الصيام في كل يوم من رمضان أم نيّة واحد تكفي لكل الشهر؟',
            options: ['نعم، يجب تكرار النية كل يوم', 'لا، نية واحد تكفي لكل الشهر'],
            answer: 'لا، نية واحد تكفي لكل الشهر',
          },  
          {
            ques: 'متى فُرض الصيام على المسلمين؟',
            options: ['في السنة الثانية للهجرة', 'في السنة الخامسة للهجرة', 'قبل هجرة النبي ﷺ'],
            answer: 'في السنة الثانية للهجرة',
          },
          {
            ques: 'كم عدد الصلوات التي فُرضت على أمة محمد ﷺ أول مرة؟',
            options: ['55 صلاة', '50 صلاة', '5 صلوات'],
            answer: '50 صلاة'
          },
          {
            ques: 'تسمى بالصلاة الهاجرة؟',
            options: ['صلاة الظهر', 'صلاة العصر', 'صلاة الضحى'],
            answer: 'صلاة الظهر'
          },
        ],
      },
      {
        title: "إختبار 2",
        id: 2,
        score: 0,
        taken: false,
        questions: [
          {
            ques: 'ما هما صلاتي البردين؟',
            options: ['الفجر والظهر', 'الفجر والعصر', 'المغرب والعشاء'],
            answer: 'الفجر والعصر',
            just: "صلاتي البردين هما صلاة الفجر وصلاة العصر."
              + "\n\n" + 
              "عن أبي موسى الأشعري رضي الله عنه قال: قال رسول الله ﷺ: «من صلَّى البَردينِ دخلَ الجنَّةَ»"
              + "\n\n" + 
              "وقد سميت صلاة الفجر وصلاة العصر بالبردين لأن صلاة الفجر فيها برد الليل، وصلاة العصر فيها برد النهار."
          },
          {
            ques: 'ما هي أول صلاة أقامها المسلمون بعد تحويل القبلة من بيت المقدس إلى الكعبة المشرفة؟',
            options: [
              'صلاة العصر',
              'صلاة الفجر',
              'صلاة العشاء',
              'صلاة الظهر',
            ],
            answer: 'صلاة العصر',
          },
          {
            ques: 'ما هي الصلاة التي ليس لها صلاة نوافل؟',
            options: [
              'صلاة الفجر',
              'صلاة الظهر',
              'صلاة العصر',
              'صلاة المغرب',
              'صلاة العشاء',
            ],
            answer: 'صلاة العصر',
          },
          {
            ques: 'كم عدد مرات مسح الرأس في الوضوء؟',
            options: [
              'مرة واحدة',
              'مرتان',
              'ثلاث مرات',
            ],
            answer: 'مرة واحدة',
            just: "عدد مسح الرأس في الوضوء هو مرة واحدة",
          },
          {
            ques: 'ما هي الصلاة التي تصلى طلبا لنزول الغيث (المطر)؟',
            options: [
              'صلاة الإستخارة',
              'صلاة الإستسقاء',
              'صلاة قيام الليل',
              'صلاة التهجد',
            ],
            answer: 'صلاة الإستسقاء',
            just: "الصلاة التي تصلى طلبا لنزول الغيث (المطر) هي صلاة الإستسقاء",
          },
          {
            ques: 'ما هي الصلاة التي في كل ركعة قيامان و قراءتان و ركوعان و سجودان؟',
            options: [
              'صلاة الضحى',
              'صلاة الإستخارة',
              'صلاة الخسوف والكسوف',
              'صلاة التهجد',
            ],
            answer: 'صلاة الخسوف والكسوف',
            just: "الصلاة التي في كل ركعة قيامان و قراءتان و ركوعان و سجودان هي صلاة الخسوف والكسوف.",
          },
          {
            ques: 'ماذا نقول في السجود؟',
            options: [
              'سبحان ربي الأعلى',
              'سبحان ربي العظيم',
              'سمع الله لمن حمده ربنا ولك الحمد'
            ],
            answer: 'سبحان ربي الأعلى',
            just: 'نقول في السجود "سبحان ربي الأعلى" ثلاث مرات، ويجوز قولها أكثر والدعاء أيضا.',
          },
          {
            ques: 'ماذا نقول في الركوع؟',
            options: [
              'سبحان ربي الأعلى',
              'سبحان ربي العظيم',
              'سمع الله لمن حمده ربنا ولك الحمد'
            ],
            answer: 'سبحان ربي العظيم',
            just: 'نقول في الركوع "سبحان ربي العظيم" ثلاث مرات، ويجوز قولها أكثر والدعاء أيضا.',
          },
          {
            ques: 'ماذا نقول بعد القيام من الركوع؟',
            options: [
              'سمع الله لمن حمده ربنا ولك الحمد',
              'سبحان ربي العظيم',
              'سبحان ربي الأعلى'
            ],
            answer: 'سمع الله لمن حمده ربنا ولك الحمد',
            just: 'نقول بعد القيام من الركوع "سمع الله لمن حمده ربنا ولك الحمد"',
          },
          {
            ques: 'ما هو عدد فرائض الوضوء في القرآن؟',
            options: [
              '6',
              '7',
              '4',
              '8'
            ],
            answer: '4',
            just: "عدد فرائض الوضوء في القرآن هو 4"
              + "\n\n" + 
              "قال الله عز وجل في سورة المائدة في الآية 6:"
              + "\n\n" + 
              "٥۝ يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِن كُنتُم مَّرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِّنكُم مِّنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ ٦۝"
          },
        ],
      },
    ],
  },
];
