import { View, Text, FlatList } from 'react-native'
import React from 'react'
import { useSelector } from 'react-redux'

const data = [
  { 
    basmallah: "بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ",
    title: "آية الكرسي (مرة واحدة)",
    text: "الله لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ٥٥٢۝",
  },
  { 
    title: "سورة الإخلاص (3 مرات)",
    basmallah: "بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ",
    text: "قُلۡ هُوَ ٱلله أَحَدٌ ١۝ ٱلله ٱلصَّمَدُ ٢۝ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ٣۝ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ٤۝",
    source: "صحيح أبي داود 5082",
  },
  { 
    title: "سورة الفلق (3 مرات)",
    basmallah: "بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ",
    text: "قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ١۝ مِن شَرِّ مَا خَلَقَ ٢۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣۝ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ٤۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥۝",
    source: "صحيح أبي داود 5082",
  },
  { 
    title: "سورة الناس (3 مرات)",
    basmallah: "بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ",
    text: "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١۝ مَلِكِ ٱلنَّاسِ ٢۝ إِلَٰهِ ٱلنَّاسِ ٣۝ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ٤۝ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ٥۝ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ٦۝",
    source: "صحيح أبي داود 5082",
  },
  { 
    title: "(3 مرات)",
    text: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ",
    source: "صحيح مسلم 2726",
  },
  { 
    title: "(3 مرات)",
    text: "اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ، اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ",
    source: "صحيح أبي داود 5090",
  },
  { 
    title: "(3 مرات)",
    text: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ",
    source: "صحيح أبي داود 5088",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهمَّ بِكَ أصبَحنا، وبِكَ أمسَينا، وبِكَ نَحيا وبِكَ نَموتُ وإليكَ النُّشورُ",
    source: "الكلم الطيب 20",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
    source: "صحيح ابن ماجه 762",
  },
  {
    title: "(مرة واحدة)",
    text: "اللهم إني أسألُك العافيةَ في الدنيا والآخرةِ ، اللهم إني أسألُك العفوَ والعافيةَ في ديني ودنياي وأهلي ومالي ، اللهم استرْ عورتي وآمنْ روعاتي ، اللهم احفظْني مِن بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي ، وأعوذُ بعظمتِك أن أُغتالَ مِن تحتي",
    source: "صحيح أبي داود 5074",
  },
  {
    title: "(مرة واحدة)",
    text: "أَصْبَحْنَا وَأَصْبَحَ المُلْكُ لِله وَالْحَمْدُ لله، لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ، وَهو علَى كُلِّ شَيءٍ قَدِيرٌ، اللَّهُمَّ أَسْأَلُكَ خَيْرَ هذِه اللَّيْلَةِ، وَأَعُوذُ بكَ مِن شَرِّ هذِه اللَّيْلَةِ وَشَرِّ ما بَعْدَهَا، اللَّهُمَّ إنِّي أَعُوذُ بكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ، اللَّهُمَّ إنِّي أَعُوذُ بكَ مِن عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ.",
    source: "صحيح مسلم 2723",
  },
  {
    title: "(مرة واحدة)",
    text: "اللهم فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كلِّ شيءٍ ومليكَه، أشهدُ أن لا إله إلا أنت، أعوذُ بك من شرِّ نفسي، وشرِّ الشيطانِ وشِرْكِه",
    source: "صحيح أبي داود 5067",
  },
  // { 
  //   title: "(مرة واحدة)",
  //   text: "أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق",
  // },

  // { 
  //   title: "(مرة واحدة)",
  //   text: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ صلى الله عليه وسلم رسولًا",
  // },

  { 
    title: "(مرة واحدة)",
    text: "يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ، أصلِحْ لِي شأنِي كلَّهُ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ",
    source: "صحيح الجامع 5820",
  },
  {
    title: "(مرة واحدة)",
    text: "أصبَحْنا على فِطْرةِ الإسلامِ، وكَلمةِ الإخلاصِ، وسُنَّةِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، ومِلَّةِ أَبينا إبراهيمَ حَنيفًا مُسلِمًا، وما كان منَ المُشرِكينَ",
    source: "تخريج المسند لشعيب 21144",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ",
    source: "صحيح البخاري 6306",
  },
  {
    title: "100 مرة",
    text: "أستغفر الله العظيم واتوب اليه",
    source: "صحيح الجامع 5534",
  },
  {
    title: "100 مرة",
    text: "سبحان الله وبحمده",
  },
  {
    title: "100 مرة",
    text: "اللهم صل وسلم على نبينا محمد وعلى آله وصحبه أجمعين",
  },
  {
    title: "100 مرة",
    text: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير",
  }
]

const Morning = () => {

  const color = useSelector(state => state.app.themeColor.list)
  const textColor = useSelector(state => state.app.themeColor.background)


  const renderItem = ({ item, index }) => (
    <View className="mb-5 space-y-2">
      {item.title && <Text className="text-xl font-[CairoB] text-center" style={{color: textColor}}>{item.title}</Text>}
      <View className={`p-3 ${color} dark:bg-slate-700 rounded-md space-y-1`}>
        {item.basmallah && <Text className="text-white text-xl text-center">{item.basmallah}</Text> }
        <Text className="text-white text-xl leading-8">{item.text}</Text>
        {item.source &&<Text className="text-lg text-black text-center font-bold">{item.source}</Text>}
      </View>
    </View>
  );

  return (
    <View className="p-3 py-0">
      <FlatList
        data={data}
        renderItem={renderItem}
        keyExtractor={(item, index) => index.toString()}
        showsVerticalScrollIndicator={false}
        contentContainerStyle={{paddingTop: 12}}
      />
    </View>
  )
}

export default Morning