import { View, Text, FlatList } from 'react-native'
import React from 'react'
import { useSelector } from 'react-redux'

const data = [
  { 
    title: "آية الكرسي (مرة واحدة)",
    text: "الله لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ٥٥٢۝",
  },
  { 
    title: "سورة الإخلاص (3 مرات)",
    text: "قُلۡ هُوَ ٱلله أَحَدٌ ١۝ ٱلله ٱلصَّمَدُ ٢۝ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ٣۝ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ٤۝",
  },
  { 
    title: "سورة الفلق (3 مرات)",
    text: "قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ١۝ مِن شَرِّ مَا خَلَقَ ٢۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣۝ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ٤۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥۝",
  },
  { 
    title: "سورة الناس (3 مرات)",
    text: "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١۝ مَلِكِ ٱلنَّاسِ ٢۝ إِلَٰهِ ٱلنَّاسِ ٣۝ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ٤۝ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ٥۝ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ٦۝",
  },
  { 
    title: "(3 مرات)",
    text: "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ",
  },
  { 
    title: "(3 مرات)",
    text: "اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ، اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ"
  },
  { 
    title: "(3 مرات)",
    text: "بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهمَّ بِكَ أمسَينا وبِكَ أصبَحنا وبِكَ نَحيا وبِكَ نموتُ ، وإليكَ المصيرُ",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا",
  },
  { 
    title: "(مرة واحدة)",
    text: "أعوذُ بِكلِماتِ اللهِ التَّامَّاتِ من شَرِّ ما خلق",
  },
  { 
    title: "(مرة واحدة)",
    text: "رَضيتُ بالله ربًّا، وبالإسلامِ دينًا، وبِمُحمَّدٍ صلى الله عليه وسلم رسولًا",
  },
  { 
    title: "(مرة واحدة)",
    text: "يا حيُّ يا قيُّومُ برحمتِكِ أستغيثُ، أصلِحْ لِي شأنِي كلَّهُ، ولا تكِلْنِي إلى نفسِي طرْفةَ عيْنٍ",
  },
  {
    title: "(مرة واحدة)",
    text: "أصبَحْنا على فِطْرةِ الإسلامِ، وكَلمةِ الإخلاصِ، وسُنَّةِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ، ومِلَّةِ أَبينا إبراهيمَ حَنيفًا مُسلِمًا، وما كان منَ المُشرِكينَ",
  },
  { 
    title: "(مرة واحدة)",
    text: "اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي؛ فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ",
  },
  {
    title: "100 مرة",
    text: "أستغفر الله وأتوب إليه"
  },
  {
    title: "100 مرة",
    text: "اللهم صل وسلم على نبينا محمد وعلى آله وصحبه أجمعين",
  },
  {
    title: "100 مرة",
    text: "لا إله إلا الله وحده لا شريك له الملك وله الحمد وهو على كل شيء قدير"
  }
]

const Night = () => {

  const color = useSelector(state => state.app.themeColor.list)
  const textColor = useSelector(state => state.app.themeColor.background)

  const renderItem = ({ item, index }) => (
    <View className="mb-5 space-y-2">
      {item.title && <Text className="text-xl font-[CairoB] text-center" style={{color: textColor}}>{item.title}</Text>}
      <View className={`p-3 ${color} dark:bg-slate-700 rounded-md`}>
        <Text className="text-white text-xl">{item.text}</Text>
      </View>
    </View>
  );

  return (
    <View className="p-3 py-0">
      <FlatList
        data={data}
        renderItem={renderItem}
        keyExtractor={(item, index) => index.toString()}
        showsVerticalScrollIndicator={false}
        contentContainerStyle={{paddingTop: 12}}
      />
    </View>
  )
}

export default Night;